[
    [
        {
            "start": 0,
            "end": 6.37304,
            "text_on_screen": "Tik Tok @miss_noodles23 If you're not real @miss noodles23 Then how come I feel this way Then how come feel this little bables little babies",
            "per_shot_summaries": "\"Shot 1: A 6-second shot featuring a resting dog on stuffed toys. As the dog looks up towards the camera, the onscreen text and audio voiceover pose the question, 'If you're not real, then how come I feel this way? Little babies?'"
        },
        {
            "start": 6.37304,
            "end": 10.377043710377045,
            "text_on_screen": "TikTok",
            "per_shot_summaries": "Shot 2: This 4-second shot presents a black background with no accompanying audio. There is no significant action described in this shot.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 5.84848,
            "text_on_screen": "Tik Tok @mealsandmunchies TikTok",
            "per_shot_summaries": "\"Shot 1: The video starts with a duration of 6 seconds of a man putting cheese on a skillet full of macaroni while speaking about the simplicity and deliciousness of the impending dinner dish which necessitate only five things."
        },
        {
            "start": 5.84848,
            "end": 8.21212,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: In the following 2 seconds, we see a person using tongs to cook ground beef or turkey in a skillet while also suggesting boiling a pot of water."
        },
        {
            "start": 8.21212,
            "end": 11.3939,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: Over the next 3 seconds, the shot focuses on the continued preparation of ground beef in a pan on the stove, while recommending to add tortellini once the water boils."
        },
        {
            "start": 11.3939,
            "end": 15.697,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: During a 4-second shot, we see an individual grinding garlic in a food processor and talking about shredding some mozzarella cheese according to the package."
        },
        {
            "start": 15.697,
            "end": 16.6667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: The next shot lasting 1 second shows a person adding shredded cheese to a bowl, while simultaneously suggesting a recommended product on Amazon."
        },
        {
            "start": 16.6667,
            "end": 20.9697,
            "text_on_screen": "@ mealsandmunchies",
            "per_shot_summaries": "Shot 6: Over the course of 4 seconds, we watch ground meat being sprinkled with spices in a pan while the speaker mentions their storefront and suggests seasoning the meat with salt, pepper, and Italian seasoning."
        },
        {
            "start": 20.9697,
            "end": 24.4545,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: With a duration of 3 seconds, the video shows a burger being fried in a pan, complemented by the addition of crushed chili flakes and instructions to drain."
        },
        {
            "start": 24.4545,
            "end": 26.303,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: The following 2-second clip showcases a person pouring marinara sauce over the meat in a skillet while talking about it."
        },
        {
            "start": 26.303,
            "end": 28.1515,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: Continuing with the 2-second segment, the cooking process progresses to incorporating meat and tomato sauce in a pan while suggesting adding a block of cream cheese."
        },
        {
            "start": 28.1515,
            "end": 31.3333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: The next three seconds capture the process of cooking beef in a pan with tomato sauce and cheese, hinting at the addition of the already cooked tortellini."
        },
        {
            "start": 31.3333,
            "end": 32.6061,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: A brief, one-second scene shows the person preparing a pasta dish with spaghetti sauce."
        },
        {
            "start": 32.6061,
            "end": 33.9091,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 12: This one-second shot portrays the preparation of a tortellini dish in a large pan."
        },
        {
            "start": 33.9091,
            "end": 35.3939,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 13: Another swift shot lasting only a second focuses on the addition of mozzarella cheese to a skillet filled with food."
        },
        {
            "start": 35.3939,
            "end": 36.6667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 14: The video then moves to a frying pan brimming with cheese-coated pizza and bakes it for 10 minutes."
        },
        {
            "start": 36.6667,
            "end": 37.7576,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15: An iRobot cooking scene goes by in a single second mention of baking at 350 degrees."
        },
        {
            "start": 37.7576,
            "end": 40.3333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 16: Over 3 seconds, a young blonde woman is depicted enjoying a plateful of the cooked dish, as the speaker prompts the viewer to follow their channel for more recipes."
        },
        {
            "start": 40.3333,
            "end": 40.3636,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 17: Despite having no text, speech, or action, the subsequent shot lasting zero seconds serves as a brief pause in the video."
        },
        {
            "start": 40.3636,
            "end": 43.24242424242424,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 18: The final 3 seconds of the video are dedicated to the display of the TikTok logo against a dark background.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 6.1,
            "text_on_screen": "Tik Tok my cat after sleeping for @ichysmom 18 hours, stomping on my head at 4:00am until i fed him, and beating up his little brother for no reason TikTok",
            "per_shot_summaries": "\"Shot 1: A 6-second shot featuring a white cat yawning and lying down. The on-screen text refers to the cat's mischievous behavior, like sleeping for 18 hours, stomping on someone's head at early morning, and showing aggression towards its sibling. The audio transcript reveals someone remarking 'Lord have mercy' as if in disbelief, and comments about the cat's drinking."
        },
        {
            "start": 6.1,
            "end": 10.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: A 4-second shot with no audio or on-screen text, only showcasing a dark background.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 77.6333,
            "text_on_screen": "Tik Tok @elysebelll",
            "per_shot_summaries": "\"Shot 1 is 78 seconds long displaying a young girl standing at a desk with her arm behind her back. She is heard singing with the lyrics, 'I hate to see my heart is singing. Don't Let Go. Hopelessly.'"
        },
        {
            "start": 77.6333,
            "end": 81.63333333333334,
            "text_on_screen": "TikTok",
            "per_shot_summaries": "Shot 2 lasts for 4 seconds showing a screenshot of the application.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 5.13847,
            "text_on_screen": "TikTok Tik Tok",
            "per_shot_summaries": "\"Shot 1: A 5-second shot featuring two dogs frolicking in the pool under the sunshine. The screen text reads 'TikTok Tik Tok' and there's someone exclaiming 'Wait, wait. Wait wait.'"
        },
        {
            "start": 5.13847,
            "end": 9.142475809142477,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: A brief 4-second shot focusing on a dark background.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 3.03333,
            "text_on_screen": "Let's make the salad Jennifer Aniston ate everyday on the set of Friends Tik Tok @nourished.by.mads TikTok",
            "per_shot_summaries": "\"SHOT 1: A 3-second shot showing a lady holding a large salad bowl, mentioning she is making the salad Jennifer Aniston ate everyday on the set of Friends."
        },
        {
            "start": 3.03333,
            "end": 5.98333,
            "text_on_screen": "3 cups cooked quinoa @ nourished.by.mads",
            "per_shot_summaries": "SHOT 2: In a 3-second span, we see a visual guide to preparing 3 cups of cooked quinoa."
        },
        {
            "start": 5.98333,
            "end": 8.96667,
            "text_on_screen": "1 cup cucumber",
            "per_shot_summaries": "SHOT 3: For another 3 seconds, cucumbers in a cup appear on screen."
        },
        {
            "start": 8.96667,
            "end": 11.4833,
            "text_on_screen": "1/3 cup red onion",
            "per_shot_summaries": "SHOT 4: We watch someone mixing cucumbers and red onions in a bowl over 3 seconds, with text stating 1/3 cup of red onion is used."
        },
        {
            "start": 11.4833,
            "end": 24.4167,
            "text_on_screen": "1/2 cup roasted, salted pistachios 1/2 cup mint 1/2 cup parsley nourished.by.mads 1/2 cup feta cheese 115 oz can chickpeas 1 15 oz can chickpeas",
            "per_shot_summaries": "SHOT 5: A relatively long shot, 13 seconds, emphasizing preparing various salad ingredients: 1/2 cup of pistachios, mint, parsley, feta cheese, and chickpeas."
        },
        {
            "start": 24.4167,
            "end": 26.95,
            "text_on_screen": "2 lemons, juiced",
            "per_shot_summaries": "SHOT 6: For 3 seconds, the screen shows lemon juice being poured over the chickpea salad."
        },
        {
            "start": 26.95,
            "end": 29.9333,
            "text_on_screen": "1/4 cup olive oil",
            "per_shot_summaries": "SHOT 7: Olive oil is then shown to be added to the kale salad with chickpeas, all in 3 seconds."
        },
        {
            "start": 29.9333,
            "end": 32.1167,
            "text_on_screen": "Salt & pepper",
            "per_shot_summaries": "SHOT 8: In the shortest shot, 2 seconds, we see salt and pepper being added to the salad."
        },
        {
            "start": 32.1167,
            "end": 34.1833,
            "text_on_screen": "",
            "per_shot_summaries": "SHOT 9: An image of a completed salad in a bowl in a kitchen for 2 seconds, with a wooden spoon on top. No text nor audio associated."
        },
        {
            "start": 34.1833,
            "end": 38.15,
            "text_on_screen": "",
            "per_shot_summaries": "SHOT 10: The last meaningful shot ends with a woman eating the salad in front of the camera for 4 seconds."
        },
        {
            "start": 38.15,
            "end": 42.266666666666666,
            "text_on_screen": "Q@nourished.by.ma...",
            "per_shot_summaries": "SHOT 11: The last frame lasts for 4 seconds and features the TikTok logo on a black background.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 20.5,
            "text_on_screen": "@jaycehallart the drawing that you're about to see is of Whitney Houston and I made it by writing her name TikTok thousands of times if you've never seen my art before, I'm Jayce & I just specialize in drawing with words names & phrases this time I actually drew on a wood panel so it made for a pretty cool texture and I am so so proud of how the smile turned out in this one it's one of my new favorites I love it a ton & I hope you dig it too",
            "per_shot_summaries": "\"Shot 1: The video begins with a 20-second shot of a man with glasses taking a selfie at home. He announces that he is an artist named Jayce, specializing in drawing using words, names, and phrases. He has created a drawing of Whitney Houston by writing her name countless times on a wooden panel and is especially proud of the depiction of her smile."
        },
        {
            "start": 20.5,
            "end": 23.0333,
            "text_on_screen": "Whitney Houston",
            "per_shot_summaries": "Shot 2: The second shot is three seconds long, showing someone writing the name 'Whitney Houston' on a wood panel with a marker. The action seems to signify the beginning of a new drawing."
        },
        {
            "start": 23.0333,
            "end": 25.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: The next shot lasting 2 seconds shows the actual process of drawing a human face using a pen on a wooden surface."
        },
        {
            "start": 25.0333,
            "end": 26.2,
            "text_on_screen": "SAKURA COLOR PRC",
            "per_shot_summaries": "Shot 4: For a single second, shot 4 gives a closer look at the drawing process on wood, focusing on the pen which is labelled 'SAKURA COLOR PRC'."
        },
        {
            "start": 26.2,
            "end": 27.1667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: In another one-second shot, the video continues to showcase the artist at work, drawing an image on a wood panel with a pen."
        },
        {
            "start": 27.1667,
            "end": 33.8,
            "text_on_screen": "@jaycehallarti",
            "per_shot_summaries": "Shot 6: A seven-second long final shot reveals an old pencil drawing of a smiling woman on the wood panel, presumably completed by Jayce, showcasing the depth of his unique artistry.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 1.76667,
            "text_on_screen": "@stevenatto MSCHF MADE ANOTHER MSCHE MADE ANOTHER BIG RED BOOT",
            "per_shot_summaries": "Summary of Shot 1: The shot is a brief 2 seconds long and presents producing another big red boot with mentions of MSCHF."
        },
        {
            "start": 1.76667,
            "end": 2.93333,
            "text_on_screen": "THIS TIME IT'S YELLOW THIS TIME IT'SYELLOW AND AN OFFICIAL",
            "per_shot_summaries": "Summary of Shot 2: During this 1-second shot, it's revealed that this time around, they've produced a yellow version of the shoe in partnership with Crocs."
        },
        {
            "start": 2.93333,
            "end": 4.66667,
            "text_on_screen": "COLLABORATION WITH CROCS",
            "per_shot_summaries": "Summary of Shot 3: The shot showcases a pair of yellow plastic crocs with holes on top, indicating the collaborative project with Crocs."
        },
        {
            "start": 4.66667,
            "end": 5.9,
            "text_on_screen": "SOI NEEDED TO SEE WHAT THESE WERE LIKE",
            "per_shot_summaries": "Summary of Shot 4: The presenter expresses their curiosity about the yellow crocs as they are seen swaggering in the yellow shoes in the one-second shot."
        },
        {
            "start": 5.9,
            "end": 8.7,
            "text_on_screen": "THEY COME IN A GIANT BOX AGAIN EXCEPT THIS TIME IT'S YELLOW",
            "per_shot_summaries": "Summary of Shot 5: The crocs come in a giant box, that's yellow this time around, as explained in this 3-second video clip."
        },
        {
            "start": 8.7,
            "end": 11.5,
            "text_on_screen": "AND HAS SOME CROCS BRANDING LIKE ON THE PAPER AND THE SHOES",
            "per_shot_summaries": "Summary of Shot 6: This 3-second shot highlights the branding of Crocs, displayed on both the paper and the shoes, with a person standing on yellow paper evident in the background."
        },
        {
            "start": 11.5,
            "end": 13.4333,
            "text_on_screen": "AND THEY EVEN HAVE THE ICONIC BACK STRAP",
            "per_shot_summaries": "Summary of Shot 7: The shoes are described to have an iconic back strap, useful for combating back pain, in this 2-second shot."
        },
        {
            "start": 13.4333,
            "end": 15.7667,
            "text_on_screen": "NOW THESE ARE HUGE COMPARED TO REGULAR CROCS AND ACTUALLY HAVE",
            "per_shot_summaries": "Summary of Shot 8: This is a 2-second video explaining how these revealed Crocs are significantly larger than the standard ones."
        },
        {
            "start": 15.7667,
            "end": 15.8,
            "text_on_screen": "",
            "per_shot_summaries": "Summary of Shot 9: This shot briefly depicts a person wearing the presented yellow Crocs while walking down the street."
        },
        {
            "start": 15.8,
            "end": 19.2333,
            "text_on_screen": "THE SAME SET OF HOLES ON TOP THAT SEE THROUGH RIGHT TO YOUR FEETTOO",
            "per_shot_summaries": "Summary of Shot 10: It is revealed in this 3-second shot that these Crocs feature the same pattern of holes on top, allowing one to clearly see through to the feet underneath."
        },
        {
            "start": 19.2333,
            "end": 21.5,
            "text_on_screen": "BUT THAT STILL LEFT ME WONDERING WERE THEY COMFORTABLE",
            "per_shot_summaries": "Summary of Shot 11: Here, the presenter queries about the comfort of the shoes. The words 'Let me wondering' are visible on a pair of rubber boots worn by a man in this 2-second shot."
        },
        {
            "start": 21.5,
            "end": 21.5333,
            "text_on_screen": "",
            "per_shot_summaries": "Summary of Shot 12: In this fleeting shot, a person is seen wearing the same yellow Crocs on the road."
        },
        {
            "start": 21.5333,
            "end": 23.4667,
            "text_on_screen": "WELL THEY'RE A LOT LIGHTER THAN THE ORIGINAL PAIR AND GO UP",
            "per_shot_summaries": "Summary of Shot 13: The presenter comments that these shoes are lighter than the original pair, with text on the shoes that reads 'lighter than' as reference."
        },
        {
            "start": 23.4667,
            "end": 25.1333,
            "text_on_screen": "JUST AS HIGH ON YOUR LEG WHICHITRIED",
            "per_shot_summaries": "Summary of Shot 14: This 2-second shot emphasizes that the Crocs can go on either your lower or upper leg and the presenter experimented with both options."
        },
        {
            "start": 25.1333,
            "end": 28.8667,
            "text_on_screen": "WHICHI TRIED WITH BOTHSHORTS AND PANTS BUT SINCE THEY ARE BASICALLY A PAIR OF CROCS",
            "per_shot_summaries": "Summary of Shot 15: A 4-second shot shows a man wearing both shorts and pants with the yellow Crocs, concluding that they are pretty much just a pair of regular Crocs in different attire."
        },
        {
            "start": 28.8667,
            "end": 30.3,
            "text_on_screen": "THEY'RE ACTUALLY PRETTY COMFORTABLE",
            "per_shot_summaries": "Summary of Shot 16: To conclude, these Crocs are deemed quite comfortable as indicated in this one-second video of two crocs stomping around in boots."
        }
    ],
    [
        {
            "start": 0,
            "end": 57.4333,
            "text_on_screen": "If someone's phone rings in the midd le of the class, they have to put it on speaker. TikTok @funny.life5.usa @basicallytheinternet Answer it! If someone's phone rings in the middle of I Tik Tok Uh, hello? Hello, is this Ms. Nefco TikTok Yes? Hi, this is Kevin from the TikTok you to inform you thatny.life5.usa you to inform you thaannylife5.usa you to inform you thany.lifes usa you to inform you thaton the test results have codeTikTok back positive. Congratula Okay, you might - TikTok you might want to shut that down Thank you - There is no need to wody TikTok but we will be in contad TikTok with you throughofunny.life5.usa but we will be in conta TikTok this whole process. S TikTok don't worry about anying. ife5.usa don't worry about any ringlife5.usa We provide counseling ada TikTok at no charge Thank you funnylife5.usa going to name the banny.life5.usa ousa The first name will be April The first name TikTok will be April @funny.life5.usa name will be Foola funnylife 5.usa and the middle name will be Fool funny.life5.usa name will be Foolfunny.life5.usa",
            "per_shot_summaries": "\"Shot 1: Over the span of 57 seconds, a man is seated in a classroom with a laptop. The scene is coupled with an interesting text on screen concerning a unique rule where any phone call in the middle of class must be answered through speakerphone. The conversation involved a person receiving news that they are expecting."
        },
        {
            "start": 57.4333,
            "end": 59.86666666666667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: Short duration of 2 seconds showing the teacher in a classroom receiving a phone call.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 2.23333,
            "text_on_screen": "@askinem Venus my my favol my favorite mini's from KIOK LANEIGE touchland",
            "per_shot_summaries": "Shot 1 features beauty and makeup products such as KIOK LANEIGE and touchland positioned on a bed."
        },
        {
            "start": 2.23333,
            "end": 2.53333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2 shows a box of tissues located next to a bed."
        },
        {
            "start": 2.53333,
            "end": 2.8,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 3, a hand is seen opening a box of powder."
        },
        {
            "start": 2.8,
            "end": 3.06667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4 involves a person holding open a box of coffee beans."
        },
        {
            "start": 3.06667,
            "end": 4.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5 shows a tissue bag purposed for bed sheets, also known as a titotil."
        },
        {
            "start": 4.1,
            "end": 4.43333,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "Shot 6 doesn't include anything to mention due to the constraints."
        },
        {
            "start": 4.43333,
            "end": 4.83333,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 7, a hand is placed on top of a white bed."
        },
        {
            "start": 4.83333,
            "end": 5.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8 introduces a sleep mask, inviting viewers to question whether it's worth the hype."
        },
        {
            "start": 5.1,
            "end": 5.7,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9 displays a smart bracelet affiliated with TikTok."
        },
        {
            "start": 5.7,
            "end": 6.13333,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 10, a person's hand is interacting with their bracelet while laying on a bed."
        },
        {
            "start": 6.13333,
            "end": 6.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11 has two hands resting on a bed, with a suggested association to TikTok."
        },
        {
            "start": 6.4,
            "end": 6.6,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 12, a pink object—referenced as a \"tok bed\"—is shown floating over the sheets."
        },
        {
            "start": 6.6,
            "end": 6.86667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 13 doesn't involve anything to summarize due to the constraints."
        },
        {
            "start": 6.86667,
            "end": 7.13333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 14 presents a reusable electronic breast pump that is notable for its discreetness."
        },
        {
            "start": 7.13333,
            "end": 7.43333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15 displays a person gripping an arm of a white garment."
        },
        {
            "start": 7.43333,
            "end": 7.76667,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 16, someone's hand is holding up a pink pill."
        },
        {
            "start": 7.76667,
            "end": 8.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 17 shows a picture of a white sheet laid out on a bed."
        },
        {
            "start": 8.3,
            "end": 8.66667,
            "text_on_screen": "LIP SLEEPING MASK MASQUE DE NUIT [BERRY / FRUITS ROUGES POUR LES LEVRES",
            "per_shot_summaries": "In Shot 18, a box of cosmetics marked \"Lip Sleeping Mask\" in multiple languages, including \"Masque De Nuit\" and \"Fruits Rouges Pour Les Levres\", is placed on a bed."
        },
        {
            "start": 8.66667,
            "end": 8.96667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 19 involves a pink box, potentially related to TikTok."
        },
        {
            "start": 8.96667,
            "end": 9.26667,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 20, a new product line from TikTok, \"TikTok Beauty Box\" is introduced."
        },
        {
            "start": 9.26667,
            "end": 9.56667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 21 doesn't provide anything to mention due to the constraints."
        },
        {
            "start": 9.56667,
            "end": 9.86667,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 22, an image shows someone applying pink nail polish to their own fingers."
        },
        {
            "start": 9.86667,
            "end": 10.1333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 23 features a product identified as Lanczee Lancre eye cream or gel creme."
        },
        {
            "start": 10.1333,
            "end": 10.8333,
            "text_on_screen": "LANEIG",
            "per_shot_summaries": "In Shot 24, a lip balm product from the brand Laneige, tinted in love red, is displayed."
        },
        {
            "start": 10.8333,
            "end": 11.1333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 25 involves a person applying lotion onto their arm."
        },
        {
            "start": 11.1333,
            "end": 11.4667,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 26, an air mattress is presented without any additional context."
        },
        {
            "start": 11.4667,
            "end": 12.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 27 shows a pink plastic device set in front of a bed."
        },
        {
            "start": 12.1,
            "end": 12.4333,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 28, an individual is seen holding a pink toothbrush to their wrist."
        },
        {
            "start": 12.4333,
            "end": 12.7667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 29 presents a scene of a phone being revealed as a pink case is opened."
        },
        {
            "start": 12.7667,
            "end": 13.0667,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 30, a girl is seen holding an unidentified pink plastic product."
        },
        {
            "start": 13.0667,
            "end": 13.3667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 31 involves a \"trik\" bed sheet that features a sock for temperature sensing."
        },
        {
            "start": 13.3667,
            "end": 13.7,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 32, someone is holding a piece of white plastic."
        },
        {
            "start": 13.7,
            "end": 14.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 33 presents a snore alarm app without other context."
        },
        {
            "start": 14.3,
            "end": 14.6333,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 34, a bedsheet cleaning solution is offered."
        },
        {
            "start": 14.6333,
            "end": 15.2667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 35 shows a person holding a piece of tissue, presumably to fold it."
        },
        {
            "start": 15.2667,
            "end": 15.6,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 36, a white bed clothed with a bedsheet and an electric blanket, is shown."
        },
        {
            "start": 15.6,
            "end": 16.2333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 37 involves a mattress protector developed for bed sheets, associated with a hotel in Singapore."
        },
        {
            "start": 16.2333,
            "end": 16.5,
            "text_on_screen": "Lip Glowy Balm",
            "per_shot_summaries": "In Shot 38, a Lip Glowy Balm is displayed."
        },
        {
            "start": 16.5,
            "end": 16.7667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 39 doesn't have anything to mention due to the constraints."
        },
        {
            "start": 16.7667,
            "end": 17.1333,
            "text_on_screen": "Fruits rouge",
            "per_shot_summaries": "In Shot 40, a pink tube of lipstick known as \"Fruits Rouge\" is placed on a bed."
        },
        {
            "start": 17.1333,
            "end": 17.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 41 involves two hands holding a tube of lipstick next to a bed."
        },
        {
            "start": 17.5,
            "end": 17.8,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 42, a person is holding onto a tube of lipstick while in bed."
        },
        {
            "start": 17.8,
            "end": 20.3,
            "text_on_screen": "Sweet Orange Bergamot + Aloe",
            "per_shot_summaries": "Shot 43 presents an array of makeup items organized on a white bed, accompanied by a pink towel, and labeled as \"Sweet Orange Bergamot + Aloe\"."
        }
    ],
    [
        {
            "start": 0,
            "end": 5.86667,
            "text_on_screen": "@freyadish -",
            "per_shot_summaries": "\"Shot 1 shows an egg being poured into an egg yolk and lasts for 6 seconds."
        },
        {
            "start": 5.86667,
            "end": 11.1333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2, a 5 seconds shot, features a pitcher of milk being poured on top of strawberries."
        },
        {
            "start": 11.1333,
            "end": 15.0333,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 3, with a duration of 4 seconds, a bowl of flour is being poured into a bowl next to strawberries."
        },
        {
            "start": 15.0333,
            "end": 18.8667,
            "text_on_screen": "",
            "per_shot_summaries": "The 4th Shot is a 4-second clip of a person mixing a batter in a bowl."
        },
        {
            "start": 18.8667,
            "end": 21.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5 is a 2 seconds shot of a clear bowl filled with peanut butter and strawberries."
        },
        {
            "start": 21.0333,
            "end": 26.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6, lasting 5 seconds, displays fresh strawberries being stirred with water being sprinkled."
        },
        {
            "start": 26.4,
            "end": 28.2333,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 7, strawberries are being added to a pan on a table within a span of 2 seconds."
        },
        {
            "start": 28.2333,
            "end": 30.3,
            "text_on_screen": "",
            "per_shot_summaries": "Over 2 seconds, the 8th shot shows a pan full of strawberries that is being prepared with the spoon."
        },
        {
            "start": 30.3,
            "end": 32.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9 captures a woman mixing strawberry sauce with a spatula over 2 seconds."
        },
        {
            "start": 32.0333,
            "end": 35.4,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 10, lasting 3 seconds, some sugar is shown in a glass dish with strawberries next to it."
        },
        {
            "start": 35.4,
            "end": 36.5333,
            "text_on_screen": "",
            "per_shot_summaries": "The 11th shot, a 1-second clip, displays flour, sugar, strawberry and butter in a glass bowl."
        },
        {
            "start": 36.5333,
            "end": 38.4333,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 12, a bowl of flour and a spoon are displayed next to strawberries over 2 seconds."
        },
        {
            "start": 38.4333,
            "end": 40.1667,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "The 13th shot, lasting 2 seconds, showcases brown and white cupcake liners."
        },
        {
            "start": 40.1667,
            "end": 41.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 14 pictures cream and strawberries surrounded by paper cups in a frame of 1-second."
        },
        {
            "start": 41.0333,
            "end": 42.9333,
            "text_on_screen": "",
            "per_shot_summaries": "The 15th shot, over 2 seconds, presents strawberry truffle cookies in paper muffin cases."
        },
        {
            "start": 42.9333,
            "end": 49.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 16, a 6-second clip, features a large plate with strawberry tarts in white paper cups."
        },
        {
            "start": 49.3,
            "end": 52.6667,
            "text_on_screen": "",
            "per_shot_summaries": "In the 17th shot, strawberries and cheesecake are shown in pastry cups over 3 seconds."
        },
        {
            "start": 52.6667,
            "end": 53.7,
            "text_on_screen": "",
            "per_shot_summaries": "The 18th shot, lasting just 1 second, presents strawberry muffins with crumble toppings."
        },
        {
            "start": 53.7,
            "end": 54.7333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 19 exhibits strawberry ricotta muffins on a plate in a 1-second clip."
        },
        {
            "start": 54.7333,
            "end": 57.6333,
            "text_on_screen": "",
            "per_shot_summaries": "The 20th shot, lasting for 3 seconds, features cranberry-nut butter cup muffins."
        },
        {
            "start": 57.6333,
            "end": 61.3,
            "text_on_screen": "",
            "per_shot_summaries": "The final Shot 21, a 4-seconds clip, showcases cranberry crumble muffins - kilokki.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 1.28333,
            "text_on_screen": "Tik Tok @_catben_",
            "per_shot_summaries": "The first shot involves interaction with a kitchen sink."
        },
        {
            "start": 1.28333,
            "end": 1.88333,
            "text_on_screen": "",
            "per_shot_summaries": "In the next shot, a sink is observed being washed with green and red water."
        },
        {
            "start": 1.88333,
            "end": 2.48333,
            "text_on_screen": "",
            "per_shot_summaries": "During the third shot, the focus is on revealing the trash drawer in a kitchen."
        },
        {
            "start": 2.48333,
            "end": 3.1,
            "text_on_screen": "",
            "per_shot_summaries": "The fourth shot shows a person making use an open trash bin with a trash bag."
        },
        {
            "start": 3.1,
            "end": 3.4,
            "text_on_screen": "",
            "per_shot_summaries": "A bottle of cleaning solution is held in the fifth shot."
        },
        {
            "start": 3.4,
            "end": 3.8,
            "text_on_screen": "",
            "per_shot_summaries": "The sixth shot focuses on a jug dispenser."
        },
        {
            "start": 3.8,
            "end": 4.16667,
            "text_on_screen": "",
            "per_shot_summaries": "The next scene involves a black silicone bowl featuring some text."
        },
        {
            "start": 4.16667,
            "end": 4.8,
            "text_on_screen": "",
            "per_shot_summaries": "In the eight shot, water is poured into a black bowl."
        },
        {
            "start": 4.8,
            "end": 5.4,
            "text_on_screen": "",
            "per_shot_summaries": "The ninth shot displays a black bowl filled with water located on the ground."
        },
        {
            "start": 5.4,
            "end": 5.9,
            "text_on_screen": "",
            "per_shot_summaries": "The technological capabilities of an application are highlighted in the tenth shot."
        },
        {
            "start": 5.9,
            "end": 6.56667,
            "text_on_screen": "",
            "per_shot_summaries": "The eleventh shot shows a man using a phone stand in a kitchen setting."
        },
        {
            "start": 6.56667,
            "end": 7.68333,
            "text_on_screen": "",
            "per_shot_summaries": "An ad for soap is presented in the twelfth shot."
        },
        {
            "start": 7.68333,
            "end": 8.6,
            "text_on_screen": "",
            "per_shot_summaries": "A toothbrush is used to clean an oven in the following shot."
        },
        {
            "start": 8.6,
            "end": 9.28333,
            "text_on_screen": "TikTok",
            "per_shot_summaries": "In the fourteenth shot, a pink tub cleaner is showcased."
        },
        {
            "start": 9.28333,
            "end": 10.2,
            "text_on_screen": "",
            "per_shot_summaries": "For the fifteenth shot, an emulsion clean up in the kitchen takes the spotlight."
        },
        {
            "start": 10.2,
            "end": 10.8,
            "text_on_screen": "",
            "per_shot_summaries": "In the sixteenth shot, a counter is cleaned using a pink bottle of cleaning solution."
        },
        {
            "start": 10.8,
            "end": 11.6667,
            "text_on_screen": "",
            "per_shot_summaries": "The seventeenth shot shows a liquid being sprayed in a tray marked with white lines."
        },
        {
            "start": 11.6667,
            "end": 12.3333,
            "text_on_screen": "",
            "per_shot_summaries": "A close-up of a sponge in a dish is seen in the eighteenth shot."
        },
        {
            "start": 12.3333,
            "end": 13.2833,
            "text_on_screen": "",
            "per_shot_summaries": "The subsequent shot involves hand washing of a dish soap."
        },
        {
            "start": 13.2833,
            "end": 13.8833,
            "text_on_screen": "",
            "per_shot_summaries": "Following that, a sink is cleaned with soapy water in the twentieth shot."
        },
        {
            "start": 13.8833,
            "end": 14.4333,
            "text_on_screen": "",
            "per_shot_summaries": "In the following shot, a sink is cleaned using a white sponge."
        },
        {
            "start": 14.4333,
            "end": 14.8167,
            "text_on_screen": "@_catben",
            "per_shot_summaries": "A person is observed using a sponge to clean a sink in the next scene."
        },
        {
            "start": 14.8167,
            "end": 17.05,
            "text_on_screen": "",
            "per_shot_summaries": "In the twenty-third shot, a person is seen washing dishes in the sink."
        },
        {
            "start": 17.05,
            "end": 17.7167,
            "text_on_screen": "",
            "per_shot_summaries": "The twenty-fourth shot shows the washing of a sponge on a soapy dish in a sink."
        },
        {
            "start": 17.7167,
            "end": 18.4833,
            "text_on_screen": "",
            "per_shot_summaries": "A sink full of soap scum is cleaned in the twenty-fifth shot."
        },
        {
            "start": 18.4833,
            "end": 19.1333,
            "text_on_screen": "",
            "per_shot_summaries": "The twenty-sixth shot involves washing a bowl full of soap in a black sink."
        },
        {
            "start": 19.1333,
            "end": 19.9333,
            "text_on_screen": "",
            "per_shot_summaries": "In the next shot, a kitchen sink is washed with a sponge."
        },
        {
            "start": 19.9333,
            "end": 20.65,
            "text_on_screen": "",
            "per_shot_summaries": "A sink is cleaned with a sponge in the following scene."
        },
        {
            "start": 20.65,
            "end": 22.4,
            "text_on_screen": "",
            "per_shot_summaries": "Someone is observed washing a sink with soap in the twenty-ninth shot."
        },
        {
            "start": 22.4,
            "end": 23.55,
            "text_on_screen": "",
            "per_shot_summaries": "The thirtieth shot depicts a sink being washed with water from a faucet."
        },
        {
            "start": 23.55,
            "end": 24.6333,
            "text_on_screen": "",
            "per_shot_summaries": "Water spraying from a sink is captured in the thirty-first shot."
        },
        {
            "start": 24.6333,
            "end": 25.4,
            "text_on_screen": "",
            "per_shot_summaries": "The thirty-second shot is a video showcasing a drain cleaner."
        },
        {
            "start": 25.4,
            "end": 26.4,
            "text_on_screen": "",
            "per_shot_summaries": "A kitchen faucet is showcased in the thirty-third shot."
        },
        {
            "start": 26.4,
            "end": 27.1,
            "text_on_screen": "",
            "per_shot_summaries": "In the subsequent shot, liquid soap is poured into a glass jar."
        },
        {
            "start": 27.1,
            "end": 27.5,
            "text_on_screen": "",
            "per_shot_summaries": "They are seen placing pills in a glass container in the next scene."
        },
        {
            "start": 27.5,
            "end": 28.0833,
            "text_on_screen": "",
            "per_shot_summaries": "A sink plug with a blue water drop is presented in the thirty-sixth shot."
        },
        {
            "start": 28.0833,
            "end": 28.1,
            "text_on_screen": "",
            "per_shot_summaries": "Water is seen being dispersed from a hose in the following shot."
        },
        {
            "start": 28.1,
            "end": 29.7,
            "text_on_screen": "",
            "per_shot_summaries": "A sink drain filled with water is displayed in the next shot."
        },
        {
            "start": 29.7,
            "end": 30.55,
            "text_on_screen": "",
            "per_shot_summaries": "The thirty-ninth shot focuses on the drain of a sink."
        },
        {
            "start": 30.55,
            "end": 31.4167,
            "text_on_screen": "",
            "per_shot_summaries": "Next, a small black hole in a sink filled with water is showcased."
        },
        {
            "start": 31.4167,
            "end": 33.25,
            "text_on_screen": "",
            "per_shot_summaries": "Another shot of a drain, this time in a black sink filled with water, follows."
        },
        {
            "start": 33.25,
            "end": 33.7167,
            "text_on_screen": "",
            "per_shot_summaries": "The forty-second shot guides on how to make glass cleaner."
        },
        {
            "start": 33.7167,
            "end": 34.4833,
            "text_on_screen": "",
            "per_shot_summaries": "A Black sink is cleaned with a sponge in the forty-third shot."
        },
        {
            "start": 34.4833,
            "end": 35.1333,
            "text_on_screen": "",
            "per_shot_summaries": "An empty sink is cleaned with black water in the next scene."
        },
        {
            "start": 35.1333,
            "end": 35.5667,
            "text_on_screen": "Natural",
            "per_shot_summaries": "The next shot shows a hand holding a bottle of cleaning liquid in front of a sink."
        },
        {
            "start": 35.5667,
            "end": 36.3333,
            "text_on_screen": "",
            "per_shot_summaries": "Cleaning liquid is poured into a sink in the subsequent shot."
        },
        {
            "start": 36.3333,
            "end": 36.8333,
            "text_on_screen": "",
            "per_shot_summaries": "The scene changes to showing a suitable towel for a sink in the forty-seventh shot."
        },
        {
            "start": 36.8333,
            "end": 37.4833,
            "text_on_screen": "",
            "per_shot_summaries": "The following scene provides tips on how to use a cloth to remove wax and polish."
        },
        {
            "start": 37.4833,
            "end": 38.1667,
            "text_on_screen": "",
            "per_shot_summaries": "In the forty-ninth shot, a kitchen sink is being cleaned."
        },
        {
            "start": 38.1667,
            "end": 39.05,
            "text_on_screen": "",
            "per_shot_summaries": "The top of a black kitchen sink is washed in the subsequent scene."
        },
        {
            "start": 39.05,
            "end": 39.75,
            "text_on_screen": "",
            "per_shot_summaries": "A sink is rinsed out using an abrasive cleaner in the next shot."
        },
        {
            "start": 39.75,
            "end": 40.5833,
            "text_on_screen": "",
            "per_shot_summaries": "The following scenes are focused on cleaning a bathroom vanity, a black sink, stone countertops and a kitchen sink."
        },
        {
            "start": 40.5833,
            "end": 41.3667,
            "text_on_screen": "",
            "per_shot_summaries": "In the following scene, a black kitchen sink is cleaned with a cloth."
        },
        {
            "start": 41.3667,
            "end": 43.2667,
            "text_on_screen": "",
            "per_shot_summaries": "Then, a countertop is cleaned with a rag in the next scene."
        },
        {
            "start": 43.2667,
            "end": 44.45,
            "text_on_screen": "",
            "per_shot_summaries": "In the next scene, an iPod touch is seen on a stand."
        },
        {
            "start": 44.45,
            "end": 46.6833,
            "text_on_screen": "M",
            "per_shot_summaries": "The focus shifts to a universal charger in the next shot."
        },
        {
            "start": 46.6833,
            "end": 48.5167,
            "text_on_screen": "",
            "per_shot_summaries": "A kitchen towel dispenser takes the spotlight in the sixtieth shot."
        },
        {
            "start": 48.5167,
            "end": 49.3333,
            "text_on_screen": "",
            "per_shot_summaries": "The next scene depicts a person placing two bottles on a tray in a kitchen."
        },
        {
            "start": 49.3333,
            "end": 50.5333,
            "text_on_screen": "",
            "per_shot_summaries": "Water is seen being poured from a bowl into a black strainer in the sixty-second shot."
        },
        {
            "start": 50.5333,
            "end": 51.3167,
            "text_on_screen": "",
            "per_shot_summaries": "The next scene shows someone cleaning a sink with a sponge brush."
        },
        {
            "start": 51.3167,
            "end": 53.7833,
            "text_on_screen": "",
            "per_shot_summaries": "The final shot features a smart kitchen sink in black and white."
        },
        {
            "start": 53.7833,
            "end": 54.5167,
            "text_on_screen": "",
            "per_shot_summaries": ""
        },
        {
            "start": 54.5167,
            "end": 56.6,
            "text_on_screen": "",
            "per_shot_summaries": ""
        },
        {
            "start": 56.6,
            "end": 59.7167,
            "text_on_screen": "",
            "per_shot_summaries": ""
        },
        {
            "start": 59.7167,
            "end": 63.18333333333333,
            "text_on_screen": "",
            "per_shot_summaries": ""
        }
    ],
    [
        {
            "start": 0,
            "end": 1.48333,
            "text_on_screen": "TikTok @scottsreality NIKE",
            "per_shot_summaries": "\"Shot 1: A man holds a green pepper before his face. An audible countdown with numbers '1' and '2' can be heard. There's a caption displayed mentioning 'NIKE'."
        },
        {
            "start": 1.48333,
            "end": 3.25,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: Shot involves a man showcasing some hefty cucumbers. The count '3' was heard."
        },
        {
            "start": 3.25,
            "end": 4.16667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: In the next shot, the same man displays two long cucumbers, each marked with the number '3'."
        },
        {
            "start": 4.16667,
            "end": 5.36667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: This shot captures the man humorously placing two cucumbers on his face."
        },
        {
            "start": 5.36667,
            "end": 8.83333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: A man dressed in red holds up a plastic-wrapped cucumber bundle to the camera. The number '5' is heard."
        },
        {
            "start": 8.83333,
            "end": 9.65,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6: Featuring a man with cucumbers up to his face, marked with an 'X'."
        },
        {
            "start": 9.65,
            "end": 15.75,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A man appears holding a bundle of bags. The number '7' can be heard."
        },
        {
            "start": 15.75,
            "end": 15.7667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: Next shot surprisingly features a chicken eating cucumbers from a plate."
        },
        {
            "start": 15.7667,
            "end": 16.6167,
            "text_on_screen": "Follow for the next impossible challenge",
            "per_shot_summaries": "Shot 9: The shot captures a chicken in grass with some food. There's an invitation on screen asking viewers to 'Follow for the next impossible challenge'."
        },
        {
            "start": 16.6167,
            "end": 16.916666666666668,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: The final shot of the video shows a chicken standing on the ground, surrounded by scattered vegetables.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 29.733333333333334,
            "text_on_screen": "@andrecarrier_ TikTok @andrecarrier",
            "per_shot_summaries": "\"In the first shot, which lasts for 30 seconds, a man is seen playing a guitar in his room while wearing a red shirt. No spoken audio is present in this shot.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 3.36667,
            "text_on_screen": "Reply to thegrandkomodo's comment Who gonna stop me 5 songs that are criminal to play on Acoustic @kainoahbowman Reply to thegrand komodo's",
            "per_shot_summaries": "Shot 1: The video begins with a reply to a comment posing the challenge, '5 songs that are criminal to play on Acoustic'. The statement 'Five songs that are criminal to play on the acoustic guitar. Number' appears to be setting up the list."
        },
        {
            "start": 3.36667,
            "end": 11.1333,
            "text_on_screen": "Tik Tok 1.) Iron Man",
            "per_shot_summaries": "Shot 2: The first song on the list is revealed to be 'Iron Man', with the text on the screen and the man playing the guitar in the background for 8 seconds, subtitled with a comment about it being commonly heard in Guitar Center."
        },
        {
            "start": 11.1333,
            "end": 16.8,
            "text_on_screen": "2.) Sweet Child O Mine",
            "per_shot_summaries": "Shot 3: The next song considered inappropriate for acoustic play is 'Sweet Child O Mine'. This shot features visual reference to the guitar lesson for this song and a vocal affirmation that it sounds wrong on an acoustic guitar."
        },
        {
            "start": 16.8,
            "end": 23.5,
            "text_on_screen": "3.) Sunshine Of Your Love",
            "per_shot_summaries": "Shot 4: 'Sunshine Of Your Love' is the third song on the list. The shot contains the guitar tab for the song and an audio comment suggesting that despite the song being great, it should not be played on an acoustic guitar."
        },
        {
            "start": 23.5,
            "end": 51.3333,
            "text_on_screen": "4.) Some AC/DC Now the worst of all... 5.) THE FORBIDDEN RIFF",
            "per_shot_summaries": "Shot 5: The fourth song is AC/DC's song, but the focus shifts to the worst offender, a song known as 'THE FORBIDDEN RIFF.' The shot includes an extensive monologue about the inappropriateness of these songs for acoustic guitar, emphasizing that 'THE FORBIDDEN RIFF' was intended for acoustic but still shouldn't be played in such style. The visuals show a man in a baseball cap playing the guitar."
        },
        {
            "start": 51.3333,
            "end": 54.9,
            "text_on_screen": "What did I miss?",
            "per_shot_summaries": "Shot 6: The video ends with a challenge to the audience to identify any additional songs that should not be played on an acoustic guitar, alongside the text 'What did I miss?' The shot also features an image of a TikTok singer performing an acoustic cover of a Drake's song."
        }
    ],
    [
        {
            "start": 0,
            "end": 124.3,
            "text_on_screen": "Can you name all 8 Disney songs? @naluthepiaman N @naluthepia man Wait for the emoji hints @naluthepianoman 8. III",
            "per_shot_summaries": "\"Shot 1: For a duration of 124 seconds, a man is seen playing a piano. The text on screen prompts the viewer to name 8 Disney songs, with emoji hints expected to follow.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 0.0333333,
            "text_on_screen": "TikTok @samuelgrubbs @SAMUEL GRUBBS We ALL cut our cameras off and changed our names to \"Reconnecting...\"",
            "per_shot_summaries": "\"Shot 1: The video opens with a brief shot of a video chat happening on a laptop, with the text on the screen indicating the users are pretending to reconnect."
        },
        {
            "start": 0.0333333,
            "end": 19.466666666666665,
            "text_on_screen": "Speaker View Noah Weaver Obadiah Clay command Evan Mullis Jack Buza | \"Reconnecting...\" Reconnecting Reconnecting. - Reconnecting- Reconnecting9 - Reconnecting - Reconnecting9- Reconnecting.. Reconnecting. Reconnecting9 к andra Cell Sandra",
            "per_shot_summaries": "Shot 2: A 19-second shot follows, showing a closer view of the laptop screen during a conference call, accompanied by an audio instruction to move to slide 37 and an off-handed question.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 59.06666666666667,
            "text_on_screen": "@ladominiqueen Ya’ll have been requesting this one like crazy Ya'll have been requesting Tik Tok",
            "per_shot_summaries": "\"Shot 1: The video lasts for 59 seconds. During this time, Sharieah engages in a conversation with a man in her bed. On-screen text references TikTok and indicates that Sharieah's audience had requested a specific action or song from her. Sharieah then speaks in response to these requests and sings a song for her followers.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 38.86666666666667,
            "text_on_screen": "Reply to C.203's comment In the Name of TikTok @howdyhales Tik Tok",
            "per_shot_summaries": "\"Shot 1: The shot shows a young woman staring at a garage door with a surprised expression. The video lasts for 39 seconds. The accompanying audio has the woman stating that the task at hand is quite challenging.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 0.466667,
            "text_on_screen": "Tik Tok @bakedbymelissa",
            "per_shot_summaries": "Shot 1: The video kicks off with instruction on how to cut a cucumber."
        },
        {
            "start": 0.466667,
            "end": 1.43333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: It then transitions to a shot of a jumbo vegetable strainer."
        },
        {
            "start": 1.43333,
            "end": 2.56667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: The video then displays a person placing shredded green onions into a strainer."
        },
        {
            "start": 2.56667,
            "end": 4.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: This scene shows shredded fresh green onions sitting on a cutting board."
        },
        {
            "start": 4.4,
            "end": 6.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: The video then cuts to a scene where there is a close-up of a white sheet."
        },
        {
            "start": 6.4,
            "end": 7.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6: The next scene shows a serene white table with various green plants."
        },
        {
            "start": 7.3,
            "end": 7.96667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: In this shot, viewers see shreds of cucumber at a supermarket."
        },
        {
            "start": 7.96667,
            "end": 8.33333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: A person can be seen slicing green cabbage in a plastic bag in this shot."
        },
        {
            "start": 8.33333,
            "end": 9.43333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: Immediately the shot transitions to display the texture of a silver platter."
        },
        {
            "start": 9.43333,
            "end": 11.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: The video then depicts cucumbers being drained in a glass bowl."
        },
        {
            "start": 11.8,
            "end": 12.5667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: In the next shot, someone is pouring liquid into a bowl with some green contents."
        },
        {
            "start": 12.5667,
            "end": 13.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 12: The following scene shows a knife positioned next to a bowl of green sauce."
        },
        {
            "start": 13.2,
            "end": 14.1333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 13: The focus then shifts to two people who are holding a glass filled with lime juice."
        },
        {
            "start": 14.1333,
            "end": 15.2667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 14: A man is shown holding a glass filled with some green liquid in this shot."
        },
        {
            "start": 15.2667,
            "end": 16.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15: The video then transitions to Joshua Morgan enjoying a hot dog."
        },
        {
            "start": 16.0333,
            "end": 17.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 16: The scene changes to a woman sipping green juice."
        },
        {
            "start": 17.3,
            "end": 18.6,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 17: The woman continues to drink her green juice."
        },
        {
            "start": 18.6,
            "end": 19.6,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 18: An onion is cut with a knife in this scene."
        },
        {
            "start": 19.6,
            "end": 22.2,
            "text_on_screen": "TikTok",
            "per_shot_summaries": "Shot 19: Here, a purple onion is sliced and prepared on a cutting board."
        },
        {
            "start": 22.2,
            "end": 24.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 20: Next, viewers see sliced red onions perfectly laid out on a cutting board."
        },
        {
            "start": 24.3,
            "end": 25.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 21: This shot shows a hand cutting red onions."
        },
        {
            "start": 25.1,
            "end": 25.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 22: The chopped red onion finds its place on the cutting board in this scene."
        },
        {
            "start": 25.4,
            "end": 25.7333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 23: The action shifts to a person slicing onions on a wooden cutting board."
        },
        {
            "start": 25.7333,
            "end": 26.4333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 24: Here, the shot reveals sliced red onions gathered in a large bowl."
        },
        {
            "start": 26.4333,
            "end": 27.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 25: The video highlights red onions being chopped in a pan."
        },
        {
            "start": 27.2,
            "end": 29.1667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 26: The viewer then sees fresh green parsley being chopped on a wooden surface."
        },
        {
            "start": 29.1667,
            "end": 30.1333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 27: The video moves on to showcase fresh chives being sliced on a cutting board."
        },
        {
            "start": 30.1333,
            "end": 31.0667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 28: The shot then transitions to a person spreading parsley onto some silver foil."
        },
        {
            "start": 31.0667,
            "end": 32.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 29: The scene shows rice being grated in a bowl."
        },
        {
            "start": 32.5,
            "end": 33.8667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 30: In the next shot, white rice flakes are shown in a white bowl on a table."
        },
        {
            "start": 33.8667,
            "end": 34.9333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 31: Here, we see a red onion being fried in a pan."
        },
        {
            "start": 34.9333,
            "end": 35.4333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 32: In this frame, sliced red onions, garlic, and cheese are cooking in a skillet."
        },
        {
            "start": 35.4333,
            "end": 36.7667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 33: The image moves on to display chopped onions and garlic being stirred in a pan."
        },
        {
            "start": 36.7667,
            "end": 36.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 34: Viewers see an onion being chopped in a wok."
        },
        {
            "start": 36.8,
            "end": 37.9667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 35: The shot transitions to onions being fried in a hot pan."
        },
        {
            "start": 37.9667,
            "end": 41.7667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 36: The next frame displays yolks of three eggs in a bowl."
        },
        {
            "start": 41.7667,
            "end": 43.7333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 37: The video then captures eggs being whisked together in a bowl."
        },
        {
            "start": 43.7333,
            "end": 45.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 38: The scene changes to eggs and cheese being poured into a glass bowl."
        },
        {
            "start": 45.4,
            "end": 45.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 39: The focus shifts to a blurry image of a mix of flour and cheese."
        },
        {
            "start": 45.8,
            "end": 48.2333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 40: The following shot is centered on a bowl of yellow batter with a whisk."
        },
        {
            "start": 48.2333,
            "end": 50.8333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 41: Thereafter, viewers see a whisk with a bowl containing herbs, eggs, and cheese."
        },
        {
            "start": 50.8333,
            "end": 50.8667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 42: In this shot, an egg and herb mix is swirled in a glass bowl."
        },
        {
            "start": 50.8667,
            "end": 51.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 43: The scene changes to show a whisked bowl of egg and parsley mixture."
        },
        {
            "start": 51.5,
            "end": 51.5333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 44: The video then reveals that the egg, cheese, and herb mixture is being stirred together."
        },
        {
            "start": 51.5333,
            "end": 52.3667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 45: The scene immediately cuts to a mix of chopped chives and cabbage being stirred with a fork."
        },
        {
            "start": 52.3667,
            "end": 52.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 46: Again, the focus is placed on green cabbage mixed with mayonnaise and green onions."
        },
        {
            "start": 52.4,
            "end": 53.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 47: The camera shifts to a bowl of zucchini salad being stirred with a tong."
        },
        {
            "start": 53.1,
            "end": 53.8667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 48: Up next, the shot shows a mix of vegetables, pasta, and cheese, being stirred in a bowl."
        },
        {
            "start": 53.8667,
            "end": 54.3667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 49: The camara then pans to an egg yolk mixture with ham in a bowl."
        },
        {
            "start": 54.3667,
            "end": 55.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 50: You can see a tongs mixing eggs and minced garlic in a blender."
        },
        {
            "start": 55.2,
            "end": 56.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 51: The video moves on to show a salad with bacon and onion being prepared."
        },
        {
            "start": 56.0333,
            "end": 56.9,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 52: The scene changes to a bowl full of a cucumber salad with ham, eggs, and garlic."
        },
        {
            "start": 56.9,
            "end": 57.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 53: In this shot, eggs are being added to a bowl of zucchini and bacon."
        },
        {
            "start": 57.3,
            "end": 59.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 54: The scene shifts to a closeup of broccoli in a glass dish."
        },
        {
            "start": 59.1,
            "end": 59.9333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 55: Here, a dish with noodles, cheese, and parmesan is displayed."
        },
        {
            "start": 59.9333,
            "end": 60.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 56: On screen next is grated food, being set as toppings for the baked dish."
        },
        {
            "start": 60.4,
            "end": 61.3667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 57: A hand is shown removing a layer of food from an oven."
        },
        {
            "start": 61.3667,
            "end": 61.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 58: In this shot, the oven door opens to reveal a tray of food inside it."
        },
        {
            "start": 61.4,
            "end": 61.9667,
            "text_on_screen": "375 Kitchen Settings Clear/Off",
            "per_shot_summaries": "Shot 59: The camera focus shifts to a person holding a digital display to open an oven."
        },
        {
            "start": 61.9667,
            "end": 62.7,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 60: The video then highlights an egg casserole with zucchini and basil."
        },
        {
            "start": 62.7,
            "end": 63.6333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 61: In this frame, a fork lies atop a plate with some broccoli pie."
        },
        {
            "start": 63.6333,
            "end": 65.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 62: The lens focuses on a broccoli quiche with a fork sticking out of it."
        },
        {
            "start": 65.0333,
            "end": 67.96666666666667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 63: The video ends with a woman eating food from a green toy."
        }
    ],
    [
        {
            "start": 0,
            "end": 0.48,
            "text_on_screen": "TikTok @herbifoods",
            "per_shot_summaries": "\"Shot 1 shows a plate of mozzarella and tomatoes surrounded by several pieces of bread being displayed."
        },
        {
            "start": 0.48,
            "end": 2.2,
            "text_on_screen": "Let's make this... Vegan Mozzarella",
            "per_shot_summaries": "In Shot 2, the text 'Let's make this... Vegan Mozzarella' appears on the screen, resonating with the voice that says 'make this vegan mozzarella'."
        },
        {
            "start": 2.2,
            "end": 2.92,
            "text_on_screen": "Thy Original The Original",
            "per_shot_summaries": "Shot 3 displays a young man enjoying his food with a spoon in his mouth."
        },
        {
            "start": 2.92,
            "end": 4.12,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "Shot 4 shows a man holding a plate while examining food, however, there's no audio or text on the screen."
        },
        {
            "start": 4.12,
            "end": 7.72,
            "text_on_screen": "Cashews Soy yogurt Nutritional yeast yeast Tapioca starch Miso paste Salt Blend",
            "per_shot_summaries": "Shot 5 provides a list of ingredients needed to prepare the dish: Cashews, Soy yogurt, Nutritional yeast yeast, Tapioca starch, Miso paste, and Salt."
        },
        {
            "start": 7.72,
            "end": 9.24,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6 is a visual guide on making whipped cream by hand."
        },
        {
            "start": 9.24,
            "end": 12.64,
            "text_on_screen": "Water Agar agar Bring to a boil",
            "per_shot_summaries": "In Shot 7, the instruction 'Water Agar agar Bring to a boil' appears on the screen, pertaining to the boiling water process from scratch."
        },
        {
            "start": 12.64,
            "end": 14.44,
            "text_on_screen": "Cook until thickend",
            "per_shot_summaries": "Shot 8 gives instructions to 'Cook until thickened' through text on the screen, while showing eggs being whisked in a pan over the stove."
        },
        {
            "start": 14.44,
            "end": 15.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9 features a young man mixing flour with a whisk."
        },
        {
            "start": 15.8,
            "end": 18.08,
            "text_on_screen": "Scoop in cold water",
            "per_shot_summaries": "Shot 10 shows the process of scooping cold water into a food processor with the on-screen instruction."
        },
        {
            "start": 18.08,
            "end": 18.8,
            "text_on_screen": "",
            "per_shot_summaries": "In Shot 11, we see a hand placing fresh mozzarella into a bowl of water."
        },
        {
            "start": 18.8,
            "end": 23.32,
            "text_on_screen": "",
            "per_shot_summaries": "The final shot, Shot 12, captures someone squeezing tomatoes and mozzarella onto a plate, completing the dish.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 4.3,
            "text_on_screen": "Tik Tok @quincylk Tato Corn Chow TikTok 1/2 onion 1 carrot 1 celery stalk 5 potatoes",
            "per_shot_summaries": "\"Shot 1: For four seconds, we see a person enjoying corn bread that is served on a plate of soup, alongside details of a TikTok handle and a mention of Tato Corn Chow, onion, carrot, celery, and potatoes."
        },
        {
            "start": 4.3,
            "end": 5.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: In a quick one-second shot, preparation of an onion alongside some potatoes and onions is showcased."
        },
        {
            "start": 5.2,
            "end": 5.46667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: Vegetables for a recipe, specifically an onion, carrot, and celery stalk, are shown being cut, despite the shot being listed with zero seconds."
        },
        {
            "start": 5.46667,
            "end": 6.9,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: For one second, we see various vegetables - onion, carrot, celery stalk, and potatoes being cut on a cutting board."
        },
        {
            "start": 6.9,
            "end": 7.03333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: Again in a non-duration shot, a person is shown chopping onions and carrots on a cutting board."
        },
        {
            "start": 7.03333,
            "end": 8.86667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6: For two seconds, attention is focused on a person diligently cutting onions on a cutting board."
        },
        {
            "start": 8.86667,
            "end": 11.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: The two-second shot shows ingredients for a savory potato dish neatly arranged on the cutting board."
        },
        {
            "start": 11.2,
            "end": 20.7333,
            "text_on_screen": "7 [ START START MED LO OFF MED HI 2 tbs Butter 2 tbs flour MED KitchenA 3-5 cups of water 2 cans of cream of chicken",
            "per_shot_summaries": "Shot 8: For 10 seconds, the process of adding butter and flour to a pan is shown, with on-screen text detailing the recipe, which includes butter, flour, and cream of chicken among other ingredients."
        },
        {
            "start": 20.7333,
            "end": 22.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: On to another culinary task for a second, we see a person cooking an egg with some chicken in a pot."
        },
        {
            "start": 22.2,
            "end": 26.5,
            "text_on_screen": "FRONT",
            "per_shot_summaries": "Shot 10: The next four-second shot features a pan of cheese sauce with potatoes and bacon being placed into a pot, with the word FRONT appearing on screen."
        },
        {
            "start": 26.5,
            "end": 31.0667,
            "text_on_screen": "Cook on medium high until potatoes are tender.",
            "per_shot_summaries": "Shot 11: As cooking continues for five seconds, an individual is shown stirring soup in a pot on the stove, while the screen text advises to cook on medium high until the potatoes are tender."
        },
        {
            "start": 31.0667,
            "end": 33.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 12: The final three-second shot displays a bowl of soup and bread well-placed on a table next to a small wooden box.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 14.8,
            "text_on_screen": "Tik Tok @leeting2021 TikTok @leeting 2021",
            "per_shot_summaries": "\"SHOT 1 shows a 15 second footage of a cat jumping on the foot of a person's socks.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 34.88135593220339,
            "text_on_screen": "@tamaranovaa @tamaranoyaa What are you doing? You being a good boy? You being a good baby? Can I have a kiss? Muahhh Thank you baby! Muahhhhh Zerbert! BOOP You be a good baby.",
            "per_shot_summaries": "In the first 35-second shot, a woman is seen with her arm around a blue parrot. There's text appearing on the screen, likely a conversation between some of the video characters. The woman audibly thanks someone named Kevin and then asks for a 'Boop', expressing her gratitude when she gets it."
        }
    ],
    [
        {
            "start": 0,
            "end": 3.56667,
            "text_on_screen": "TikTok @ohnolivia_ shelter: are you sure you want him? he steals straws me: im sure Tik Tok",
            "per_shot_summaries": "\"Shot 1: A 4-second shot of a girl, who is seen smiling as she is interacting with TikTok on her phone, with on-screen text hinting at a conversation about a straw-stealing shelter animal."
        },
        {
            "start": 3.56667,
            "end": 8.633333333333333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: The following 5-second shot shows a cat drinking from a plastic cup, with an audio playing in which someone is heard saying 'You're my best friend, you can come back.'.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 2.06667,
            "text_on_screen": "@crystalbessmer Veterinary staff: Try not to touch everything",
            "per_shot_summaries": "\"Shot 1: Cats are seen eating sandwiches in an office setting. The on-screen text advises the veterinary staff to avoid touching everything, while the audio urges not to stress people. This shot lasts 2 seconds."
        },
        {
            "start": 2.06667,
            "end": 5.06667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: A cat is observed in a cage marked with a sign reading 'bee'. There is no accompanying on-screen text or audio transcript and this scene lasts for 3 seconds."
        },
        {
            "start": 5.06667,
            "end": 6.83333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: A paiemental image of a cat pacing in a cage while scrutinizing another cat is captured. The audio transcript indicates they might be at 'the barn'. No accompanying text on screen is provided and this shot lasts 2 seconds."
        },
        {
            "start": 6.83333,
            "end": 8.33333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: Chickens are seen in cages alongside cats. The audio transcript mentions something about a car game, though there's no relation visible in the scene. The shot is 2 seconds long without any text on screen."
        },
        {
            "start": 8.33333,
            "end": 9.866666666666667,
            "text_on_screen": "SHOR LINE",
            "per_shot_summaries": "Shot 5: Ending the visuals with a 2-second scene of cats snarking at each other in the box. The on-screen text reads 'SHOR LINE' without any related audio transcript.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 5.705705705705706,
            "text_on_screen": "TikTok @foxredjax When all you wanted was to go in the shop to pick a new teddy but the other dogs there barked at you the other dogs thereedjax the other dogs thereredjax",
            "per_shot_summaries": "\"A 6-second shot showing a dog on the bed with its owner. The screen text reveals the dog's most-recent interaction of wanting to go in the shop and select a new teddy, but getting barked at by other dogs.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 1.33333,
            "text_on_screen": "TikTok @whatmollymade s'mores cookie bars gluten-free | dairy-free gluten-free | dairy free gluten free ] dairy-free",
            "per_shot_summaries": "Shot 1: The shot presents gluten-free, dairy-free s'mores cookie bars. The audio mentions an easy summer dessert."
        },
        {
            "start": 1.33333,
            "end": 3.13333,
            "text_on_screen": "gluten free | dairy free gluten free | dairy-free glutenfree | dairy-free",
            "per_shot_summaries": "Shot 2: The screen displays gluten-free and dairy-free s'mores cookie bars recipe details. The voiceover continues talking about the dessert."
        },
        {
            "start": 3.13333,
            "end": 4.1,
            "text_on_screen": "glutenfree | dairyfree",
            "per_shot_summaries": "Shot 3: Marshmallow-dipped, gluten-free, dairy-free s'mores cookie bars are shown. The shot audio references the content being made with only four ingredients."
        },
        {
            "start": 4.1,
            "end": 5.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: The shot showcases a cookie bar with smores filling. The narration states that the cookie bars only have four ingredients."
        },
        {
            "start": 5.4,
            "end": 6.4,
            "text_on_screen": "BAKE ONE OR ALL SAFE TO BEST BY: SHOW DETAL Sweet CRAFTED WITH ONLY clean INGREDIENTS GLUTEN DAIRY PLANT Project COOKIE DOUGH TREE NUT BASED NET WT 12 OZ (340g) (U PAREVE SAFETO gluten-free | dairy-free. VERIFIED NON nengmoproject.org GMO nongmoproject.org PEANUT",
            "per_shot_summaries": "Shot 5: The shot features sweet loren's smart cookie bars, highlighted as gluten-free and dairy-free. The audio suggests taking a couple of packs of cookie dough."
        },
        {
            "start": 6.4,
            "end": 7.5,
            "text_on_screen": "gluten-free | dairYy-free",
            "per_shot_summaries": "Shot 6: Gluten-free, vegan cookie bars are presented. It's shared that pressing dough into packs is part of the process."
        },
        {
            "start": 7.5,
            "end": 8.16667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A person is shown holding a tray of cookie bars. The narrator continues the cooking process, talking about pressing the dough down."
        },
        {
            "start": 8.16667,
            "end": 9.13333,
            "text_on_screen": "gluten free | dairy- ree",
            "per_shot_summaries": "Shot 8: A baking pan filled with gluten-free, dairy-free cookie bars is featured. The audio instructs on creating an even layer at the bottom."
        },
        {
            "start": 9.13333,
            "end": 10.0333,
            "text_on_screen": "MINI CHIPS 100% REAL CHOCOLATE SEMI-SWEET gluten-free | dairyg-free MADE IN A DEDICATED NUT FREE GLUTEN",
            "per_shot_summaries": "Shot 9: The image shows enjoy life mini chip chocolate cookies, emphasized as gluten and dairy-free. The narration continues the cookie-making process, speaking about a baking dish."
        },
        {
            "start": 10.0333,
            "end": 10.8667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: The scene shows a tray with brownie batter labeled 's mores cookie bars.' The narrator suggests sprinkling it with chocolate chips."
        },
        {
            "start": 10.8667,
            "end": 11.9333,
            "text_on_screen": "gluten-free | dairy free.",
            "per_shot_summaries": "Shot 11: The screen shares a recipe for gluten-free, dairy-free no-flour cookie bars. The step involving sprinkling chocolate chips is completed."
        },
        {
            "start": 11.9333,
            "end": 13.8667,
            "text_on_screen": "gluten-free | dairy free.. glutenfree | dairy-free.. s mores cookie bars glutenfree | dairyfree-.",
            "per_shot_summaries": "Shot 12: A person is seen scooping out a gluten-free, dairy-free cookie bar from a baking tray. The voiceover explains that the next layer is crushed graham crackers."
        },
        {
            "start": 13.8667,
            "end": 14.7333,
            "text_on_screen": "gluten-free | dairy-frees",
            "per_shot_summaries": "Shot 13: A dish of cookie bars on a table is displayed. The audio indicates the addition of marshmallow fluff to the recipe."
        },
        {
            "start": 14.7333,
            "end": 15.4667,
            "text_on_screen": "gluten free | dairy free.",
            "per_shot_summaries": "Shot 14: A person placing s'mores bars into a baking tray is shown on screen. The voiceover suggests finishing with a layer of cookie dough."
        },
        {
            "start": 15.4667,
            "end": 16.4667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15: The shot provides a view of more gluten-free cookie bars. The commentary continues to discuss about the last layer of cookies."
        },
        {
            "start": 16.4667,
            "end": 17.2667,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "Shot 16: Surprisingly, the content of this shot shows the recipe for s'mores cookie bars once again. The audio talks about baking them for 25 minutes."
        },
        {
            "start": 17.2667,
            "end": 18.1667,
            "text_on_screen": "es'mores cookie bars",
            "per_shot_summaries": "Shot 17: The image displays the s'mores cookie bars recipe once more. The narrator speaks about the baking time of the bars, extending it to 30 minutes."
        },
        {
            "start": 18.1667,
            "end": 19.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 18: A gluten-free, vegan s'mores cookie bar is showcased. There are no spoken instructions in this shot."
        },
        {
            "start": 19.0333,
            "end": 19.9,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 19: Six s'mores cookie bars are exhibited in the shot. The voiceover introduces the bars as the best."
        },
        {
            "start": 19.9,
            "end": 20.7333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 20: A cookie cutter next to bars labeled 'smores cookie bars' is displayed. There is no audio commentary."
        },
        {
            "start": 20.7333,
            "end": 22.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 21: The image shows someone cutting the cookies into bars. The shot ends with the declaration of the cookies being the best summer dessert."
        }
    ],
    [
        {
            "start": 0,
            "end": 2.6,
            "text_on_screen": "TikTok @spoonfulofsi How to make Strawberry Tiramisu",
            "per_shot_summaries": "\"Shot 1: The video begins with the introduction of a strawberry tiramisu tutorial."
        },
        {
            "start": 2.6,
            "end": 3.83333,
            "text_on_screen": "Tik Tok 1 jar strawberry preserves",
            "per_shot_summaries": "Shot 2: In the next shot, a jar of strawberry preserves is poured into a bowl."
        },
        {
            "start": 3.83333,
            "end": 6.73333,
            "text_on_screen": "1/2 cup orange juice",
            "per_shot_summaries": "Shot 3: A mixture including orange juice is whisked in a bowl."
        },
        {
            "start": 6.73333,
            "end": 7.53333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: Raspberry sauce is being prepared with a whisk."
        },
        {
            "start": 7.53333,
            "end": 8.16667,
            "text_on_screen": "1 + 1/3 cup whipping cream",
            "per_shot_summaries": "Shot 5: Buttercream frosting is being prepared in an electric mixer."
        },
        {
            "start": 8.16667,
            "end": 9.53333,
            "text_on_screen": "1/3 cup powdered sugar 1 tsp vanilla",
            "per_shot_summaries": "Shot 6: The next step involves mixing powdered sugar in a mixer."
        },
        {
            "start": 9.53333,
            "end": 10.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A batter is shown being mixed, followed by"
        },
        {
            "start": 10.3,
            "end": 10.9,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: White icing being mixed with an electric mixer."
        },
        {
            "start": 10.9,
            "end": 12.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: A person is seen mixing whipped cream using a mixer."
        },
        {
            "start": 12.8,
            "end": 13.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: The process of whipped cream mixing continues in this shot."
        },
        {
            "start": 13.5,
            "end": 14.7333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: Mixer is being used for whipping cream preparation."
        },
        {
            "start": 14.7333,
            "end": 15.9,
            "text_on_screen": "Fold in whipped cream with 16 oz mascarpone cheese",
            "per_shot_summaries": "Shot 12: Whipping cream and mascarpone cheese are brought together and mixed."
        },
        {
            "start": 15.9,
            "end": 17.6,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 13: The tutorial goes on to demonstrate how to whip frosting."
        },
        {
            "start": 17.6,
            "end": 18.4667,
            "text_on_screen": "Layer of dipped ladyfingers",
            "per_shot_summaries": "Shot 14: The layering process begins with the placement of dipped ladyfingers."
        },
        {
            "start": 18.4667,
            "end": 19.2667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15: A casserole dish is filled with sauce next."
        },
        {
            "start": 19.2667,
            "end": 19.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 16: Sausage sticks and tomato sauce are placed on a counter."
        },
        {
            "start": 19.8,
            "end": 20.4,
            "text_on_screen": "Layer of cream filling",
            "per_shot_summaries": "Shot 17: The layering process continues, this time with a cream filling on ice cream sticks."
        },
        {
            "start": 20.4,
            "end": 21.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 18: The tutorial demonstrates how layers are made with cream filling."
        },
        {
            "start": 21.2,
            "end": 21.9667,
            "text_on_screen": "Layer of strawberries",
            "per_shot_summaries": "Shot 19: Next is the layering of strawberries on a white cream covered baking pan."
        },
        {
            "start": 21.9667,
            "end": 22.0667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 20: The layering steps are furthered by adding cream cheese and strawberries."
        },
        {
            "start": 22.0667,
            "end": 22.6,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 21: Fresh strawberries are cut and layered in a square baking dish."
        },
        {
            "start": 22.6,
            "end": 23.1,
            "text_on_screen": "Repeat layers",
            "per_shot_summaries": "Shot 22: The layered ingredients are shown, ready to be baked."
        },
        {
            "start": 23.1,
            "end": 24.3667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 23: The dish now contains baked fries covered in sauce."
        },
        {
            "start": 24.3667,
            "end": 25.1333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 24: Baked bananas are added to the dish, topped with whipped cream."
        },
        {
            "start": 25.1333,
            "end": 26.1667,
            "text_on_screen": "Repeat layers.",
            "per_shot_summaries": "Shot 25: The layering process is repeated, visually demonstrating the word 'Repeat layers.'"
        },
        {
            "start": 26.1667,
            "end": 26.7667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 26: A close-up of whipped cream set on a marble counter is shown."
        },
        {
            "start": 26.7667,
            "end": 27.4667,
            "text_on_screen": "Cover & refrigerate overnight",
            "per_shot_summaries": "Shot 27: Following this, there's a shot showing off the cream cheese frosting cover on the baking dish."
        },
        {
            "start": 27.4667,
            "end": 28.3667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 28: The video proceeds with a short segment on making vegan cheesecake."
        },
        {
            "start": 28.3667,
            "end": 29.2667,
            "text_on_screen": "Add freshly sliced strawberries when ready to serve",
            "per_shot_summaries": "Shot 29: A woman is shown cutting strawberries which will be added to the dish."
        },
        {
            "start": 29.2667,
            "end": 30.0667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 30: The tutorial emphasizes adding the sliced strawberries when ready to serve."
        },
        {
            "start": 30.0667,
            "end": 31.9,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 31: The next shot steadily zooms in on strawberries and whipped cream atop a large serving tray."
        },
        {
            "start": 31.9,
            "end": 33.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 32: Strawberries are again shown, this time immersed in white cheesecake batter."
        },
        {
            "start": 33.4,
            "end": 33.9333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 33: The dish, now containing strawberries on top, is presented in a baking pan."
        },
        {
            "start": 33.9333,
            "end": 34.7333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 34: The next shot showcases someone slicing strawberries on a plate."
        },
        {
            "start": 34.7333,
            "end": 35.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 35: A large pan of strawberries with a white plate in the background is displayed."
        },
        {
            "start": 35.4,
            "end": 36.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 36: The final steps of laying out the strawberry cake are demonstrated."
        },
        {
            "start": 36.1,
            "end": 37.46666666666667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 37: The video ends showcasing a slice of the freshly made strawberry cake on a plate.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 1.96864,
            "text_on_screen": "TikTok @mdmotivator Do you have like a couple bucks? Coca-Cola To help me get this cookie? -",
            "per_shot_summaries": "Shot 1 summary: In the opening scene lasting 2 seconds, a man with his phone out and a Coke is attempting to acquire a cookie through a not so comprehensible exchange."
        },
        {
            "start": 1.96864,
            "end": 4.27094,
            "text_on_screen": "Sorry bro, uhm... Coca Tik Tok I don't... Ah dang...",
            "per_shot_summaries": "Shot 2 summary: The second shot, also 2 seconds long, shows a bearded man purchasing food at a grocery store. The on-screen text suggests an awkward interaction."
        },
        {
            "start": 4.27094,
            "end": 5.10511,
            "text_on_screen": "What was the question?",
            "per_shot_summaries": "Shot 3 summary: In the third shot that lasts for just a second, a coffee shop employee is recorded on a tablet, with on-screen text suggesting their confusion about a question."
        },
        {
            "start": 5.10511,
            "end": 9.20921,
            "text_on_screen": "Your Order PERMIT PHIL CLASSIC FOR A LI PHILL PH I lost my wallet... FOR A LIMI PHILLY SHE STE FOR A LIMITED TIME NEW! I was trying to get a cookie... Total FOR A really hungry... You're hungry? QUIZNOS SAVOURY",
            "per_shot_summaries": "Shot 4 summary: Spanning 4 seconds, this shot features a man by a computer, engaging in a conversation about losing his wallet, being hungry, and wanting a cookie, as indicated by the on-screen text."
        },
        {
            "start": 9.20921,
            "end": 11.2779,
            "text_on_screen": "Starving... You lost your wallet? Alright, enjoy it...",
            "per_shot_summaries": "Shot 5 summary: In the fifth shot of 2 seconds, a man is seen standing in front of a chicken nuggets griller, with a brief exchange of words indicated on-screen."
        },
        {
            "start": 11.2779,
            "end": 22.1889,
            "text_on_screen": "QUIZNO CAlright, enjoy it... QUIZNI QUIZN Alright, enjoy it..QUIZNOS Are you sure? QUIZ? Are you sure? Enjoy it... AVOURY VOURY JOURY URY I'm Zack man... Zack? You made my day man... It's all good... That's my job... IN A IN A RUSH? CLASSIC ITALIAN What do you mean? A RUSH? I make the day for everyone... RUSH?",
            "per_shot_summaries": "Shot 6 summary: The sixth shot, the longest so far at 11 seconds, shows what appears to be an employee-to-employee exchange with somewhat overlapping comments, and one of them named Zak expressing that making people's day is his job."
        },
        {
            "start": 22.1889,
            "end": 25.5923,
            "text_on_screen": "Help people out right? How long have you been working here for? 26 years man...",
            "per_shot_summaries": "Shot 7 summary: In 3 seconds-long shot seven, there's an interaction about how helping people is part of their job and the length of employment of one person for 26 years."
        },
        {
            "start": 25.5923,
            "end": 32.3991,
            "text_on_screen": "I don't need the cookie... For the first person who was going to be kind to me... Seriously? Seriously? QUIZNOS I had something for you... What is that? RADOX",
            "per_shot_summaries": "Shot 8 summary: The eighth shot, lasting 7 seconds, shows a customer and waiter interaction at a Thai restaurant, with the customer rejecting a cookie and revealing a surprise for the kind person."
        },
        {
            "start": 32.3991,
            "end": 33.9339,
            "text_on_screen": "Paradox... It's a It's a 5 star hotel...",
            "per_shot_summaries": "Shot 9 summary: In the ninth shot of 2 seconds duration, there's a highlighting of a five-star hotel, as indicated by the on-screen text and audio."
        },
        {
            "start": 33.9339,
            "end": 36.8702,
            "text_on_screen": "Yeah right... Yeah right.... For you... Because you were going to give me a cookie...",
            "per_shot_summaries": "Shot 10 summary: In the tenth shot that lasts for 3 seconds, the man at the restaurant appears to be shocked and covers his face in response to a gesture of gratitude because he offered a cookie."
        },
        {
            "start": 36.8702,
            "end": 45.045,
            "text_on_screen": "My wife... She's a nurse... She's been working for so long... Tired and everything... QUIZNOS @mdmotivator You gave me this for 2 night stay in the hotel.... wife and my kids there... I'm going to bring my",
            "per_shot_summaries": "Shot 11 summary: The eleventh shot, spanning 8 seconds, shows a man in a tuxedo talking about the hard work of his nurse wife, his family and an opportunity for a hotel stay given to him."
        },
        {
            "start": 45.045,
            "end": 59.2259,
            "text_on_screen": "I actually got another surprise for you Jay... What's that? My wallet's right here... I had a $1000 bucks... Cash! Serious? Congrats man... I can't do that... Im serious man..os I'm serious man.NOS",
            "per_shot_summaries": "Shot 12 summary: In the twelfth shot, running the longest for 14 seconds, there's an unfolding of another surprise: a reveal of a hidden wallet with $1000, igniting reactions of disbelief."
        },
        {
            "start": 59.2259,
            "end": 62.4291,
            "text_on_screen": "But, are you sure? Positive... ОС 100% man...",
            "per_shot_summaries": "Shot 13 summary: The thirteenth shot, 3 seconds long, involves a confirmatory exchange about the legitimacy of the surprise, establishing the seriousness of the gesture."
        },
        {
            "start": 62.4291,
            "end": 67.0003,
            "text_on_screen": "My nephew in the Philippines... Had a kid... She's had a caesarean... At 7 months... They had to get him out...",
            "per_shot_summaries": "Shot 14 summary: Spanning 5 seconds, shot fourteen contains an account of a medical emergency concerning a nephew in the Philippines, introducing a new, serious note to the interaction."
        },
        {
            "start": 67.0003,
            "end": 69.3694,
            "text_on_screen": "Because the cord was around his neck... Oh my God... He has a big huge bill... QUI.",
            "per_shot_summaries": "Shot 15 summary: The fifteenth shot, lasting 2 seconds, continues the story about the medical complications involving the newborn and the ensuing large medical bill."
        },
        {
            "start": 69.3694,
            "end": 75.709,
            "text_on_screen": "To pay... I'm giving this to him... The $1000? Yeah... The whole thing?",
            "per_shot_summaries": "Shot 16 summary: In this 6 seconds-long sixteenth shot, a man behind a fast-food counter decides to give all the surprise cash to his relative to pay the medical bill."
        },
        {
            "start": 75.709,
            "end": 77.04371037704371,
            "text_on_screen": "Love you... Love you too bro...",
            "per_shot_summaries": "Shot 17 summary: The final shot of 1 second concludes with a warm exchange of \"Love you\" messages, enhancing the sense of camaraderie and humanity that permeates the entire video."
        }
    ],
    [
        {
            "start": 0,
            "end": 0.0333667,
            "text_on_screen": "TikTok @jfor my mom's birthday this year we surprised her with matching outfits",
            "per_shot_summaries": "\"Shot 1: A woman is seen standing next to a Christmas tree, donned in a green dress. Text on the screen explains that they surprised their mom with matching outfits for her birthday."
        },
        {
            "start": 0.0333667,
            "end": 15.4821,
            "text_on_screen": "e for my mom's birthday this @iforr my mom's birthday this @iforrimy mom's birthday this for my mom's birthdaythis for my mom's birthday this efor my mom's birthday this @ forrimy mom's birthday this eifor my mom's birthday this e formy mom's birthday this @josdavis I distracted her asking her to zip me up an accident at first @josdavis she actually thought it wasok an accident at first she actually thought it asok she actually thought it waok she actually thought it watok",
            "per_shot_summaries": "Shot 2: Filled with text on screen detailing the birthday surprise, this shot features a woman in a green dress being zipped up by a friend as part of the plan."
        },
        {
            "start": 15.4821,
            "end": 17.4842,
            "text_on_screen": "she actually thought it Maok",
            "per_shot_summaries": "Shot 3: In silent shot, a woman is depicted standing next to her daughter at a table."
        },
        {
            "start": 17.4842,
            "end": 27.2272,
            "text_on_screen": "then we gave her one",
            "per_shot_summaries": "Shot 4: Dialogue indicates a gift was given as two women, both in festive green outfits, are seen dancing."
        },
        {
            "start": 27.2272,
            "end": 32.3657,
            "text_on_screen": "SPOILER ALERT: she was obsessed",
            "per_shot_summaries": "Shot 5: An elderly woman stands by a table, looking visibly upset, contradicting the text on screen that suggests that she's obsessed with the surprise."
        },
        {
            "start": 32.3657,
            "end": 33.1999,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6: Features a woman gravitating in her green dress, stationed on a hardwood floor."
        },
        {
            "start": 33.1999,
            "end": 34.1008,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: An enthralling sight as two women decked in green dresses showcase their dance moves."
        },
        {
            "start": 34.1008,
            "end": 35.2686,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: Focusing on a woman in a shimmering green sequin dress, joyfully dancing in the living room."
        },
        {
            "start": 35.2686,
            "end": 37.6043,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: The joyous vibe continues with two women dressed in green sequined outfits, dancing together."
        },
        {
            "start": 37.6043,
            "end": 38.6386,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: This brief shot features four women in green outfits, striking a pose."
        },
        {
            "start": 38.6386,
            "end": 41.60827494160828,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "Shot 11: Marking the video's end, the final shot is of four persons aptly dressed in green sequin attire, posing for a picture.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 31.733333333333334,
            "text_on_screen": "@haile.ferrier @haileferrier @haile ferrier Tik Tok ec 2999 lege 999",
            "per_shot_summaries": "\"Shot 1 lasts for 32 seconds and features two people in jeans dancing in a studio. The audio outlines someone's distinctive attire, discussing his unusual clothing choices such as wearing the same shoes with pink shoelaces and a purple hat band.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 0.95,
            "text_on_screen": "TikTok @andcarli",
            "per_shot_summaries": "\"Shot 1: A brief shot, showcasing a person in a t-shirt while crafting a spiral from a straw."
        },
        {
            "start": 0.95,
            "end": 5.05,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: In silence, a creative scene unfolds where someone employs paint and straws to design a t-shirt."
        },
        {
            "start": 5.05,
            "end": 9.88333,
            "text_on_screen": "Super Cl Super Col",
            "per_shot_summaries": "Shot 3: A man appears to be actively engaged in making a t-shirt featuring a striking red and black circle, while the screen text exclaims 'Super Cl Super Col'."
        },
        {
            "start": 9.88333,
            "end": 11.2333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: The viewer is treated to a flash of creativity, as a white t-shirt is transformed with the careful application of a black and pink circle."
        },
        {
            "start": 11.2333,
            "end": 23.3667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: A longer shot, the vid captures an artist meticulously painting a black and pink spiral onto a white t-shirt."
        },
        {
            "start": 23.3667,
            "end": 24.15,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6: Focusing on a t-shirt adorned with a large spiral, the artist continues their intricate paintwork."
        },
        {
            "start": 24.15,
            "end": 29.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A man is spotted skillfully using paint to build a vibrant spiral on a t-shirt, reflecting a clear theme of fabric and art."
        },
        {
            "start": 29.3,
            "end": 36.25,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: Another quiet but compelling shot of a t-shirt coming to life under the artist's hands, spirals of pink and black taking form."
        },
        {
            "start": 36.25,
            "end": 58.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: An extensive scene unveils the detailed application of paint, a man shaping a black and pink swirled pattern on a t-shirt."
        },
        {
            "start": 58.8,
            "end": 60.7,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: The scene shifts as a man is seen spray-painting a black and red spiral onto a table instead of a t-shirt."
        },
        {
            "start": 60.7,
            "end": 82.2167,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: In another extended shot, a man is witnessed crafting a tie-dye spiral design on a t-shirt, suggesting a connection to previous shots."
        },
        {
            "start": 82.2167,
            "end": 84.9167,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 12: The video presents a clip showing a DIY galaxy tie-dye t-shirt, reflecting the overall theme of crafting creative t-shirt designs."
        },
        {
            "start": 84.9167,
            "end": 88.9333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 13: The reel moves to another shot associated with the shared motif of tie-dye t-shirts."
        },
        {
            "start": 88.9333,
            "end": 129.86666666666667,
            "text_on_screen": "Andcarli 11 12 12 Part 2 11",
            "per_shot_summaries": "Shot 14: The concluding shot mixes in some dialogue, the words 'Angie, Callie,' punctuating the scene as a man is seen using a red phone. On-screen text reveals a series of numbers and naming the user 'Andcarli'.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 45.166666666666664,
            "text_on_screen": "Gayle's Broadway Rose NYC / Singing Servers TikTok @gaylesbroadwayrose this to-go\" and we heard \"We Don't Talk About TikTok Bruno\" Bruno\" , Our guests said “can Iget Our guests said \"can I get Tik Tok this to-go“ and we heard Bruno\" @gaylesbroadwayrose Bruno @aylesbroadwayrose Bruno\"@gaylesbroadwayrose Bruno\" C@gaylesbroadwayrose Bruno\" P@gaylesbroadwayrose NYC I Singing Servers Bruno\"C@gaylesbroadwayrose Bruno @gaylesbroadwayrose Bruno\"gaylesbroadwayrose",
            "per_shot_summaries": "\"Shot 1: This 45-second shot reveals a man holding a microphone at a bar. The prominent text on screen indicates it's Gayle's Broadway Rose in NYC and includes a caption about singing servers and a request heard from guests.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 5.93333,
            "text_on_screen": "TikTok",
            "per_shot_summaries": "\"Shot 1: For six seconds, a man in glasses is seen standing in front of a humidifier while expressing his newfound fondness for humidifiers. The screen also displays the text 'TikTok'."
        },
        {
            "start": 5.93333,
            "end": 9.26667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: In a quick three-second shot, the same man gives a thumbs up as he stands next to a mushroom humidifier, making a playful comment about the product's combination of aesthetics and function."
        },
        {
            "start": 9.26667,
            "end": 12.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: For four seconds, the scene shows the man mesmerized by a small water-droplet air humidifier he's holding."
        },
        {
            "start": 12.8,
            "end": 21.2,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: Over eight seconds, the video focuses on a review of the Tekkin mushroom air purifier, with the man commenting on the device's color-changing feature and user-friendly design."
        },
        {
            "start": 21.2,
            "end": 26.2333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: This five-second shot features the man, still in his glasses, next to a humidifier, jokingly expressing relief over the product coming pre-assembled."
        },
        {
            "start": 26.2333,
            "end": 40.6,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6: This lengthy 14-second shot shows the man enthusiastically demonstrating and discussing the ability to customize the mist and color of a purple mushroom humidifier."
        },
        {
            "start": 40.6,
            "end": 43.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: The seventh shot, within three seconds, simply shows a young man in his room holding a humidifier."
        },
        {
            "start": 43.4,
            "end": 48.2667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: Lasting five seconds, the eighth shot foregrounds the man, glasses still on, as he reveals that the humidifier doubles as an essential oil diffuser, expressing his excitement at trying out this feature."
        },
        {
            "start": 48.2667,
            "end": 54.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: For the final six-second shot, the man embraces his new obsession with a mushroom shaped air humidifier, humorously declaring it as his new defining trait.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 25.733333333333334,
            "text_on_screen": "1. A PRESTO SEE YOU SOON 2. A DOMANI SEE YOU TOMORROW 3. BUON VIAGGIO HAVE A GOOD TRIP Tik Tok 4. BUON DIVERTIMENTO HAVE FUN @italianmatters 5. I MIGLIORI AUGURI BEST WISHES 6. IN BOCCA AL LUPO GOOD LUCK BASIC ITALIAN U JTikTok 4. BUON DIVERTIMENTO 4. BUON DIVERTIMENTO BASIC ITALIAN",
            "per_shot_summaries": "SHOT 1 summary: The 26-second shot features an app demonstrating the basics of Italian writing. Concurrently, the audio provides translations and pronunciations of various everyday phrases, such as 'a presto' meaning 'see you soon', 'buon viaggio' meaning 'have a good trip', and 'in bocca al lupo' referring to 'good luck'."
        }
    ],
    [
        {
            "start": 0,
            "end": 32.766666666666666,
            "text_on_screen": "Dad wasn't messing around YOOHUMOR Dad wasn't messing around 3 @funny.lifee usa Dad wasn't messing around 5 Dad wasn't messing around S Yup! @funny.life usa Sorry Bruh Bruh",
            "per_shot_summaries": "\"The first shot, lasting for 33 seconds, features a child standing in front of a door. The on-screen text indicates a humoristic situation involving a dad and another individual. The audio in the shot captures a conversation about someone needing to apologize and give a hug to the brother, likely after a dispute.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 9.116666666666667,
            "text_on_screen": "My dog got out at 4:AM and rang the doorbell Tik Tok @dreamyiscuming TikTok",
            "per_shot_summaries": "\"During the 9-second long first shot, the scene shows a dog being outside at 4:AM and ringing the doorbell.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 2.56924,
            "text_on_screen": "TikTok @sneakersouffle brand new or used? used more done. How doers",
            "per_shot_summaries": "Shot 1: A man is seen purchasing a box of shoes at a trade show."
        },
        {
            "start": 2.56924,
            "end": 26.1428,
            "text_on_screen": "do you have a price in mind? Tik Tok $200? How J TikTok I'd be pretty far off MH probably just pass for now then I'll probably just pass for now then hard to sell just with the scuffs they'd what about $175? I couldn't Icouldn't I couldnt brand new, I'm usually payinkers around that ouffle brand new, I'm usually paying brand new, I'm usually payingsouffle brand new, I'm usually payinge souffle rsouffle so for used, like this too... to buy a used shoe with all the scuffs on it so it'd be under $100",
            "per_shot_summaries": "Shot 2: A young man in a blue t-shirt is haggling over the price of a bag he's buying, with the discussion concerning the condition and pricing of used shoes."
        },
        {
            "start": 26.1428,
            "end": 27.1605,
            "text_on_screen": "appreciate it F TikTok",
            "per_shot_summaries": "Shot 3: A kid is seen opening a box of shoes at a convention."
        },
        {
            "start": 27.1605,
            "end": 29.0624,
            "text_on_screen": "MOMENTS LATER",
            "per_shot_summaries": "Shot 4: Teasers for the upcoming scene are displayed, using the text 'MOMENTS LATER'."
        },
        {
            "start": 29.0624,
            "end": 32.8161,
            "text_on_screen": "what we got? okay t more done. they're used once t more done",
            "per_shot_summaries": "Shot 5: A scene shows two people unveiling a pair of sneakers from a box."
        },
        {
            "start": 32.8161,
            "end": 35.669,
            "text_on_screen": "how much did you want for these? bought it for $165",
            "per_shot_summaries": "Shot 6: Conversations continue about pricing of the shoes during a walk through an expo booth."
        },
        {
            "start": 35.669,
            "end": 37.7377,
            "text_on_screen": "you want $165? I traded them",
            "per_shot_summaries": "Shot 7: A man with a mustache is seen at an art show, discussing the pricing."
        },
        {
            "start": 37.7377,
            "end": 40.2736,
            "text_on_screen": "oh you traded the breds for these? yeah",
            "per_shot_summaries": "Shot 8: A mustached man is at a trade show discussing trading sneakers."
        },
        {
            "start": 40.2736,
            "end": 49.5829,
            "text_on_screen": "I buy them new for $150 them so I'd probably be at like Sueakersouffle the other guy over there weakersouffle offering for $130 would honestly take that I would honestly take that that's a pretty good price",
            "per_shot_summaries": "Shot 9: A lady and another person in a store continue the discussion on pricing of the sneakers and comparing with a rival's offer."
        },
        {
            "start": 49.5829,
            "end": 55.6223,
            "text_on_screen": "would you do $130? I would not was it the guy with the beard? yeah that's a pretty good price ne. I would do that",
            "per_shot_summaries": "Shot 10: A haggling conversation is between a woman and her boy at an event, bouncing off offers around $130."
        },
        {
            "start": 55.6223,
            "end": 57.5242,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: Transition scene with a text stating 'a few moments later' against a red background."
        },
        {
            "start": 57.5242,
            "end": 66.4831,
            "text_on_screen": "I'm back again what we get this time? brand new adobe dunks @sneakersourne I'd be kind of low on those teakersouffle I'd be kind of low on those reabe souffle honest y TikTok I'd be kind of low on those teabe souffle how much? let me see what I'd be at",
            "per_shot_summaries": "Shot 12: A young person is seen opening an empty shoe box and discussing the sneaker's potential value."
        },
        {
            "start": 66.4831,
            "end": 68.8355,
            "text_on_screen": "yeah I'd be a bit lower on thesec. yeah I'd be a bit lower on these...c yeah I'd be a bit lower on these...",
            "per_shot_summaries": "Shot 13: A young man at a trade show looking at his cellphone indicates the price deal might be lower than expected."
        },
        {
            "start": 68.8355,
            "end": 72.6393059726393,
            "text_on_screen": "payout's 74 bucks... they go for $112",
            "per_shot_summaries": "Shot 14: A girl is seen engaging in a conversation in a booth about the disparity in selling price and payout."
        }
    ],
    [
        {
            "start": 0,
            "end": 2.4024,
            "text_on_screen": "TikTok @dawsonaro DRURY LN.",
            "per_shot_summaries": "\"Shot 1: Over a brief two seconds, the viewer is shown a captivating view of a mountain road through a car window. Amid this beautiful landscape, there is an audible expression of awe, 'Oh my gosh, you guys.'"
        },
        {
            "start": 2.4024,
            "end": 6.206206206206207,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: The next shot, lasting four seconds, presents a close-up view of a street sign that reads 'Duryl Ln'. This scene unfolds without any textual elements or audible commentary.\""
        }
    ],
    {
        "video_description": "The short-form video features a humorous scenario where a man, referred to as 'Dad', accidentally falls into a pool while on a conference call. Despite the mishap, he continues the call unfazed, creating a comedic moment. The video, originating from TikTok, was posted by the user @brycehamilton_3 and then reshared on @funny123us. This mishap is introduced and elaborated in the on-screen text that accompanies the video, with the text indicating that the video was capturing the moment when the dad slipped into the pool during a conference call and proceeded with the call nonchalantly. The funny incident is briefly encapsulated in the audio transcript through the statement \"I'm home.\"",
        "summary_10": "\"Dad\" humorously continues conference call despite falling into pool.",
        "summary_25": "The video humorously captures 'Dad', undeterred by a fall into the pool, continuing his conference call. Laughter unfolds via on-screen text and \"I'm home\".",
        "summary_50": "The video humorously shows a man, 'Dad', continuing a conference call despite accidentally falling into a pool. Originating from TikTok by user @brycehamilton_3 and reposted on @funny123us, the on-screen text and the phrase \"I'm home\" highlight the comedic moment."
    },
    {
        "video_description": "The video is a short-form humorous content from TikTok, starring a young woman who has just passed her driving test but faces issues with parking. It begins with her in a car adorned with a text message that somewhat reveals the predicament, providing a point-of-view (POV) perspective. Over the course of the video, the character unsuccessfully attempts to park at different locations. The video shows the woman in a parking lot, trying to position her white car correctly. Despite her failed efforts, the woman remains adamant that she can park in a particular spot, leading to a humorous conclusion. This progression is not aided by any text or voice during the clips, relying solely on the shot descriptions to narrate the story.",
        "summary_10": "Humorous TikTok video shows a new driver failing at parking.\n",
        "summary_25": "The TikTok video humorously shows a new driver struggling to park in different locations, despite her persistent, unyielding belief in her parking skills.",
        "summary_50": "This short TikTok video humorously depicts a young woman who, despite recently passing her driving test, struggles to park her car in various locations. The story, conveyed solely through shot descriptions, concludes on a comedic note with her unwavering confidence in her non-existent parking skills.\n"
    },
    {
        "video_description": "The video starts by showing a small toy model being pulled from a green cup, under the banner of Tik Tok. The subsequent shots feature various green objects and appliances such as a machine with two swivel chairs, a container, a coffee maker, an electric toothbrush device, and a manicure station. The focus then moves to various cutting devices, starting with an apple cutter labelled as 'takiko'. Several activities involving cutting apples are depicted, including using an apple slicer to chop the fruit into strips, a person holding a fruit shaped like an apple, and an apple being juiced. The video continues to spotlight different tools used in the kitchen like a vegetable juicer slicing an onion and a tool named 'apple and pear twister peeler'. There are also demonstrations of bacon and apple slicing on a glass plate, the application of a handheld fruit cutter, and finally the use of a tomato cutter. The concluding sequences display some sliced tomatoes on a plate with a green slicer. The overall video seems to be a product showcase for a variety of green kitchen appliances, tools and devices available on the SheIn platform as indicated by the text on screen '@shein_official'.",
        "summary_10": "SheIn's green kitchen appliances, including cutters and juicer, are demonstrated.\n",
        "summary_25": "The video promotes SheIn's green kitchen appliances and tools, including various cutters and a juicer, with practical demonstrations concluding with tomato slicing.",
        "summary_50": "The video showcases various green kitchen appliances and tools on the SheIn platform. It features several cutting devices including apple and tomato cutters, a vegetable juicer, and a 'apple and pear twister peeler', with demonstrations of their usage. The video concludes by slicing tomatoes using a green slicer."
    },
    {
        "video_description": "The video is a stylistic montage featuring demonstrations of 70s hairstyles for women. The video begins with the introduction of the theme, \"70s Hair @hairbyamela,\" setting the tone for the hair styling tutorial aimed at women. The subsequent scenes demonstrate a woman cutting her hair slickly with scissors, an act indicative of a transformation about to take place. This is followed by scenes of a woman with long black hair undergoing a hairstyle change. The setting is established as a hair salon in Ahmedabad, a city in India. Various scenes showcase the hairstyling process carried out by experienced hairstylists. The later part of the video also indicates the emergence of this 70s hairstyle as a trend among Indian women. The video concludes by offering a peek at the final result of the styled hair with a fringe, highlighting the influence of the 70s era on modern hairstyles. Despite no spoken dialogue, the text on screen and shot descriptions convey complete information regarding the hair-styling process.",
        "summary_10": "The video highlights a 70s hairstyle tutorial emphasizing its Indian revival.",
        "summary_25": "The video features a tutorial on 70s hairstyles for women, including a self-cut and salon styling, showcasing the trend's revival in India.",
        "summary_50": "The video demonstrates women's 70s hairstyles, starting with a self-cut, progressing to styling in an Ahmedabad salon. Various hairstyling scenes highlight the revival of this trend among Indian women. The video concludes with a stylish fringe look, reflecting the 70s influence on modern hairstyles.\n"
    },
    {
        "video_description": "The video opens with a 15-second shot that features two women who are standing in a parking garage. They are dancing around, predominantly using their hands as part of their movements. During this scene, the handle \"@www.02mrn @\" appears on the screen. The audio segment includes a voice, most likely from one of the women, uttering the phrase \"I told myself.\"",
        "summary_10": "Video shows two dancing women, on-screen tag, voice says phrase.",
        "summary_25": "The 15-second video features two women hand-dancing in a garage, an on-screen handle \"@www.02mrn @\", and an audio saying \"I told myself\".",
        "summary_50": "In a 15-second video, two women are seen dancing in a parking garage, mainly using hand movements. The handle \"@www.02mrn @\" is displayed on-screen while a voice says, \"I told myself\"."
    },
    {
        "video_description": "The video is centered on two individuals dancing, presumably for a TikTok video as indicated by the text that appears on the screen in the first shot. Over the course of several shots, they perform a unique routine with one of the dancers being blindfolded. Their dancing ranges from solo performances to a mirror dance performed together. The short video captures the fun and intriguing antics of internet dance trends, closing with a dance scene involving a woman in a hat and another individual. The video, however, doesn't contain much dialogue, with the only audible speech being in the initial shot. The words spoken are somewhat mystifying and potentially lyrics to the song they're dancing to, stating, 'Like it's the waterfall in love again on so my cycling shiny. I can never think of us. Reminiscence definition. Can you tell me what you want?'. The unique mixture of dance and minimal dialogue provides an entertaining and captivating viewing experience.",
        "summary_10": "The video features two individuals executing a blindfolded TikTok dance.",
        "summary_25": "The video showcases a captivating TikTok dance routine, featuring two individuals, with one blindfolded, performing a range of solo and duo moves.",
        "summary_50": "The video features two individuals performing a TikTok dance routine with one blindfolded, spanning solo and duo performances. The dance evolves across several shots, lacks dialogues, but captivates viewers with its intriguing moves and the perplexing spoken words in the initial shot."
    },
    {
        "video_description": "The video is a review and description of N30, a new smartphone model by OnePlus that costs $300, and it might be the best smartphone for this price in 2023 according to the review. The video features the reviewer talking about the impressive specifications of the phone, including its 108-megapixel camera, 120 Hertz 6.72 inch screen, 8GB RAM and 128GB storage. The reviewer also mentions its fast 5,000 milliamp battery and how the phone offers good value for the price. As a bonus, it comes with free noise-canceling Nord earbuds. Towards the end, the man, who seems to try different features of the phone, encourages viewers to share their thoughts about the OnePlus gadget.",
        "summary_10": "Video reviews OnePlus N30's top specs and free Nord earbuds.",
        "summary_25": "The video reviews the $300 OnePlus N30 launching in 2023, emphasizing its impressive specs and includes noise-canceling Nord earbuds.",
        "summary_50": "The video is a review of the OnePlus N30: a $300 smartphone launching in 2023. It highlights its top-notch specs like a 108-megapixel camera, 120Hz 6.72-inch display, 8GB RAM, 128GB storage, and a 5,000 milliamp battery. Additionally, it comes with complimentary noise-canceling Nord earbuds."
    },
    {
        "video_description": "The video is a mathematical explanation shared by an account named @pinkpencilmath on TikTok. The video runs for 25 seconds where a person with a pink pencil draws mathematical equations to present a thought-provoking mathematical equation. The equation is about fractional and decimal equivalences. The question raised is that if 1/3 equals 0.333 repeating and 2/3 equals 0.666 repeating, then logically, adding them should result in 1. The question proposes that however, adding the decimal equivalents leads to 0.999 repeating which also equals 3/3 or 1. With this, the video challenges the viewer to consider if 1 could possibly equal 0.999 repeating. Interesting sound theory and visuals in the video make it engaging and thought-provoking.",
        "summary_10": "@pinkpencilmath's TikTok video questions decimal equivalency, using fractions.\n",
        "summary_25": "The TikTok video by @pinkpencilmath challenges viewers by showing 1/3 and 2/3 summing to 0.999 repeating, not 1, provoking thought on decimal equivalency.",
        "summary_50": "The 25-second TikTok video by @pinkpencilmath presents a mathematical paradox. Using a pink pencil, the speaker illustrates how 1/3 and 2/3 equate to 0.999 repeating instead of 1, challenging conventional thinking about decimal and fractional equivalents. The creative explanation makes the video intriguing and engaging.\n"
    },
    {
        "video_description": "The video is a guide on how to answer the common job interview question, \"What is your greatest strength?\" In the opening scene, the question is introduced (@erinmcgoff). Next, we watch an interview scenario where the interviewee gives improper responses, such as stating she is a good worker because she shows up on time, expressing she is highly intelligent but being unable to provide an instant answer, and citing internet advice to say her strength is time management. The video then shifts to model the appropriate way to respond to the question. It suggests that appropriate responses include indicating qualities validated by previous employers, like dependability, and narrating tangible personal attributes such as tenacity, resourcefulness, and scrappiness. It also promotes the idea of relating the positive feedback one received in the past, such as being told one's optimistic attitude is a valuable addition to the team. The video concludes with a nod towards a topic of discussion for another video - dealing with anxiety.",
        "summary_10": "The video instructs on articulating strengths in job interviews, pointing at handling anxiety next.\n",
        "summary_25": "The video demonstrates how to proficiently answer \"What is your greatest strength?\" contrasting poor responses with effective ones and hints at a topic on anxiety handling.",
        "summary_50": "The video guides viewers on effectively answering the job interview question, \"What is your greatest strength?\" It illustrates poor responses, then models effective answers showcasing qualities like dependability, tenacity and a positive attitude. The video ends by indicating the next topic will be dealing with anxiety."
    },
    {
        "video_description": "The video starts off with a young girl in a green shirt and face makeup discussing her recent confusion. This shot lasts for 5 seconds and features a text overlay promoting a TikTok account by the name of \"@lianaparmezana\". In the following 9-second shot, text on the screen appears, reading \"real skin\", likely referencing a tutorial or informational content about skincare. However, there isn't any narrative audio in this shot to provide further information. Overall, the video raises curiosity about skincare or makeup application techniques, essentially directing the audience to explore this account further on TikTok.",
        "summary_10": "Video on TikTok '@lianaparmezana' hints at a skincare tutorial.",
        "summary_25": "A video promotes \"@lianaparmezana\" on TikTok, featuring a girl discussing confusion and alluding to a skincare tutorial with \"real skin\" text.",
        "summary_50": "The video features a girl discussing confusion, and promotes TikTok handle \"@lianaparmezana\". It suggests a skincare tutorial with text reading \"real skin\", enhancing curiosity about skincare techniques."
    },
    {
        "video_description": "The video is 83 seconds long and features a man and a child with screens displaying their faces. Throughout the video, various text snippets are displayed on the screen, mostly food-related, which seems to be a fun game comparing different types of food. Some examples include 'hamburger vs ice cream' and 'pizza vs french fries'. The man on screen engages the child participant in questions regarding his preferred choices such as 'barbecue or cookies', 'chips or waffles', and 'cheese or wings'. The video concludes with the statement 'you are what you eat'. The playful, interactive nature of this video could possibly be an engaging and entertaining way to discuss food preferences.",
        "summary_10": "Video shows a man and child playfully discussing food choices.",
        "summary_25": "This 83-second video features a man and a child playfully discussing food preferences through an on-screen game, ending with the message \"You are what you eat\".\n",
        "summary_50": "The 83-second video involves a man and a child participating in a playful food-related game. The screens showing their faces display various snack choices, prompting an interactive discussion on their preferences. The video concludes with the fun message, \"You are what you eat.\" It's an entertaining way to explore food likes.\n"
    },
    {
        "video_description": "The video is a short-format clip of 44 seconds, primarily featuring a melancholic narrative derived from various textual inputs scattered throughout the background. It visually portrays a toddler who seems to be in some emotional distress, providing a somber atmosphere to the video. Accompanied by the silence in the audio, this distress is further emphasized with the on-screen text which reads \"well maybe we got lost in...well maybe we got relations translation @sheeguin TikTok maybe this thing was a...masterpiece beauty piece till you tore it all up. running scared I was...there dared TikTok I remember it all to well. and you call me up...one day again just to break me like a promise. so casually...cruel cold 100\". This somewhat tragic statement heavily indicates that the video is a narrative of a failed relationship and its subsequent impact on the individuals involved. The mother of the toddler, towards the end of the video, encourages the child to call her in an attempt to console her.",
        "summary_10": "Video presents distressed toddler, on-screen broken relationship text, mother consoles.",
        "summary_25": "The video shows a silent, upset toddler and on-screen text suggesting a broken relationship, while her mother attempts consolation.",
        "summary_50": "This 44-second video depicts a distressed toddler with no audible speech, emphasizing her sadness through on-screen text narration suggestive of a failed relationship. The child's mother tries to console her, emphasizing the somber atmosphere."
    },
    {
        "video_description": "The short-form video opens with a display of a TikTok handle, @khaby.lame. In the first shot, an elderly man can be seen interacting with a set of red buckets, perhaps in a playful manner. The scene then transitions to an interior setting where a group of individuals is examining a sculpture. The central figure in the next shot is a man clad in a red shirt, who stands prominently amongst a crowd. The username @khaby.lame appears on the screen once again, suggesting that he may be the individual in the red shirt. The video concludes with a strangely engaging scene of a man situated amidst trash cans in what appears to be a residential living room space. No audible dialogue or notable text features throughout the video.",
        "summary_10": "TikTok video features @khaby.lame, an elderly man, sculpture onlookers, and cluttered living room.",
        "summary_25": "The video featuring TikTok user @khaby.lame, showcases an elderly man with buckets, onlookers at a sculpture, a prominent man in red, and ends with a man amidst trash cans.",
        "summary_50": "The video displays TikTok user @khaby.lame and progresses through scenes featuring an elderly man with red buckets, people examining a sculpture, a central male figure in red, and concludes with a man among trash cans in a living room. No audible dialogues or notable texts are present."
    },
    {
        "video_description": "The short-form video is themed around a golden retriever and its interaction with a toy. There are two shots in total, each lasting 6 seconds. The first shot focuses on a video shot through a pet camera, referred to as a \"petcube q\", that captures a golden retriever dog having a delightful time with its toy. There is no speech in the shot, but the text on the screen refers to a TikTok handle @aguyandagolden and a caption that articulates the dog was spotted having a \"special moment\" with its toy. The second clip in the video depicts a more clear and visually engaging scenario of the golden retriever earnestly playing with a stuffed dog toy in front of a cozy fireplace. This shot also contains no audio transcript but simply enforces the earlier text displayed on screen mentioning a \"special moment with his toy\". This video is a lighthearted and fun representation of a pet having a joyful moment with its favorite toy.",
        "summary_10": "Video shows a golden retriever's 'special moment' with a toy.",
        "summary_25": "The video features a golden retriever delightfully playing with a toy across two shots, highlighting a 'special moment' captured via a pet camera.\n",
        "summary_50": "The video captures a golden retriever's playful interaction with its toy across two 6-second shots. The first shot, taken through a pet camera, is further elaborated in the second as the dog joyfully plays with a stuffed toy in front of a fireplace. Their 'special moment' is highlighted throughout.\n"
    },
    {
        "video_description": "The short video consists of two shots and lasts for a total of seven seconds. The first shot, lasting for four seconds, focuses on a young boy who is taking a selfie while holding a camera. In this shot, the boy identifies himself as a photographer. This is also emphasized by the text displayed on the screen which is an on-screen version of his spoken words, indicating his social media handle as well. The second shot, which runs for three seconds, features a cat sitting on the ground, stretching its front legs. During this shot, the boy comments, \"that's a thing,\" but there isn't any text displayed on the screen during this moment. This video captures the boy's photography activities, possibly shared via social media.",
        "summary_10": "Seven-second video: boy's selfie, self-identification as photographer, comments on cat.",
        "summary_25": "In this seven-second video, a boy self-identifies as a photographer while taking a selfie, then comments on a stretching cat.",
        "summary_50": "This seven-second video features two shots; the first presents a boy taking a selfie with a camera, identifying himself as a photographer and sharing his social media handle. The second shot shows a cat stretching, with the boy commenting, \"that's a thing.\"\n"
    },
    {
        "video_description": "The video is a tutorial on how to create a two-toned blue French tip manicure. The tutorial consists of quick one-second shots that, when put together, form a step-by-step guide for designing a two-tone blue French tip manicure. At the start, on-screen text explains the video's purpose: \"how to create a two-toned blue French tip manicure @lightslacquer\". As the shots progress, viewers are shown different stages of the manicure process, each step contributing to the creation of the final two-tone blue nails. The process involves a person's hand with the finished manicure displayed, and nail polish being applied. Towards the end, the video features a close-up of someone's hand revealing the finished two-tone blue and white nails. The video concludes with a shot bearing the Tik Tok logo, suggesting the tutorial's publication on the popular social media platform. The video does not contain background commentary, leaving it mainly driven by its visuals.",
        "summary_10": "It's a tutorial video for a two-toned blue French manicure.",
        "summary_25": "This video is a visual tutorial showing how to create a two-toned blue French tip manicure, from starting point to finish, ending with a Tik Tok logo.",
        "summary_50": "The video is a step-by-step visual tutorial on creating a two-toned blue French tip manicure. It consists of quick shots showcasing the manicure process, starting with a base of blue nails and concluding with a close-up of the finished blue and white nails. It’s largely visually driven with a Tik Tok logo conclusion."
    },
    {
        "video_description": "The video revolves around a young man receiving a gift from his parents, who are seen in their home. The parents surprise their son with Sneaker Erasers as a gift, an item he has desired for some time. Initially, he is excited, but there's a catch. His mom instructs him on how to use the erasers correctly to clean the sneakers. She explains the process of wetting the eraser, scrubbing gently with the white side, and then flipping it over to the orange side to wipe away the residue. The son is thankful for the gift and finds using the Sneaker Erasers to be very easy. However, towards the end of the video, the son realizes that his parents also have a pile of their own shoes for him to clean. They hint that the Sneaker Erasers are not exclusively for him, and he should also look after their shoes, leaving him slightly taken aback.",
        "summary_10": "Boy gets Sneaker Erasers as gift, ends up cleaning parents' shoes.",
        "summary_25": "A young man receives Sneaker Erasers as a gift from his parents, learns to use them, but unknowingly, also to clean their shoes.",
        "summary_50": "A young man in the video receives Sneaker Erasers from his parents as a desired gift. His mom instructs him on proper usage, and he's enthusiastic about the easiness. But he later discovers it's also for cleaning his parents' shoes, leading to a surprising twist."
    },
    {
        "video_description": "The short video focuses on the \"Tiko's The Train Restaurant\" located in Chiang Mai. The video begins with a display text '@visit,' suggesting that the footage is promotional or travel-oriented. A speech is heard with a soothing voice remarking 'Beautiful.' in admiration, and the shot's length is around ten seconds. From this brief video, viewers can acquire a sense of the visual aesthetics and overall appeal of Tiko's The Train Restaurant.",
        "summary_10": "Video promotes \"Tiko's The Train Restaurant\", highlighting its beauty.",
        "summary_25": "The video showcases \"Tiko's The Train Restaurant\" in Chiang Mai, promoting its aesthetic appeal in a ten-second clip with a voiceover praising its beauty.",
        "summary_50": "The brief video focuses on \"Tiko's The Train Restaurant\" in Chiang Mai, featuring '@visit' on-screen text indicating promotion. With a voice remarking 'Beautiful,' it offers a ten-second glimpse into the locale's aesthetic appeal."
    },
    {
        "video_description": "The video is an informational feature about the Egyptian Water Lily, also known as the Blue Lotus flower. Responding to a TikTok query about the \"flower of choice\" for ancient Egyptian Pharaohs, the narrator reveals that it is the Blue Lotus. The flower, known for its mildly psychoactive properties, can be consumed as a tea or smoked alone, occasionally blended with other flowers like mugwort and lavender. Historically, the Blue Lotus has been used to induce relaxation, enhance mood, ignite feelings of passion. Some individuals also report an enhanced sense of awareness, and the flower is used to facilitate vivid and lucid dreaming. The video ends highlighting the plant's potential as a significant alternative for people dealing with insomnia or anxiety, as well as anyone seeking an alternative to their usual flowers during periods of tolerance break. The video contains multiple shots of the plant, its preparation, and consumption methods.",
        "summary_10": "The video covers Blue Lotus flower's uses and therapeutic benefits.\n",
        "summary_25": "The video depicts the Blue Lotus flower's historical importance, psychoactive properties, consumption methods, and its usage as a therapy for insomnia and anxiety.\n",
        "summary_50": "The video explains the Egyptian Water Lily or Blue Lotus flower's significance, favored by ancient Egyptian Pharaohs. It outlines the flower's mildly psychoactive properties, consumption methods, and its application in inducing relaxation, enhancing mood, facilitating vivid dreaming. It also suggests its use as an alternative therapy for insomnia or anxiety."
    },
    {
        "video_description": "The video is a skincare and makeup tutorial by a TikToker who goes by the username @stellarosalife, where she shares her unique skincare and mid-shift touch-up routine. She reveals that the secret to her fresh skin look, even after a long hospital shift, is not just skincare but also a 'volcanic rock thing' she sells on her TikTok shop. She adds that people often mistake her glowy skin for greasiness, which she considers unappealing. To combat that, she touches up her makeup mid-shift to keep her look fresh. Later, she demonstrates how the volcanic rock effectively removes excess grease from the skin without rubbing off makeup. This is followed by her applying powder to freshen up her makeup without making it appear overdone or 'nasty'. She firmly vouches for the volcanic rock, calling it a crucial tool for midday makeup touch-ups. The video ends with her wishing the viewers a goodnight. Throughout the video, she records herself inside a car, at times in the backseat and sometimes in the front, applying and explaining her skincare and makeup routine.",
        "summary_10": "@stellarosalife reveals her car skincare routine featuring volcanic rock.\n",
        "summary_25": "TikToker @stellarosalife shares her skincare routine in a car, highlighting a volcanic rock product from her shop for mid-shift makeup touch-ups that control greasiness.\n",
        "summary_50": "The video features TikToker @stellarosalife sharing her skincare, makeup routine, and mid-shift touch-ups. She reveals her secret: a volcanic rock product from her shop that removes skin grease without smudging makeup. Her routine helps maintain a fresh, non-greasy appearance. She records these tips inside a car."
    },
    {
        "video_description": "The video, titled \"POV: Me verses Alarm TikTok,\" humorously illustrates the perennial struggle of waking up to an alarm in the morning through cartoon imagery. The short video creatively uses images of two cartoon characters lying in bed, intercut with shots of an alarm clock, effectively metaphorizing the juxtaposition. The cartoon figures, encapsulating the human tendency for succumbing to sleep, are frequently seen on the bed, alternated with visual displays of the alarm set for various intervals starting from 5:00 AM. In one shot, there is being a display of multiple alarms set within a progressively short window of 5 minutes each. This comedic take on the universal struggle of battling the alarm clock continues through various shots, ultimately leaving viewers with a nuanced portrayal of 'me vs alarm,' through cartoon imagery.",
        "summary_10": "The video humorous cartoon depicts struggles with morning alarms.",
        "summary_25": "The video \"POV: Me verses Alarm TikTok\" humorously showcases the universal struggle of waking up to alarms through cartoons.",
        "summary_50": "The \"POV: Me verses Alarm TikTok\" video humorously depicts the struggle of waking up to an alarm using cartoons. It alternates between characters lying in bed and shots of an alarm clock. It comically illustrates the universal struggle of humans versus alarm clocks, through animated visuals."
    },
    {
        "video_description": "The video is a humor-laden conversation between two men, presumably named Steve and Terry, who are both seen having breakfast, primarily consisting of waffles and pancakes. In the initial shots, a man named Steve in a suit is seen enjoying waffles, followed by another man, Terry, devouring a stack of pancakes. Terry questions Steve's choice of pancakes since Steve had earlier expressed his liking for waffles. Steve casually responds that while he likes waffles, he also enjoys pancakes. This exchange gives way to a humorous mockery of a profound life lesson. Terry continues to persist that if Steve likes waffles, he should get waffles and that he shouldn't settle for his second-best option. The conversation takes a humorous turn towards the concept of settling for less in life symbolized by the choice between waffles and pancakes. The video concludes with the significant message, \"In a world where everyone's settling for pancakes, you deserve waffles.\" Throughout the video, both characters are seen at the breakfast table wearing suits, eating, and engaging in this amusing yet insightful waffle-pancake banter.",
        "summary_10": "The video humorously contrasts waffles and pancakes to discuss settling for less.\n",
        "summary_25": "The video humorously depicts a breakfast debate between Steve and Terry on not settling for less, symbolized by their preference for waffles or pancakes.",
        "summary_50": "The video features a comedic dialogue between Steve and Terry over breakfast. While both enjoy pancakes, Terry humorously argues that Steve, who prefers waffles, shouldn't settle for pancakes - his second option. This quirky conversation alludes to a life lesson about not settling for less.\n"
    },
    {
        "video_description": "The video is a tutorial about efficient watermelon cutting techniques, presented by a user with the handle @monicas.cutting. The video begins with a woman slicing a watermelon and chopping it into pieces. She continues to demonstrate a method of quickly and efficiently slicing the watermelon using a specialized tool described as a steel needle slicer - she suggests this method for being both fun and labor-saving. The footage then transitions to a person using a grater for creating watermelon dices or strips, emphasizing ease of use. A person is then shown cutting the fruit into finer pieces using scissors, highlighting the visual appeal of the final product. The next shots illustrate the finished watermelon slices, a demonstration of the various techniques explained. Somewhat confusingly, the video ends with a shot of sliced meat on a tray next to a knife and scissors, not connected to the watermelon cutting tutorial. This video seems geared towards viewers, perhaps culinary enthusiasts, interested in learning new kitchen techniques and tips.",
        "summary_10": "Video teaches quick watermelon slicing for culinary enthusiasts; ends with meat.",
        "summary_25": "The video by @monicas.cutting teaches quick watermelon slicing techniques, concluding unexpectedly with sliced meat. Aimed at culinary enthusiasts learning new skills.\n",
        "summary_50": "This video tutorial, by @monicas.cutting, demonstrates efficient methods for slicing and dicing watermelon using various tools. Showcasing different techniques from standard slicing, use of a steel needle slicer to grating, it ends unexpectedly with a shot of sliced meat. It's tailored for culinary enthusiasts eager to learn new skills.\n"
    },
    {
        "video_description": "The video opens with a screenshot of a map pointing out where Houston is located, along with text overlay referring to different areas and time durations like Conroe, The Woodlands, Cypress, and Katy among others. The audio transcript accompanying this shot has a person saying, \"You mean, we didn't meet?\" The video then abruptly shifts to show a blonde woman crying, against a black background. This second shot doesn't have any audio or on-screen text. Despite this stark visual shift, the video appears to tell a story of someone who seems to be dealing with a missed connection, in the context of Texas travel.",
        "summary_10": "Video: Houston map, missed meet-up audio, crying woman suggest disconnect.",
        "summary_25": "The video depicts a Houston map, an audio hinting at a missed meet-up, and a weeping woman, implying a failed connection.",
        "summary_50": "The video showcases a map of Houston with location tags, accompanied by the audio, \"You mean, we didn't meet?\", subsequently displaying a crying blonde woman. It hints at a missed connection during Texas travel."
    },
    {
        "video_description": "The video is a short narrative about troubleshooting and problem solving in a medical setting. It begins with a nurse noting that she's missing medication for a patient. She's seen working on her laptop in a pink outfit, while text on the screen shares her thoughts. The scene then shifts to a homemaker in NYC consulting with her. She also tries to help, but the medication still can't be located. More people get involved including another woman, a female doctor, all communicating and collaborating through their laptops. Conversations continue over the computer, with individuals in different settings like kitchen, office and a RV, all trying to track down the misplaced medication. They all check various places in their locations with no success. Text on the screen shows their back-and-forths, as they meticulously keep checking all possible locations. Finally, someone remembers a spot that hasn't been checked and voila! The medication is found in the refrigerator. The video ends on a humorous note with the nurse, relieved and slightly exasperated, thanking everyone for their help in locating the medication. The video revolves around the theme of problem solving, communication and teamwork in a healthcare setting.",
        "summary_10": "Video depicts healthcare teamwork and problem-solving to locate medication.\n",
        "summary_25": "The video shows a multisite team effort locating a patient's lost medication, found in an unchecked fridge, highlighting healthcare teamwork and problem-solving.",
        "summary_50": "The video depicts a collaborative effort across various settings to locate a patient's missing medication. Amidst various failed attempts, the medication is eventually found in an unchecked refrigerator. The narrative centers on teamwork, communication, and problem-solving in healthcare. It ends with a relieved nurse thanking her team."
    },
    {
        "video_description": "The video features a series of scenes centered around footwear and different individuals in various indoor settings. Initially, the clip showcases a woman named Sharon Bradley at home, capturing attention with her stylish heels. The scene shifts to Julia Andrews displaying her skills on roller skates. A section of the video focuses on a cooking scenario where the chef's spouse prepares to cook based on the chef's suggestions. An intriguing moment features an individual standing on a frying pan wearing black shoes. Shortly after, a scene from an MTV show displays an intimate moment between two people in a bathroom. There is a distinct sequence showing someone in flip-flops proclaiming their feeling of walking on eggshells lately, a popular TikTok phrase. Another person is seen casually strolling through a spacious living room, followed by two individuals wearing high heels navigating their way through a kitchen with a large pan. A man is viewed standing shoeless in a hallway, and two people perform handstands in a room with a pan present on the floor. The concluding shots focus on people walking in a large room with a pan on the floor, and a man donning white sandals, again drawing attention to the theme of footwear throughout the video.",
        "summary_10": "The video showcases various activities and footwear in domestic scenes.",
        "summary_25": "The video highlights domestic scenes and footwear, presenting individuals in various activities, from skating to cooking, and metaphorical walking on eggshells.",
        "summary_50": "The video showcases various indoor scenarios with a focus on footwear. It features a woman in heels, a skater, a cooking scenario, someone metaphorically walking on eggshells in flip-flops, and various people navigating domestic environments. A scene from MTV, handstands in a room with a pan, and a shoeless man feature prominently.\n"
    },
    {
        "video_description": "The video captures a suspicious scenario involving a man parked outside an apartment with a some damage on his car window. The man's car was noticeably parked in a peculiar way, and had a dog in the driver's seat. Driven by curiosity and concern, the video maker went upstairs to call for help, only to find that the man changed his position, further arousing suspicion. Amidst this unsettling situation, a humourous sleeping man was captured, somehow fitting into the bizarre narrative. Finally, an ambulance arrived to address the ongoing situation, with people and other cars around it. In the concluding scene, the man tries to get out of his car, leaving the viewers in anticipation for the \"moment of truth\". The video, laced with a blend of suspicious activity, humor and anticipation, seemed to capture an unexpected incident that unfolded in the locality.",
        "summary_10": "Video features suspicious man, damaged car, and tense ambulance arrival.\n",
        "summary_25": "This video captures a bizarre situation involving a suspicious man, his damaged parked car, escalating towards an ambulance call with an anticipated conclusion.\n",
        "summary_50": "The video depicts a curious incident, with a man suspiciously parked outside an apartment, a damaged car window and a dog in the driver's seat. The scenario escalates with a call for help, the arrival of an ambulance, and ending with the man exiting the car."
    },
    {
        "video_description": "The video starts with a man seeking to start a small business with $100 at Walmart. Originally, he thinks about buying a bike and starting a Doordash, but the cost exceeds his budget. As he continues exploring Walmart, he decides against businesses requiring physical labour and finds himself in the craft section where he gets the idea to customize bracelets with wood-burning technology. Spending $50 on wooden beads, a wood-burning tool, and some string, the man returns home to start creating. After practicing and perfecting his skill, his first product, a wooden-bead bracelet, is complete. He then uses an online tool to generate a business name, \"Amber Edge\". Meanwhile, he aims to rent out space on popular social media pages to livestream himself making these bracelets, paying these pages $40 for two hours of infomercial. He also intends to sell the bracelets at $20 each. The video ends with the man ready to live-stream his bracelet production process, bringing the concept of his $100 Walmart business to life.",
        "summary_10": "Man starts $100 \"Amber Edge\" bracelet business at Walmart, markets online.",
        "summary_25": "The video features a man initiating a $100 custom bracelet business at Walmart, under the name \"Amber Edge,\" and marketing via live-streaming.\n",
        "summary_50": "In the video, a man initiates a $100 business at Walmart, crafting custom bracelets using wood-burning technology. He rents social media space for live-streaming bracelet making. The produced bracelets, under the business name \"Amber Edge,\" are planned for sale at $20 each."
    },
    {
        "video_description": "The video is a short form instructional clip posted on TikTok by @alluredbeauty and it showcases how to prepare a massive 20 pound burger for dinner. The woman, who appears in all the shots, starts by showing food items such as a large loaf of bread and a seven pound burger patty. Interestingly, she also mentions the necessity of three to five pounds of vegetables. Drawn by the effectiveness and convenience of vegetable choppers she often saw on TikTok, the woman finally decided to purchase one. She describes this is as a life-changing decision, anticipating it will save her substantial time. The tool isn't a unitasker, it comes with interchangeable slicers and dicers. The woman illustrates its use by easily slicing bread and dicing onions, straight into the container. She further demonstrates how the tool is ideal for consistent chopping of tomatoes. Additionally, there is a special feature for cutting potatoes into french fries or waffle fries for the burger. The gadget is cost-effective, marketed at approximately $25 and is available via a small yellow online shopping cart. The video ends without the complete assembly or cooking of the massive burger.",
        "summary_10": "@alluredbeauty's TikTok presents burger preparation using an economical chopper.\n",
        "summary_25": "The TikTok by @alluredbeauty shows how to prepare a 20-pound burger using a versatile and economical vegetable chopper available online.",
        "summary_50": "The TikTok video by @alluredbeauty demonstrates the preparation of a 20-pound burger using a resourceful vegetable chopper. This kitchen gadget, equipped with versatile accessories, simplifies slicing bread and dicing onions. It also enables effortless chopping of tomatoes and potatoes into french fries. The economical tool costs $25 and is obtainable online."
    },
    {
        "video_description": "The video is a review of the DeaPLAY PJ80 MULTIMEDIA Full HD 1080p Projector purchased from the TikTok shop. The narrating couple didn't want an obstructive TV in their bedroom, so they opted for a projector that they placed on a homemade shelf, crafted by the husband from part of their headboard. The video includes scenes of the couple opening the projector's box and a step-by-step view of the husband building a shelf above their bed for the projector, negating the need to hang it from the ceiling. They expressed satisfaction with their purchase, impressed by the projector's clarity and performance, which makes their patterned wall look like a movie screen. They demonstrated the exceptional picture quality by showing the animated movie Wall-E projected onto their wall. The projector's performance in their bedroom created an atmosphere akin to a mini cinema, leaving them satisfied with their purchase.",
        "summary_10": "Video reviews DeaPLAY PJ80 Projector's installation and quality in bedroom.\n",
        "summary_25": "The video reviews the DeaPLAY PJ80 Projector, showing its installation on a homemade shelf and excellent quality by screening Wall-E in a bedroom.\n",
        "summary_50": "The video reviews the DeaPLAY PJ80 Projector from the TikTok shop. A couple, preferring a projector to a TV in their bedroom, demonstrates its setting on a homemade shelf and its superior picture quality. They show the projector screening Wall-E, turning their bedroom into a mini cinema.\n"
    },
    {
        "video_description": "The video revolves around a young man's venture to a beauty supply store where he discusses and endorses his own product. He initiates a conversation with a store clerk about a new line of durags they are stocking. The video then transitions to a different scene, displaying a store teeming with various goods. The young man continues to commend his product, stating he has not seen them anywhere before. He humorously comments that the product is so new he doesn't know the price. Later in the video, there are scenes of a woman smelling a medication bottle and multiple customers browsing and holding items. A comment is mentioned about providing a random price, which adds a comedic element to the narrative.",
        "summary_10": "A man comically endorses his unique product in a busy store.",
        "summary_25": "The video features a man humorously promoting his novel, rare product at a bustling beauty supply store, engaging with customers and staff.",
        "summary_50": "The video follows a young man promoting his product at a beauty supply store. He discusses the newness and rarity of the product with the store clerk and customers, adds humor by joking about unknown pricing, and includes a scene of customers and their interactions with other products."
    },
    {
        "video_description": "The video is a concise and informative skincare tutorial featuring Aveeno's Calm & Restore range. The vlogger shares her morning skincare routine, explaining how these products have helped her combat dry and irritated skin. She showcases the soothing benefits of the Gentle Nourishing Oat Face Cleanser, explaining how it hydrates the skin while preserving its moisture barrier. Her skincare routine includes the use of a Triple Oat Serum that protects and smooths the skin, followed by moisturizing with a light and refreshing Oat Gel Moisturizer, which she mentions keeps her skin hydrated for up to 24 hours. Towards the end of the video, the vlogger encourages viewers to try Aveeno's Calm & Restore products and informs them that these products are available online and at most retailers. Throughout the video, the vlogger demonstrates the use of these products, making it easy for viewers to understand the application process. The video provides an authentic and convincing endorsement of Aveeno's Calm & Restore range.",
        "summary_10": "The vlogger showcases and promotes Aveeno's Calm & Restore skincare routine.",
        "summary_25": "The vlogger shares her skincare routine using Aveeno's Calm & Restore range, highlighting its benefits and promoting its availability online and at retailers.",
        "summary_50": "The video is a skincare tutorial featuring the Aveeno's Calm & Restore range. The vlogger shares her routine highlighting benefits like hydration, smoothing and protection against dryness. The vlogger encourages viewers to try these products available online and at retailers, providing an endorsement for Aveeno's range."
    },
    {
        "video_description": "The video is a sentimental message to parents about appreciating the messy phases of raising children. It opens showing a woman forcefully cleaning a window, interjected with several pieces of text throughout the video. Following shots show her further cleaning the environment, hinting the burdens of parenting. Through subtitles like \"if you're still in the process of raising children\" and \"be aware that the tiny fingerprints to show up on\", the video communicates critical life insights for parents. Around the middle of the video, the scene shifts to toys strewn around a house, indicating children's joyful chaos. Additionally, the focus is on the overwhelming \"piles and piles\" displayed in a child's room. The poignant statement: \"will disappear all too soon\" is raised alongside a shot of an elderly pastor speaking in front of a crowd, suggesting the fleeting nature of these messy stages. The video concludes with images symbolising the profound missing of these stages once they're over. It implores viewers to cherish these messy but meaningful moments of parenthood.\n",
        "summary_10": "Video encourages parents to appreciate fleeting, chaotic moments of childhood.",
        "summary_25": "The video evokes a sentimental message for parents, stressing the value and transient nature of childhood chaos, urging appreciation before its disappearance.",
        "summary_50": "The video presents a heartfelt message to parents, encouraging them to cherish the chaotic yet fleeting moments of raising children. It depicts the labors and joys of parenthood, emphasizing the transient nature of even the messiest phases, and urges viewers to appreciate them before they disappear."
    }
]