[
    {
        "video_description": "The short video is a compilation of two shots from TikTok, posted by a user named \"@miss_noodles23\". The first shot, which lasts for 6 seconds, shows a dog, presumably named Miss Noodles, laying next to stuffed animals on a wooden floor. A text overlay on this shot introduces the user’s TikTok handle and also includes a few repeated lines of lyrics: \"If you aren't real, then how come I feel this way\", and the phrase \"little babies\". This audio, featuring the same lines, plays throughout this shot. The video switches to the next shot relatively quickly, lasting for four seconds. In this shot, the TikTok logo is presented on a stark black background, with no audio or supporting text.",
        "summary_10": "TikTok video by \"@miss_noodles23\": dog, lyrics, and silent logo display.",
        "summary_25": "The video features two TikTok shots by \"@miss_noodles23\": a dog with stuffed toys and lyrics, followed by a silent TikTok logo display.",
        "summary_50": "The video consists of two TikTok shots from \"@miss_noodles23\". The first shows a dog alongside stuffed animals, there is a lyrical text and audio. The second shot briefly displays the TikTok logo, without any audio."
    },
    {
        "video_description": "The video is a short and engaging cooking tutorial from TikTok user 'mealsandmunchies'. It shows the viewer how to prepare a quick and simple meal using only five ingredients. The cooking process begins with the heating of ground beef or turkey in a skillet, while simultaneously boiling a pot of water. Once the water boils, tortellini is added. The next step involves the shredding of mozzarella cheese, with the shredder linked on the user's Amazon storefront being recommended. The meat is seasoned with salt, pepper, Italian seasoning, and crushed red chili flakes. After this, a jar of marinara sauce and a block of cream cheese are mixed into the cooked meat. The cooked tortellini is then added to this mixture. The dish is topped with the previously shredded mozzarella cheese and is baked for 10 minutes at 350 degrees. The video ends with the user encouraging viewers to follow her for more quick and easy recipes. The video takes a brief advertising detour towards the end, mentioning that TikTok is the first app that users should download.\n",
        "summary_10": "TikTok's 'mealsandmunchies' provides a quick five-ingredient meal tutorial.",
        "summary_25": "This is a brief TikTok video from 'mealsandmunchies' showing how to quickly prepare a five-ingredient meal. It promotes the user's Amazon store and encourages TikTok downloads.",
        "summary_50": "The video, a tutorial from TikTok user 'mealsandmunchies', demonstrates a quick meal preparation using five ingredients. Steps include cooking meat and tortellini, shredding mozzarella cheese, seasoning, adding marinara and cream cheese, topping with mozzarella, and baking. The user's Amazon store's shredder is promoted, and followers are urged to download TikTok."
    },
    {
        "video_description": "The short video consists of two shots, with a total duration of 10 seconds. The first part of the video, lasting six seconds, features a white cat yawning and looking drowsy on a bed. Throughout this shot, a humorous text overlay is displayed, describing the cat's typical day such as sleeping for 18 hours, pestering its owner by stomping on their head at 4:00 am until it is fed, and playfully fighting with its sibling. A dialogue can be heard in the background, saying \"Lord have mercy. Hmm. They drink me.\" However, this doesn't seem to relate directly to the cat's actions at the moment. The second shot, lasting for four seconds, shows the TikTok logo prominently displayed against a black background. No dialogue or text accompanies this shot, marking the end of the video.",
        "summary_10": "Humorous video of white cat's daily antics, ending with TikTok.",
        "summary_25": "The video humorously portrays a white cat's daily routine of prolonged sleep, pestering its owner for food, and sibling fights, concluding with the TikTok logo.",
        "summary_50": "This 10-second video showcases a white cat's humorous daily antics ending with TikTok's logo. The cat, known for sleeping 18 hours, pokes the owner until fed, and playfully fights its sibling. A voiceover shares unrelated dialogue, and the video concludes without any accompanying text or dialogue."
    },
    {
        "video_description": "The short form video revolves around a young girl, identified as @elysebelll from her TikTok profile which is displayed as text on the screen. She is seen sitting at a table, clad in a white top and green pants. The duration of this shot is quite long, lasting 78 seconds and is accompanied by an audio transcript where it's indicated that she is expressing her emotions through her heart's song titled 'Don't Let Go', portraying feelings of hopelessness. The video concludes with a brief 4-second shot displaying the TikTok logo set against a dark backdrop. There is no audio transcript in this last shot. This video appears to be a emotional recital shared through the social media platform TikTok.",
        "summary_10": "Video features @elysebelll singing emotionally on TikTok, ends with logo.",
        "summary_25": "The video showcases @elysebelll, singing 'Don't Let Go' on TikTok, dressed in white and green. Concludes with a TikTok logo display.",
        "summary_50": "The video features a girl @elysebelll, expressing her emotions through a song 'Don't Let Go' in a 78-second TikTok clip. She's clad in white and green, seated at a table. The video ends with a 4-second display of the TikTok logo."
    },
    {
        "video_description": "The short-form video comprises two shots. The first shot, lasting for 5 seconds, shows two dogs energetically leaping over a swimming pool located in a backyard. The accompanying audio records someone excitedly exclaiming \"Wait, wait. Wait, wait.\" The scene is accentuated with the text \"TikTok Tik Tok\" displayed on the screen, pointing to the popular social media platform. The very next shot transitions to a static image of the recognizable TikTok logo paired with a depiction of the TikTok app interface open on a device. Interestingly, this second shot is devoid of any accompanying audio or on-screen text and lasts for 4 seconds. With its visual storytelling, the video utilizes the popularity of pets and social media, specifically TikTok, creating a possibly engaging and modern spectator experience.\n",
        "summary_10": "Video features dogs jumping, \"Wait, wait\" audio, and TikTok branding.",
        "summary_25": "The video showcases two dogs jumping over a pool with \"Wait, wait,\" audio and TikTok motifs, corroborating pet fondness and social media.",
        "summary_50": "A short video features two dogs jumping over a pool, with audio exclaiming \"Wait, wait.\" Text reads \"TikTok Tik Tok.\" It transitions to a TikTok logo and app interface in silent, demonstrating the blend of pet enthusiasm and social media."
    },
    {
        "video_description": "The video begins with a woman presenting a salad, supposedly consumed daily by Jennifer Aniston during the filming of 'Friends', according to a TikTok video by @nourished.by.mads. The preparation of the salad is shown, starting with 3 cups of cooked quinoa. Subsequently, a variety of ingredients are added, including 1 cup of cucumber, 1/3 cup of red onion, 1/2 cup each of roasted, salted pistachios, mint, parsley, and feta cheese, as well as chickpeas. Lemons are juiced into the mixture for added taste, whilst 1/4 cup of olive oil and a sprinkle of salt and pepper garnish the salad. The ingredients are mixed together with a wooden spoon. The final narration shows a woman tasting the salad, again referencing the fact that it was a favored meal of Jennifer Aniston. The video concludes with the TikTok logo and the handle of @nourished.by.mads.",
        "summary_10": "Video shows woman making Jennifer Aniston's rumored 'Friends' quinoa salad.",
        "summary_25": "The video features a woman preparing a quinoa salad, rumored to be Jennifer Aniston's daily 'Friends' set meal, according to TikTok's @nourished.by.mads.",
        "summary_50": "The video showcases a woman preparing and tasting a quinoa salad, attributed to Jennifer Aniston's diet on the 'Friends' set, based on a TikTok by @nourished.by.mads. The salad is made from quinoa, cucumber, red onion, pistachios, mint, parsley, feta, chickpeas, lemon juice, olive oil, salt, and pepper.\n"
    },
    {
        "video_description": "The video begins with an introduction by Jayce Hall, who specializes in art by handwriting names and phrases. The focus of the art in this instance is a likeness of singer Whitney Houston, created by writing her name multiple times. This unique artwork is etched onto a wooden panel, enhancing its aesthetic appeal and texture. The viewer follows the progress of the creation, displayed through various shots of the artist drawing on the wood with a black marker. Notably, Jayce seems particularly proud of the way Houston's smile turned out in the sketch. At different intervals, we see the brand name of the pen he used, 'Sakura Color PRC'. The final piece is a detailed pencil drawing of Whitney Houston on the wood panel, illustrated by using her name as an ink pattern. The video does not contain any audio aside from Jayce's initial introduction.",
        "summary_10": "Jayce Hall's art portrays Whitney Houston using repetitive name inscription.\n",
        "summary_25": "Jayce Hall creates a distinct Whitney Houston portrait using her name repeatedly on wood, emphasizing an artistic technique and the singer's smile.",
        "summary_50": "The video features Jayce Hall creating a unique portrait of Whitney Houston by repeatedly writing her name on a wooden panel. The black marker sketch, using 'Sakura Color PRC', reveals an impressive likeness, particularly the singer's smile. Jayce's innovative art technique is showcased without additional dialogue.\n"
    },
    {
        "video_description": "The video features the introduction of a new footwear product: yellow rubber Croc boots by MSCHF, a brand known for its creativity and whimsy. At the beginning, some children are seen walking on sidewalks in yellow boots, and subsequent shots reveal the new Croc boots' unique appeal. The Croc boots follow the previous success of the brand's big red boots, now stylized in vibrant yellow and included in an official collaboration with Crocs. They are showcased in different settings, accompanied by narrated descriptions. The yellow Crocs are intricately manufactured with the classic Crocs branding, equipped with an iconic back strap and are notably bigger than regular Crocs. They feature the characteristic top holes of regular Crocs that provide a see-through view to the user's feet. The video also addresses potential customer concerns regarding the footwear's comfortability, proving that they are lighter than the original pair and solely as high regarding length, making them a comfortable fit. The comfort factor holds true whether they are worn with shorts or pants.\n",
        "summary_10": "The video unveils MSCHF's comfortable, uniquely featured yellow Croc boots.",
        "summary_25": "The video introduces MSCHF's yellow rubber Croc boots, highlighting their unique features, comfortability, and versatility with different clothing.",
        "summary_50": "The video presents MSCHF's new yellow rubber Croc boots, a collaboration with Crocs. The boots, larger than regular Crocs, maintain classic branding with unique features like see-through holes and an iconic back strap. They are lightweight, comfortable, and versatile with both shorts and pants."
    },
    {
        "video_description": "The video opens with a TikTok labeled as @funny.life5.usa and @basicallytheinternet. The scenario portrayed is a classroom rule - if someone's phone rings during the session, they have to put it on speaker. The situation escalates when someone's phone indeed rings, and an intriguing phone call ensues. The call, captured using on-screen text, starts with Kevin informing Ms. Nefco of surprising test results returning positive, presumably a pregnancy test. Throughout the call, Kevin assures Ms. Nefco of supporting her throughout the process, offering free counseling and even providing an oddly specific suggestion for a baby name, April Fool. The in-class announcement of the unexpected expectance is followed by a brief moment of silence in the classroom as the phone call ends with no other scene exploration in the 2-second shot.",
        "summary_10": "TikTok video: Classroom rule reveals Ms. Nefco's pregnancy as April Fool.",
        "summary_25": "In the video, a TikTok classroom rule leads to a public pregnancy announcement for Ms. Nefco, with a proposed baby name, April Fool.",
        "summary_50": "The video showcases a TikTok scenario set in a classroom. A student's phone rings, and due to a rule, it is answered on speaker. The call reveals an unexpected news of a positive pregnancy test result for Ms. Nefco, leading to a surprised classroom. The suggested baby name is April Fool."
    },
    {
        "video_description": "The video begins with a woman lying in bed and presenting a box from KIOK LANEIGE, a beauty and skincare brand, and a pink box from Touchland. The scene switches to different shots of actions, such as a carton of milk being opened, a white packet being unfolded on a bed, and a paper bag being passed from one person to another. The video then presents some beauty products including a Lip Sleeping Mask, a skincare face cream, and a red lip balm from Laneige. Images of a woman holding various beauty products, applying lip balm, and using a toothbrush are interspersed with images of a smart sensor bracelet and other tech products. In one shot, the video shows a TikTok Comfort Pack with an orange and white sticker. As the video progresses, we see instances of different skincare items being applied, including a pink beauty stick called Lip Glowy Balm and Claireskin moisturizing eye gel. Towards the end, a product called Sweet Orange Bergamot + Aloe is introduced. The video's primary focus lies on skincare products and small technology devices, presenting these in a relaxed, domestic setting.",
        "summary_10": "Video displays woman introducing beauty products and tech at home.",
        "summary_25": "The video features a woman presenting KIOK LANEIGE and Touchland beauty products and tech devices in a cozy home setting.",
        "summary_50": "The video showcases a woman in bed introducing beauty products from KIOK LANEIGE and Touchland. Various beauty and skincare items, including Lip Sleeping Mask and Lip Glowy Balm, are displayed along with small tech devices. The primary focus is on a comfortable domestic presentation of skincare essentials.\n"
    },
    {
        "video_description": "The video is a cooking tutorial featuring multiple recipes related to strawberries. It starts with the display of the user @freyadish and ingredients like eggs and liquids being mixed in a bowl. The video swiftly moves through various recipes such as a strawberry and orange juice mixture, baking batter with cinnamon, flour and sugar, and a bowl of peanut butter with strawberries, etc. Other sequences include strawberry jam preparation, the creation of strawberry sugar, and integration of dry cake ingredients. More elaborate sequences involve the viewer in the process of preparing chocolate cupcakes and strawberry cheesecakes both in pastry cups and muffin form. All steps are visually demonstrated without verbal instruction. The video ends with a shot of kneaded, gluten-free raspberry muffins being made. It's a fast-paced visual recipe tour with a strong focus on dessert preparations involving strawberries.",
        "summary_10": "@freyadish's video is a quick, visual guide to strawberry desserts.\n",
        "summary_25": "The video is a fast-paced, visually-guided tutorial by @freyadish, demonstrating various steps to create strawberry-based desserts, ending with raspberry muffins.\n",
        "summary_50": "The video is a swift, visually detailed cooking tutorial by @freyadish, focusing on various strawberry-based recipes. Elements include mixing ingredients, creating strawberry jam, preparing batter, and assembling pastries like chocolate cupcakes and strawberry cheesecakes. The video ends with gluten-free raspberry muffin preparation."
    },
    {
        "video_description": "The short-form video primarily showcases cleaning methods for a kitchen sink, specifically a black kitchen sink, using various methods and products, with the username @_catben_ featured in the beginning. The video content includes several items being placed in the sink, and a myriad of cleaning procedures involving sponges, brushes, and a variety of soapy solutions. One of the unconventional tools employed is a rubber used to clear a trash can. Additionally, it displays the use of TikTok’s augmented reality feature that offers virtual utensils, and a refillable spray bottle from TikTok. The brand also introduces a new way to monitor water consumption, a smart water stopper and a black pull-down kitchen faucet, extending their line of innovative household items. As the video progresses, it transitions into a demonstration of an array of cleaning hacks shared on TikTok that encapsulates a plethora of cleaning strategies for sinks and general kitchenware. It concludes by introducing a new black quartz sink model, Tritak Black, compelling viewers to use their vivid range of sink cleaning solutions and cutting-edge kitchen accessories to facilitate a clean and organised kitchen.",
        "summary_10": "The video showcases @_catben_'s innovative methods for sink cleaning and new products.",
        "summary_25": "The video by @_catben_ demonstrates unique techniques and tools to clean a black kitchen sink, along with introducing TikTok's augmented reality utensils and Tritak Black sink.\n",
        "summary_50": "This video showcases various methods and products for cleaning a black kitchen sink by @_catben_. It includes unconventional tools, TikTok’s augmented reality utensils, a smart water stopper, and a black pull-down faucet. The video culminates with the introduction of a new black quartz sink model, Tritak Black."
    },
    {
        "video_description": "The short-form video is a compilation featuring a man and his antics with cucumbers. Throughout the video, the man in a red Nike tee is seen engaging with cucumbers in various ways. From holding up a giant cucumber, showcasing two bigger ones in front of his house, flexing muscles while holding two cucumbers, to finally giving a bowl of cucumbers to a chicken. Interspersed with these visuals, he also holds a large cucumber showcasing three distinct numbers, holds a bundle of green vegetables, and displays a bag emblazoned with the number 7. Interestingly, the video features a voice count from one to five, but the number four is strangely skipped. The video concludes with a chicken pecking at cucumbers from the ground, with the words, \"Follow for the next impossible challenge\" appearing on the screen. The entire video seems to be an entertaining, tongue-in-cheek promotion of cucumbers or possibly, a quirky gardening vlog. The video is fast-paced, lasting only a few seconds per shot. A TikTok watermark \"@scottsreality NIKE\" is visible in the first shot.",
        "summary_10": "Man humorously interacts with cucumbers on TikTok video, ending with challenge.",
        "summary_25": "A TikTok video features a man engaging with cucumbers humorously, including displaying them, flexing muscles, and feeding chickens, ending with a challenge.\n",
        "summary_50": "In this fast-paced TikTok video, a man in a red Nike tee humorously engages with cucumbers in various ways. From showcasing massive cucumbers, flexing muscles holding them, giving them to a chicken, to revealing numeric clues, the video culminates with the text, \"Follow for the next impossible challenge\"."
    },
    {
        "video_description": "This short-form video, with a duration of 30 seconds, features a man skillfully playing a guitar in a room. The video does not contain any audio dialogue, thus the focus is solely on the music produced by the guitarist. The identity of the guitarist is revealed through textual information displayed on screen, indicating that the man is Andre Carrier, known by the username @andrecarrier_ on TikTok. The man seems to be engrossed in his guitar playing, as he stares intently at the wall. This video likely serves as a showcase of Andre Carrier's musical talents on the digital platform.",
        "summary_10": "Video shows Andre Carrier's (@andrecarrier_ TikTok) 30-second guitar performance.",
        "summary_25": "The video presents Andre Carrier (@andrecarrier_ on TikTok) engrossed in a 30-second silent guitar performance, highlighting his musical skills.",
        "summary_50": "This 30-second video showcases Andre Carrier (@andrecarrier_ on TikTok) as he skillfully plays his guitar in a room. Engrossed in his performance, there's no dialogue - only music. The video underlines his musical prowess on the popular digital platform."
    },
    {
        "video_description": "The video features a musician sharing five songs that he considers should not be played on acoustic guitar. The video starts with him responding to a comment asking for a list of such songs. He then plays and mentions each song. The list includes the classic rock songs \"Iron Man,\" which he says is overplayed, especially at music shops like Guitar Center. The second song is \"Sweet Child O' Mine,\" which the musician finds unsuitable for acoustic. Third on his list is \"Sunshine of Your Love,\" followed by an AC/DC number which was actually originally performed on an electric guitar. Finally, the musician names 'the forbidden riff', a song initially played on acoustic but he believes shouldn't be. The video concludes with him playing his guitar while asking viewers to comment on any songs that he might have missed.",
        "summary_10": "Musician names five rock songs unsuitable for acoustic guitar play.\n",
        "summary_25": "A musician lists five rock songs, like \"Iron Man,\" that he deems inappropriate for acoustic guitar, concluding with a request for viewer suggestions.",
        "summary_50": "The video showcases a musician categorizing five classic rock songs, including \"Iron Man\" and \"Sweet Child O' Mine,\" as unsuitable for acoustic guitar. Concluding with an appeal for viewer input, the musician highlights the frequent misuse of acoustic guitar with originally electric songs.\n"
    },
    {
        "video_description": "The short-form video has a single shot with a duration of 124 seconds. It features a challenge to viewers to name all eight Disney songs in the video. There's no audio speech present, only text appearing on the screen providing the viewer with the challenge. An individual named @naluthepiaman is tagged implying he presented the challenge. The element of interactivity and fun is included with the mention of emoji hints. The visual shows the phrase \"Can you name all the Disney songs?\" indicating this is the main theme of the video.",
        "summary_10": "It's a silent, interactive 124-second video challenge to identify Disney songs.",
        "summary_25": "The video is a 124-second, silent interactive challenge by @naluthepiaman to recognize eight Disney songs, using on-screen text and emojis.",
        "summary_50": "This 124-second video is a silent challenge by @naluthepiaman for viewers to recognize eight Disney songs, through on-screen text and emoji hints. The video is interactive and focuses on viewer engagement while having a fun Disney theme."
    },
    {
        "video_description": "The video begins with a view of a table and a laptop displaying a group of people in a video call. This appears to be a scene from a TikTok video by Samuel Grubbs, as indicated by the on-screen text. The camera then switches to a close-up view of the laptop screen, where a speaker named Noah Weaver is instructing others in the call to move to slide 37, creating the impression of a work conference or meeting. However, the twist in the video is that all other participants in the video call have changed their names to \"Reconnecting...\", indicating a prank or joke, possibly as a part of an April Fools' day celebration. The video thus presents an interesting blend of formal work communication undermined by a light-hearted prank strategy.",
        "summary_10": "TikTok video by Samuel Grubbs features a humorous meeting prank.",
        "summary_25": "Samuel Grubbs' TikTok video showcases a prank where meeting participants change their names to \"Reconnecting…\", humorously disrupting a professional call.",
        "summary_50": "The video features a TikTok prank by Samuel Grubbs where participants in a video call change their names to \"Reconnecting…” during a professional meeting, creating a humorous contrast between serious work communication and lighthearted tomfoolery.\n"
    },
    {
        "video_description": "The video is about a woman, identified as @ladominiqueen, who has been frequently requested by her followers to sing a song. When the video starts, she is seen posting a tweet from another user which implies a high demand for her rendition of a TikTok song. As she talks to her viewers, she shares that she's just off the plane and decided to finally acquiesce to her viewers' requests. The song she sings talks about challenging times where she mentions about washing her hands and her inability to swim despite hope being in the waters. She expresses her challenging journey where she didn't have the chance to rise. The woman's emotions and sincerity reflect in her voice captivating the viewers.",
        "summary_10": "@ladominiqueen performs an evocative song about struggles and hope.\n",
        "summary_25": "The video shows @ladominiqueen succumbing to popular demand and singing a poignant song about hardships and hope, deeply engaging the viewers.",
        "summary_50": "The video features @ladominiqueen, who has been heavily requested to sing a song. Responding to the demand, she sings a heartfelt piece discussing hardships and hope. The profound emotions and sincerity in her performance captivate viewers.\n"
    },
    {
        "video_description": "The video is a 39 second clip, which appears to be a reply to a comment by user C.203 on the TikTok platform. The video is posted by the user @howdyhales. The video features an older girl who stands in front of a garage door. In the audio of the video, the girl is heard saying \"this is very hard but I track just if I were you.\"",
        "summary_10": "@howdyhales' TikTok replies to C.203, showing a girl with life advice.",
        "summary_25": "This 39-second TikTok by @howdyhales is a reply to C.203, featuring a girl by a garage saying, \"this is very hard but I track just if I were you.\"",
        "summary_50": "The 39-second TikTok video by @howdyhales is a response to user C.203's comment. It features an older girl near a garage door, saying, \"this is very hard but I track just if I were you.\""
    },
    {
        "video_description": "The video seems to belong to a Tik Tok account named Bakedbymelissa, where the user is demonstrating a recipe using zucchini as the primary ingredient. The video begins with a cucumber and transitions into showing a vegetable cutter being used. As the video progresses, the user discusses coming up with the recipe, which includes shredding zucchini and removing moisture using a cheesecloth. The user also mentions sauteeing a large red onion, though the duration and sequence are not clear. Following this, ingredients such as garlic, eggs, parsley, cheese, and chives are added and mixed, and seasoned with salt and pepper. Also featured in the video are people sampling green smoothies or juices, presumably made from similar vegetable ingredients. The end product appears to be a sort of zucchini and cheese casserole or tart that is baked in an oven set at 375 degrees. Throughout the video, various people are shown consuming and appreciating the finished product.",
        "summary_10": "Bakedbymelissa shows a zucchini recipe, resulting in a baked casserole.\n",
        "summary_25": "TikTok's Bakedbymelissa demonstrates a zucchini recipe involving shredded zucchini, sautéed onions, and various ingredients. The result is a baked zucchini-cheese casserole.",
        "summary_50": "The video, from TikTok user Bakedbymelissa, presents a zucchini-based recipe. Key processes include shredding zucchini, sautéing onions, and incorporating ingredients like garlic, eggs, parsley, cheese, and chives. The final product, a zucchini and cheese casserole, is baked at 375 degrees and enjoyed by various individuals.\n"
    },
    {
        "video_description": "The video is a tutorial uploading by the TikTok account @herbifoods, demonstrating how to make vegan mozzarella. The video begins with a shot showing a plate that has tomatoes, basil, and cheese. Then, a man is seen holding a fork that has some vegan mozzarella on it. This is followed by a quick shot of a person holding a spoon with a piece of food, and then cuts to another man staring at his plate of food. The ingredients for the vegan mozzarella are shown next: cashews, soy yogurt, nutritional yeast, tapioca starch, miso paste, and salt. These ingredients are blended together. The video continues by instructing to add water and Agar agar into the blend and bring it to a boil. The mixture is then cooked until it thickens, resembling the consistency of ricotta cheese. The video then shows the thickened mix being scooped into a bowl containing cold water. A man is shown forming and squeezing the mixture into the shape of a ball, simulating the characteristic shape of mozzarella cheese. The final few seconds of the video showcase the finished vegan mozzarella being aesthetically spread over a plate of tomatoes.",
        "summary_10": "TikTok's @herbifoods demonstrates creating and serving vegan mozzarella.",
        "summary_25": "The video by @herbifoods on TikTok shows how to make vegan mozzarella using various ingredients, cooking, molding, and serving it.\n",
        "summary_50": "The video by TikTok user @herbifoods demonstrates making vegan mozzarella. The process involves blending different ingredients like cashews, soy yogurt, nutritional yeast, tapioca starch, miso paste, and salt, cooking until it thickens, molding into balls, and serving on a plate of tomatoes."
    },
    {
        "video_description": "The video is a culinary tutorial for \"Tato Corn Chow\", shared by the TikTok user @quincylk. The recipe involves various ingredients, including 1/2 onion, 1 carrot, 1 celery stalk, and 5 potatoes. The video starts with a shot of the finished Corn Chow soup. It then transitions to the various steps of chopping the onions, carrots, and celery, performed on a wooden cutting board with a chef knife. Then, the video demonstrates the process of mixing the batter in a pot, adding butter and flour, and setting the stove to medium heat. The instructions involve adding cream of chicken to the mixture, followed by stirring and adding cheese into the pot. A key step highlighted is cooking the soup on medium-high until the potatoes are tender. The final shot showcases the ready-to-serve bowl of Tato Corn Chow soup accompanied by bread at a dining table.",
        "summary_10": "TikTok's @quincylk demonstrates making 'Tato Corn Chow' soup, from prep to cooking.",
        "summary_25": "The video by TikTok's @quincylk shows how to make 'Tato Corn Chow' soup, involving vegetable prep, batter-making with chicken cream and cheese, and cooking till potatoes soften.\n",
        "summary_50": "The video is a step-by-step cooking tutorial by TikTok user @quincylk, demonstrating how to make 'Tato Corn Chow' soup. The process involves chopping vegetables, preparing a batter with cream of chicken and cheese, and cooking the mixture until potatoes are tender. Ends with a served bowl of soup."
    },
    {
        "video_description": "The video is a brief, 15-second clip primarily focusing on an orange cat positioned in front of a person's sock. No verbal audio is present in the video, but there's a display of text highlighting the TikTok handles '@leeting2021' twice. The central theme seems to revolve around the cat's antics or the interaction between the pet cat and the person, which draws viewer's attention towards the TikTok account named 'leeting2021'.",
        "summary_10": "15-second TikTok video features an orange cat and '@leeting2021' promotion.",
        "summary_25": "The 15-second video displays an orange cat by a sock, with text promoting '@leeting2021' on TikTok. The cat's antics form the main highlight.",
        "summary_50": "The video is a 15-second clip featuring an orange cat near a person's sock. The absence of verbal audio is compensated by a text overlay promoting the TikTok handle '@leeting2021'. The cat's antics or interaction with the person forms the video's focal point."
    },
    {
        "video_description": "The short video opens with a woman holding a blue parrot in her arm. Over the duration of 35 seconds, a text conversation is displayed on the screen, suggesting an exchange between two users, '@tamaranovaa' and '@tamaranoyaa'. The conversation text essentially includes playful and affectionate words that seem to be directed towards a pet, hinting that the woman may possibly be talking to her parrot. During the clip, the woman's dialogue includes, \"Thank you. Kevin can I can I get a boop?\" The tone suggests a loving interaction between the woman and her pet parrot, further elaborating the bond they share.\n",
        "summary_10": "Video depicts woman's unique bond with blue parrot through interaction.",
        "summary_25": "The video illustrates a woman's playful interaction and unique bond with her blue parrot, as highlighted by an on-screen text conversation.\n",
        "summary_50": "The video features a woman affectionately interacting with her blue parrot. A text conversation between '@tamaranovaa' and '@tamaranoyaa' overlays the video, implying a playful interaction with the bird, with the woman even asking it for a 'boop’. It showcases the unique bond between them.\n"
    },
    {
        "video_description": "The short video starts with a man looking directly into the camera while a text overlay identifies the video as a TikTok by @ohnolivia_. The onscreen caption humorously suggests a dialogue between a shelter and the protagonist, in which the assumed reply from the man is an unconditional acceptance of a straw-stealing cat. The second shot shifts the scene to the mentioned cat on a bed, interacting with a drink, while there is an unrelated affectionate voice over stating \"You're my best friend, you can come back\". The video showcases a humorous yet endearing relationship between the protagonist and his cat.",
        "summary_10": "TikTok by @ohnolivia_ shows man's acceptance of straw-stealing cat.",
        "summary_25": "In this humorous TikTok by @ohnolivia_, a man warmly accepts a straw-stealing cat from a shelter, underscored by a loving voice-over.",
        "summary_50": "The video, a TikTok by @ohnolivia_, humorously showcases a man's welcoming acceptance of a straw-stealing cat from a shelter. The clip transitions to the cat on a bed, interacting with a drink, as a loving voice-over reaffirms their bond."
    },
    {
        "video_description": "The video starts with a shot of a cat sitting in an office with a plate of food. The screen displays the text \"@crystalbessmer Veterinary staff: Try not to touch everything\" and the audio transcript notes someone saying, \"Don't put people through.\" In the next shot, the same cat can be seen attempting to climb into a cage, though there is no accompanying audio or text. The third shot transitions to another setting where the cat is absorbed in a scene, seemingly focused on something inside a cage. The audio captures a voice mentioning \"the barn.\" The fourth shot shows the cat standing next to a cage filled with chickens with a voice referencing \"a car game\", but no on-screen text. The video concludes with a shot of two cats sitting on top of a box under the label 'SHOR LINE', again with no spoken words or textual content. The video appears to center around interactions between cats and their surroundings, potentially within a veterinary or barn setting.",
        "summary_10": "The video shows cats interact in an office-barn, implying a veterinary context.",
        "summary_25": "The video portrays cats interacting within a blended office-barn environment, including scenes with cages, chickens, and a 'SHOR LINE' box, suggesting a veterinary setting.",
        "summary_50": "The video features cats within an office-cum-barn setting. Beginning with a cat beside food, the narrative shifts through shots of cats attempting cage interaction, observing chickens, and finally perched atop a 'SHOR LINE' box. Throughout the scenes, the minimal spoken and screen text underscores a vetinary ambiance.\n"
    },
    {
        "video_description": "The video is a short, 6-second clip posted on TikTok by the user @foxredjax. The video features a dog lying on a bed while a person stares at it. The text across the video screen hints at a scenario where the dog wanted to go into a store to choose a new plush toy but was deterred by the barking of other dogs. Notably, no words are spoken throughout the video; the storyline is conveyed within the text overlay and through the visual portion of the video.",
        "summary_10": "TikTok by @foxredjax shows dog deterred from toy due to barks.\n",
        "summary_25": "This short TikTok clip by @foxredjax features a dog deterred from picking a toy at the store due to barking dogs, as narrated by on-screen text.\n",
        "summary_50": "The 6-second TikTok video by @foxredjax shows a dog lying on a bed while a human watches. The on-screen text narrates an incident where the dog was scared off by other barking dogs at a store, preventing it from choosing a new toy.\n"
    },
    {
        "video_description": "The short video is a quick TikTok recipe tutorial by @whatmollymade on making gluten-free and dairy-free s'mores cookie bars. The recipe starts by pressing packs of cookie dough into an even layer in a baking dish. This is followed by sprinkling chocolate chips on top. After the chocolate chips, a layer of crushed graham crackers and marshmallow fluff is added. Finally, the entire dish is topped off with another layer of cookies. Once complete, the dish is baked for approximately 25 to 30 minutes. The video provides visual cues to the audience by showing a whole process from the mixing of the ingredients to final product. The s'mores cookie bars recipe is touted as an easy summer dessert with only four ingredients. Various brands and types of gluten-free and dairy-free products are displayed throughout the video.",
        "summary_10": "TikTok video by @whatmollymade shows easy gluten-free s'mores bar recipe.",
        "summary_25": "The TikTok tutorial by @whatmollymade provides a step-by-step guide to making easy, gluten-free, dairy-free s'mores cookie bars, highlighting various product brands.",
        "summary_50": "The TikTok video by @whatmollymade is a quick tutorial on making gluten-free, dairy-free s'mores cookie bars. It guides viewers through the simple layering process then baking, making it an easy and healthy summer dessert option. Various gluten-free and dairy-free product brands are displayed throughout.\n"
    },
    {
        "video_description": "The video is a step-by-step tutorial by TikTok user @spoonfulofsi about preparing Strawberry Tiramisu. It begins with brief text overlays mentioning the dish name. The first steps include mixing strawberry preserves and orange juice. Next, the whipping cream is added into a mixing bowl, along with powdered sugar and vanilla. After that, the whipped cream is combined with mascarpone cheese, and it's all thoroughly mixed together. The assembly process is shown next. Ladyfingers are carefully dipped and layered, and then generously covered with the cream filling. A layer of strawberry slices is added afterwards. These steps are repeated until the dish is assembled to the required height. The dessert is then covered and placed in the refrigerator overnight. Prior to serving, freshly sliced strawberries are arranged on the top as the final touch. The end of the video shows the plated scrumptious dessert ready to be savored.",
        "summary_10": "The video outlines @spoonfulofsi's complete process of making Strawberry Tiramisu.\n",
        "summary_25": "The video with TikTok user @spoonfulofsi presents a step-by-step guide for creating Strawberry Tiramisu, explaining ingredient mixing, layering, overnight refrigeration, and final garnishing.\n",
        "summary_50": "The video features TikTok user @spoonfulofsi demonstrating how to prepare Strawberry Tiramisu. The tutorial guides viewers through the ingredients, mixing process, and proper assembly, including layers of ladyfingers, mascarpone cream, and strawberries. The dish is refrigerated overnight and garnished with fresh strawberries before serving."
    },
    {
        "video_description": "The video begins with a bearded man asking a cashier at a fast food restaurant if he could get a cookie since he lost his wallet and was very hungry. The cashier's empathetic response was to let the man have his meal, which brightened up the bearded man's day. The cashier who identified himself as Zack mentioned that making someone's day was part of his job. The bearded man reveals that he doesn't need the cookie and instead, he had a surprise for the first kind person he met. He then presents Zack with a stay at a five-star hotel. The bearded man expresses his appreciation to Zack, saying his wife who is a nurse and has been working tirelessly, could now benefit from this treat. Later on, he surprises Zack yet again by pulling out his wallet, which he claimed he had lost earlier, and showing him $1000 in cash. Zack was very touched and said he would use it to help pay off the medical bills for his newborn nephew in the Philippines who had a difficult birth and was facing a big medical bill. They share a heartfelt moment at the end, expressing their love for each other.",
        "summary_10": "Man rewards kind cashier with hotel stay and $1000 cash.",
        "summary_25": "A man tests a cashier's kindness, rewarding it with a hotel stay and $1000. The cashier, Zack, plans to use the money for his nephew's medical bills.",
        "summary_50": "A man pretends to lose his wallet to test the kindness of a fast-food cashier, Zack. Zack feeds the man, so the man rewards him with a five-star hotel stay and $1000 cash. Zack plans to use the money for his nephew's medical bills in the Philippines."
    },
    {
        "video_description": "The video is a heartwarming story of a daughter surprising her mother for her birthday. The video opens with a daughter in a green dress dancing in front of a Christmas tree, revealing through overlaid text that they surprised their mother with matching outfits. The scene then shifts to two women talking in a room, where the daughter narrates how she duped her mother into wearing the matching dress, making her believe it was an accidental mix-up. As excitement builds up, they present her with her own green dress, and the mother seems initially upset. However, in a delightful twist, the mother not only accepts the matchy-matchy present but also embraces it fully. Scenes of the mother and daughter joyfully dancing and taking selfies in their green sequin dresses fill the rest of the video as the fun implications of the 'spoiler alert' text become apparent. The video concludes with a group shot of three women celebrating, all donned in the same green sequin dress, illustrating a successful and enjoyable birthday surprise.",
        "summary_10": "Daughter surprises mother with matching dresses; they celebrate joyfully.\n",
        "summary_25": "In the video, a daughter surprises her mother with matching green dresses for her birthday, leading to joyful celebrations, selfies, and dancing.",
        "summary_50": "A daughter surprises her mother with matching green dresses on her birthday. Initially perplexed, the mother fully embraces the present, and they joyfully celebrate, taking selfies and dancing in their matching outfits. The video concludes with a delightful scene of celebration in their sequin dresses."
    },
    {
        "video_description": "The video starts with a shot lasting for 32 seconds featuring three young individuals. They are seen dancing in what appears to be an art class and the text displayed on screen is the users' profile handles - @haile.ferrier, @haileferrier, and @haile ferrier Tik Tok ec 2999 lege 999. The audio playing in the background includes comments about someone not being as attractive as expected due to his wildly eccentric wardrobe, particularly the pink shoelaces on his regular shoes and his hat band that sports a bold purple shade. The dialogue hints at an intriguing, possibly flamboyant character, who is yet to appear in the video.",
        "summary_10": "Video features three dancing youngsters; audio hints at unseen character.",
        "summary_25": "The video shows three youngsters dancing in an art class for 32 seconds. Audio commentary hints at an intriguing yet unseen character.\n",
        "summary_50": "In the 32-second video, three youngsters are seen dancing in an art class. Their profile handles are displayed on-screen. The audio suggests an unattractive yet unique character, with pink shoelaces and a purple hat, possibly hinting to a flamboyant personality yet to appear in further shots."
    },
    {
        "video_description": "The video is a step-by-step tutorial by a TikTok user @andcarli on how to add a paint-dyed design to a t-shirt. It opens with an image of a pile of spaghetti-like straws juxtaposed against a backdrop of a blank t-shirt. Then, it transitions into a series of shots showing a man meticulously adding paint to the t-shirt. The design consists of a creative spiral contour that is strikingly colored in black and pink hues. At several points, the video shows a close shot of the man's hands as he goes about painting the intricate pattern on the shirt. The video then continues the tutorial showing techniques on how to create similar designs using different colors, like a red and black spiral pattern. At the end of the video, the man sips a red drink, possibly to emphasize the relaxing and enjoyable aspect of the activity. Throughout the tutorial, no speech is present but text does appear occasionally including user identifier and other texts such as 'Super Cl Super Col' and 'Andcarli 11 12 12 Part 2 11'. The video, serving as a t-shirt painting tutorial, utilizes TikTok to deliver valuable instructions and insights on DIY shirt dyeing.",
        "summary_10": "The TikTok video by @andcarli is a DIY t-shirt painting guide.\n",
        "summary_25": "The video is a relaxing TikTok DIY tutorial by @andcarli on creating a spiral design on a t-shirt using various painting techniques.\n",
        "summary_50": "The TikTok video by @andcarli is a DIY t-shirt painting tutorial showcasing how to create a black and pink spiral design. The guide progresses through each step, highlighting detailed painting methods, including techniques for designing using different colors. The activity is presented as relaxing and enjoyable."
    },
    {
        "video_description": "The video is a 45-second clip set in Gayle's Broadway Rose, a popular restaurant in New York City. The video spotlights a singing server who is also acquainted with the TikTok platform. Illustrated on the screen during the video is text that includes the eatery's name, a mention of its singing servers, and various iterations of the phrase, 'We don't talk about Bruno'. Unfortunately, the audio transcript is missing, but the visual description informs us that a man is seen talking in the restaurant. This video is essentially a short glimpse into the unique, interactive atmosphere at Gayle's Broadway Rose, where the staff enhances the dining experience by incorporating elements of social media trends.",
        "summary_10": "Video: singing server at NYC's Gayle's Broadway Rose references TikTok trends.",
        "summary_25": "The video shows a singing server at NYC's Gayle's Broadway Rose, integrating social media trends like the phrase 'We don't talk about Bruno'.\n",
        "summary_50": "The 45-second video features a singing server at Gayle's Broadway Rose, a well-known NYC restaurant. Text on screen references a trendy phrase 'We don't talk about Bruno' and the man talking in the restaurant suggests a vibrant interactive environment influenced by social media trends."
    },
    {
        "video_description": "The video starts with a man who proudly declares his newfound love for humidifiers and gives a shoutout to a specific smart humidifier. The video then transitions between various scenes of him showcasing a small mushroom-shaped humidifier with a cloud-shaped top which emits a bright, color-changing light. He mentions that the humidifier can change colors and is highly customizable, allowing users to select their preferred light color. Further, the man appreciates that the device comes pre-assembled for ease of use, pointing out this feature would be particularly beneficial for people who may struggle with setting up such devices. He also mentions that the humidifier allows users to modify the mist/stream and that it supports essential oils, functioning as a diffuser as well. The man ends the video proclaiming his obsession with the humidifier, suggesting it has become a significant part of his life and personality. The overall video appears to be a fun, informal review or commentary on the product.",
        "summary_10": "Man humorously reviews a versatile, color-changing humidifier, showing obsession.",
        "summary_25": "A man comedically reviews a customizable, pre-assembled, color-changing humidifier that also serves as a diffuser, expressing his newfound obsession with it.",
        "summary_50": "The video features a man humorously reviewing a smart, color-changing humidifier. He mentions its customizable features, the fact it comes pre-assembled, and its ability to function as a diffuser. He concludes by asserting his newfound obsession with the product.\n"
    },
    {
        "video_description": "The video is a brief, 26-second educational piece on basic Italian phrases. The presenter, a woman, displays several Italian greetings and phrases on her screen throughout the runtime. Some of the phrases she demonstrates include 'A Presto' (See You Soon), 'A Domani' (See You Tomorrow), 'Buon Viaggio' (Have a Good Trip), 'Buon Divertimento' (Have Fun), 'I Migliori Auguri' (Best Wishes), and 'In Bocca Al Lupo' (Good Luck). Additionally, she provides a vocal pronunciation for each phrase, helping the viewer with the correct pronunciation. The video serves as an instructive tool for those interested in learning and mastering fundamental Italian phrases and greetings.\n",
        "summary_10": "Woman provides short tutorial on basic Italian phrases and pronunciation.",
        "summary_25": "In this brief video, a woman teaches basic Italian phrases and their pronunciations, serving as a strategic tool for language learners.",
        "summary_50": "In a 26-second video, a woman instructs on basic Italian phrases like 'A Presto', 'A Domani', 'Buon Viaggio', among others. She additionally offers spoken pronunciations for each phrase. This video is an enlightening resource for mastering fundamental Italian greetings.\n"
    },
    {
        "video_description": "The video is a humorous and heartwarming clip lasting 33 seconds. It centers around a toddler standing by the door, seemingly requesting something from his parents. The screen repeatedly displays varying text saying \"Dad wasn't messing around\", indicating that the father is engaging with his child in a playful but instructive manner. This is reinforced by the audio transcript where the father is heard encouraging the toddler to apologize, presumably to his brother, and give him a hug as a form of reconciliation. The video is a showcase of a light-hearted and wholesome interaction within a family dynamic.",
        "summary_10": "The video humorously shows a dad teaching his toddler reconciliation.\n",
        "summary_25": "The video humorously portrays a dad teaching his toddler about reconciliation through playful interaction and apologizing, underlining a healthy family dynamic.",
        "summary_50": "The 33-second family video humorously captures a parent teaching his toddler about apologizing and reconciling, demonstrated via a potential scenario with his sibling. The text onscreen further emphasizes the dad's assertive, but playful approach to child-rearing. The video embodies a light-hearted and wholesome family dynamic."
    },
    {
        "video_description": "The short video is a humorous clip about a dog accidentally escaping their house during the early hours of the morning. The clip lasts for 9 seconds and is presented with a text on screen detailing the events, \"My dog got out at 4:AM and rang the doorbell\". A user identified as 'dreamyiscuming' on TikTok is also credited on the screen text. The video features the dog accidentally knocking its head against the doorbell, apparently in an attempt to get back into the house. There is no audio or spoken dialogue throughout the clip, focusing entirely on the visual humor of the situation.",
        "summary_10": "'Dreamyiscuming' TikTok shows dog humorously ringing doorbell after escape.\n",
        "summary_25": "A 9-second TikTok by 'dreamyiscuming' comically shows a dog ringing the doorbell with her head after accidentally escaping the house.",
        "summary_50": "In a 9-second humorous TikTok video, a dog gets out of the house and accidentally rings the doorbell with her head, attempting to re-enter. Creator 'dreamyiscuming' shares this comedic moment with no spoken dialogue, letting the visual humor tell the story."
    },
    {
        "video_description": "The video is a series of shots revolving around the purchase, sale and trading of sneakers, which takes place within a convention setting. It begins with a man opening a Nike box and discussing whether the shoes are new or used. Visitors are then shown discussing prices for the various shoes, with examples of haggling and assessing the value of the items based on their condition, brand, and scuffs being prevalent. As attendees haggle over prices, it is clear that the condition of the shoes and their rarity are primary factors in determining their value. Many shots feature different types of shoe models varying from Nike to Adobe Dunks. Interestingly, trade options are considered as an alternative to selling. Moments of decision making and negotiation about the price of sneakers underscore the video's theme. The video ends with a discussion about a pair of shoes referred to as \"these\", which the speaker would buy lower than the discussed price. Finally, he comments that the resale price would be around $112. Overall, the video captures the dynamics of shoe-trading conventions.",
        "summary_10": "Video shows sneaker trading at a convention, ending in haggling.",
        "summary_25": "The video illustrates a sneaker convention, highlighting haggling based on shoe condition and rarity. The final discussion points to a lower-than-expected purchase and $112 resale.",
        "summary_50": "The video captures a convention scene revolving around buying, selling, and trading sneakers. It underscores haggling over prices based on shoes' condition and rarity, also considering trade options. Featuring multiple shoe models, the video ends with a potential purchase below the discussed price and a resale value of $112."
    },
    {
        "video_description": "The video runs for a total of six seconds and is a short clip from TikTok user @dawsonaro. The video begins with a car driving through a scenic route surrounded by trees and hills, and the on-screen text introduces the location as DRURY LN. The audio features a voice expressing surprise amongst the ambient noise of the driving car. The second shot, lasting four seconds, focuses on a road sign clearly showing the name 'DRURY LN', reiterating the location. However, there's no accompanying text or audio in this particular shot.",
        "summary_10": "Six-second TikTok by @Dawsonaro highlights car ride on DRURY LN.",
        "summary_25": "@Dawsonaro’s six-second TikTok features a car journey at DRURY LN, starting with energized commentary and closing on a silent road sign.",
        "summary_50": "This six-second TikTok video by @dawsonaro shows a car driving down a scenic route at DRURY LN. It starts with excited audio commentary, followed by a silent shot of the 'DRURY LN' road sign."
    },
    [
        {
            "start": 0,
            "end": 14.033333333333333,
            "text_on_screen": "@brycehamilton_3 My dad slipped into the pool on a conference call and kept talking TikTok My dad slipped into the pool ona Tik Tok TikTo @funny123us",
            "per_shot_summaries": "\"The first shot lasts for 14 seconds and shows a dad unintentionally slipping into a pool while being on a conference call. The accompanying audio indicates someone stating that they're home.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 6.84017,
            "text_on_screen": "pov u passed the test but can't park TikTok @evangelinajade WARM pov u passed the test but-",
            "per_shot_summaries": "\"Shot 1: For 7 seconds, we see a girl drive a car and there are words appearing on the screen indicating a point of view scenario where someone has passed a test. The audio content reveals a voice saying, 'I think it to you should know.'"
        },
        {
            "start": 6.84017,
            "end": 8.14147,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: This 1-second shot shows a scene symbolizing the aftermath of passing the parking test, although actual parking seems to be a challenge."
        },
        {
            "start": 8.14147,
            "end": 8.90891,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: Lasting for 1 second, the shot centers on a woman standing in front of a white car."
        },
        {
            "start": 8.90891,
            "end": 9.44278,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: The scene, spanning 1 second, showcases a car parked near a sidewalk, with an impression that the parking wasn't successful."
        },
        {
            "start": 9.44278,
            "end": 10.343677010343677,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: This 1-second shot gives a visual hint that although the car is parked, correctly parking it seems to be a problem.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 0.05,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "\"A person is shown using a green plastic machine to make a cake."
        },
        {
            "start": 0.05,
            "end": 0.666667,
            "text_on_screen": "@shein official",
            "per_shot_summaries": "A green smoothie machine with a plastic spoon attached is presented."
        },
        {
            "start": 0.666667,
            "end": 1.25,
            "text_on_screen": "",
            "per_shot_summaries": "The shot focuses on a woman's hands holding a small green box with holes."
        },
        {
            "start": 1.25,
            "end": 1.9,
            "text_on_screen": "",
            "per_shot_summaries": "The scene showcases a kawaii pencil holder pencil sharpener in green color."
        },
        {
            "start": 1.9,
            "end": 2.26667,
            "text_on_screen": "",
            "per_shot_summaries": "A person is viewed placing a toothbrush into a holder."
        },
        {
            "start": 2.26667,
            "end": 2.63333,
            "text_on_screen": "",
            "per_shot_summaries": "Green tongs with white plates are displayed on a white counter."
        },
        {
            "start": 2.63333,
            "end": 3.48333,
            "text_on_screen": "",
            "per_shot_summaries": "A person is shown slicing an apple with a machine."
        },
        {
            "start": 3.48333,
            "end": 5.6,
            "text_on_screen": "@shein_official",
            "per_shot_summaries": "An individual is trying to use an apple peeler with a fruit."
        },
        {
            "start": 5.6,
            "end": 6.41667,
            "text_on_screen": "",
            "per_shot_summaries": "Someone is seen using an apple peeler with red strips in front of them."
        },
        {
            "start": 6.41667,
            "end": 8.03333,
            "text_on_screen": "",
            "per_shot_summaries": "A shot illustrates someone holding a 3D printed red apple."
        },
        {
            "start": 8.03333,
            "end": 9.1,
            "text_on_screen": "",
            "per_shot_summaries": "An apple slicer is presented."
        },
        {
            "start": 9.1,
            "end": 11.65,
            "text_on_screen": "",
            "per_shot_summaries": "A review of a TikTok apple slicer and peeler is shown."
        },
        {
            "start": 11.65,
            "end": 11.9833,
            "text_on_screen": "",
            "per_shot_summaries": "The video highlights a woman using an onion slicer."
        },
        {
            "start": 11.9833,
            "end": 12.8833,
            "text_on_screen": "",
            "per_shot_summaries": "A person is seen peeling an apple with a slicer."
        },
        {
            "start": 12.8833,
            "end": 13.65,
            "text_on_screen": "",
            "per_shot_summaries": "A shot focuses on a person with a pink apple being cut on top of a glass tray."
        },
        {
            "start": 13.65,
            "end": 14.5167,
            "text_on_screen": "",
            "per_shot_summaries": "A person is depicted cutting an apple using a green apple cutter."
        },
        {
            "start": 14.5167,
            "end": 15.3167,
            "text_on_screen": "",
            "per_shot_summaries": "The shot presents an apple corer made out of plastic."
        },
        {
            "start": 15.3167,
            "end": 15.7833,
            "text_on_screen": "",
            "per_shot_summaries": "An apple slicer is being used to cut apple slices."
        },
        {
            "start": 15.7833,
            "end": 16.6833,
            "text_on_screen": "",
            "per_shot_summaries": "A shot of a person cutting an apple into slices with a knife is shown."
        },
        {
            "start": 16.6833,
            "end": 17.25,
            "text_on_screen": "",
            "per_shot_summaries": "A hand is shown putting a pink ball onto a glass baking sheet."
        },
        {
            "start": 17.25,
            "end": 18.4667,
            "text_on_screen": "",
            "per_shot_summaries": "The video features a person cutting a red tomato in a plastic cutter."
        },
        {
            "start": 18.4667,
            "end": 19.2333,
            "text_on_screen": "",
            "per_shot_summaries": "The scene includes a tomato slicer being used to slice a tomato."
        },
        {
            "start": 19.2333,
            "end": 20.383333333333333,
            "text_on_screen": "",
            "per_shot_summaries": "The final shot shows tomatoes being placed on a green vegetable peeler.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 8.37504,
            "text_on_screen": "70s HAIR @hairbyamela",
            "per_shot_summaries": "\"Shot 1: The opening shot presents us with the text '70s Hair @hairbyamela', suggesting this is taking place in a 70's hair salon in Delhi."
        },
        {
            "start": 8.37504,
            "end": 17.017,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: This scene shows the use of black hair color on a person's hair, in what could be a display or tutorial of a hair styling process."
        },
        {
            "start": 17.017,
            "end": 25.292,
            "text_on_screen": "M Had tiktok",
            "per_shot_summaries": "Shot 3: A woman is seen getting her hair dyed black in this scene."
        },
        {
            "start": 25.292,
            "end": 30.2302,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: In this short five-second shot, we’re presented with a scene that appears to have a 70's hairstyle for women being displayed or worked on by someone potentially named Raja Raju."
        },
        {
            "start": 30.2302,
            "end": 39.9733,
            "text_on_screen": "GM r Studi Hair Su Hair Stu tudio",
            "per_shot_summaries": "Shot 5: This 10-second shot features something related to a salon called '70', possibly a promotional offer of free hair treatment."
        },
        {
            "start": 39.9733,
            "end": 43.7771,
            "text_on_screen": "Hair Stucio",
            "per_shot_summaries": "Shot 6: This brief cut displays a scene set in the '70s hair style' concept, located at a Bollywood salon in Delhi."
        },
        {
            "start": 43.7771,
            "end": 53.0864,
            "text_on_screen": "MG Hair Stuc@babyamela",
            "per_shot_summaries": "Shot 7: Here we move to Chennai, with a focus on MG salon, one of the best hair salons there."
        },
        {
            "start": 53.0864,
            "end": 55.5222,
            "text_on_screen": "M G @hairbyamela",
            "per_shot_summaries": "Shot 8: This 2-second shot gives a glimpse of a black and white image of a woman standing in front of her hair dryer."
        },
        {
            "start": 55.5222,
            "end": 62.0621,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: This scene brings forward some long hairstyle ideas for women inspired by the 70's."
        },
        {
            "start": 62.0621,
            "end": 64.7313980647314,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: The last shot reveals the back of a woman's head, showing off her gray hair, possibly another hairstyle being showcased.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 14.866666666666667,
            "text_on_screen": "@www.02mrn @",
            "per_shot_summaries": "\"Shot 1 is a 15-second scene showcasing two women dancing in a parking lot. Audio reveals a voice uttering 'I told myself.'.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 12.2333,
            "text_on_screen": "blindfolding ourselves to see if we dance the same Tik Tok @joshandsav TikTok",
            "per_shot_summaries": "\"Shot 1: This 12-second shot shows two people wearing blindfolds in a room. They discuss various topics while being blindfolded which includes love, cycling, and reminiscing."
        },
        {
            "start": 12.2333,
            "end": 13.5333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: In this brief, one-second shot, a woman is observed smiling into a mirror while wearing a visor. There is no accompanying audio or text."
        },
        {
            "start": 13.5333,
            "end": 18.8667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: The third shot, lasting for 5 seconds, features a TV show video. The characters in the show are blindfolding themselves one at a time. No on-screen text or audio is present throughout the duration of this shot."
        },
        {
            "start": 18.8667,
            "end": 19.8667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: This one-second shot captures a moment where two people are observing each other in a mirror. The shot omits any audio or text."
        },
        {
            "start": 19.8667,
            "end": 23.233333333333334,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: The 3-second fifth shot focuses on a man and a woman who are part of the new Hawaiian Terek campaign. No on-screen text or audio accompanies this visual.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 3.375,
            "text_on_screen": "TikTok @akerzypcs this might be the best smartphone N30 that 300 dollars can buy in 2023",
            "per_shot_summaries": "\"SHOT 1: A smart-phone is showcased, possibly the best within $300 range for the year 2023, as stipulated through on-screen text and audio."
        },
        {
            "start": 3.375,
            "end": 3.45833,
            "text_on_screen": "",
            "per_shot_summaries": "SHOT 2: There's a query about when a new phone will be launched, it's unclear as it cuts off abruptly."
        },
        {
            "start": 3.45833,
            "end": 7.83333,
            "text_on_screen": "so OnePlus just released their new and I",
            "per_shot_summaries": "SHOT 3: The new OnePlus smartphone, costing $300, is introduced, with the text and transcript both noting that the specs are supposed to be immaculate."
        },
        {
            "start": 7.83333,
            "end": 8.91667,
            "text_on_screen": "but let's TikTok see for",
            "per_shot_summaries": "SHOT 4: The introduction builds suspense as the man on screen suggests they will check out the features of the new OnePlus phone, the N30."
        },
        {
            "start": 8.91667,
            "end": 17.8333,
            "text_on_screen": "Irving the N30 TikTok the N30 Tik Tok has a 11:34 Demo Phone 120hz OnePlus Nord N30 6.72 inch with 8gb of ram 128gb",
            "per_shot_summaries": "SHOT 5: The high-end specs of the new OnePlus N30 are enumerated, including a camera with 108 megapixels, 120hz screen, 8 gigabytes of RAM and 128 gigabytes of storage."
        },
        {
            "start": 17.8333,
            "end": 26.1667,
            "text_on_screen": "pretty good you're getting",
            "per_shot_summaries": "SHOT 6: The speaker lauds the phone's features including a large, high-quality screen and ample RAM, considering the $300 price point."
        },
        {
            "start": 26.1667,
            "end": 35.3333,
            "text_on_screen": "battery for the price give you as well",
            "per_shot_summaries": "SHOT 7: An impressive 5000 milliamp battery is mentioned. In addition, it's revealed that the purchase includes free noise-canceling Nord buds."
        },
        {
            "start": 35.3333,
            "end": 37.916666666666664,
            "text_on_screen": "to test you think",
            "per_shot_summaries": "SHOT 8: The speaker expresses enthusiasm to test out this phone, also inviting viewer opinions on the new OnePlus N30.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 24.966666666666665,
            "text_on_screen": "tell me if this @pinkpencilmath Tik Tok makes sense to you if 1/3 equals to 0.333 repeating 0.33 and 2/3 equals 0.666... repeating and 0.3 repeating 0.666... plus 0.6 repeating + 0.99 pretty straightforward right? but if 3/3 equals to 1 then does 1 equal to which equals to 3/3? what do you think?",
            "per_shot_summaries": "\"Shot 1: The 25-second shot features a person drawing a number with a pink pencil, while discussing a math concept via an audio transcript. The math concept involves fractions and their decimal equivalents, questioning the notion that 1 equals 0.9 repeating.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 4.17084,
            "text_on_screen": "@erinmcgoff How to answer: What is your greatest in a job interview strength peo strength?» CWhat is your greatest",
            "per_shot_summaries": "Shot 1: The video opens with a 4-second clip discussing how to address the question about one's greatest strength during a job interview."
        },
        {
            "start": 4.17084,
            "end": 4.42109,
            "text_on_screen": "LEGGO",
            "per_shot_summaries": "Shot 2: Titles on the screen read 'LEGGO.' The audio plays a short thank you, while the visual info suggests the video focuses on job interview tips and answering the strength question."
        },
        {
            "start": 4.42109,
            "end": 7.70771,
            "text_on_screen": "Interviewer: What would you say is your greatest strength?",
            "per_shot_summaries": "Shot 3: Over the span of 3 seconds, an interviewer asks, \"What would you say is your greatest strength?\" This is shown visually and also heard in the audio."
        },
        {
            "start": 7.70771,
            "end": 11.378,
            "text_on_screen": "wrong Um, well I'm like a X wrong good employee..? I mean I show up on time?",
            "per_shot_summaries": "Shot 4: For 4 seconds, a person stumbles to answer the question about their greatest strength, claiming to be a good and punctual employee."
        },
        {
            "start": 11.378,
            "end": 13.0964,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: A woman with blonde hair and glasses suggests that she is very intelligent in a 2-second clip without any on-screen text."
        },
        {
            "start": 13.0964,
            "end": 14.8148,
            "text_on_screen": "Not me blanking on answer lol",
            "per_shot_summaries": "Shot 6: Another woman jokes about struggling to find an answer to the strength question in a brief, undecorated 2-second shot."
        },
        {
            "start": 14.8148,
            "end": 18.5853,
            "text_on_screen": "Time management! is that right? that's what the internet told me to say internet told me to say TikTok",
            "per_shot_summaries": "Shot 7: Over 4 seconds, a woman with glasses posits that her time management skills, instilled by the internet, are her greatest strength."
        },
        {
            "start": 18.5853,
            "end": 22.2055,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: The same question about the interviewee's greatest strength is repeated in the audio, although there's no new text on-screen in this 4-second clip."
        },
        {
            "start": 22.2055,
            "end": 38.2049,
            "text_on_screen": "correct I've had previous managers tell me that I'm really dependable J TikTok they can always count on me to get the works for any job! job done right and on time and that always means a lot to me when I hear that. One of my greatest strengths is tenacity! do whatever it takes if I have a goal, I will this example is great for sales! to get there and I always believe that there's a solution. I'm resourceful, I'm scrappy without a fight.",
            "per_shot_summaries": "Shot 9: A woman talks at length (16 seconds) about being told she is reliable and tenacious by previous managers, claiming it's one of her greatest strengths and believing in the importance of resourcefulness and not giving up easily."
        },
        {
            "start": 38.2049,
            "end": 46.4631,
            "text_on_screen": "Something that Ive been Something that I've been complimented on the past is my attitude. attributing the strength to a compliment from others signals modesty No matter what's going on, I always try to bring positive energy to the team and I've been told this is something that people really appreciate.",
            "per_shot_summaries": "Shot 10: In an 8-second shot, a woman points out how her positive attitude, something that she's often praised for, contributes towards a team's dynamic. The text on-screen suggests that attributing personal strength to others' compliments can signal modesty."
        },
        {
            "start": 46.4631,
            "end": 46.21287954621288,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: A 0-second shot ends the video with an image of a woman taking a selfie, neither text on-screen nor audio transcript is provided."
        }
    ],
    [
        {
            "start": 0,
            "end": 5.3,
            "text_on_screen": "fake skin TikTok @lianaparmezana Tik Tok",
            "per_shot_summaries": "\"SHOT 1: In this 5-second shot, Kartika Sahdev discusses her confusion lately. This is alongside the visual of her discussing the issue related to her fake skin and skin cancer."
        },
        {
            "start": 5.3,
            "end": 14.2,
            "text_on_screen": "real skin",
            "per_shot_summaries": "SHOT 2: The second shot lasts 9 seconds, displaying a younger woman with red skin and acne. The shot is captioned 'real skin'.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 82.83333333333333,
            "text_on_screen": "@bmilly32 BARBECUE OR COOKIES TOK WAFFLE CHIPS (OR HAMBURGER ICE CREAM @bmilllv 32 CHEESE Wings HOT DOG CHOCOLATE VO Seafood Sushi FRENCH FRIES PIZZA LASAGNA CHILI OR) JO CHO WAFFL YOU ARE WHAT YOU EAT! CE CREAM",
            "per_shot_summaries": "\"SHOT 1: For 83 seconds, a man interacts with a child while playing a video game, verbally deliberating over different food items like barbecue, cookies, chips, waffles, ice cream, and many others. Meanwhile, the screen displays the message 'YOU ARE WHAT YOU EAT!' alongside numerous food names.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 43.56666666666667,
            "text_on_screen": "well maybe we got lost in... well maybe we got relations translation @sheeguin TikTok maybe this thing was a... masterpiece beauty piece til you tore it all up. running scared I was... there dared Tik Tok i remember it all to well. and you call me up... one day again just to break me like a promise. so casually... cruel cold 100",
            "per_shot_summaries": "Shot 1 lasts for 44 seconds, displaying the text 'well maybe we got lost... so casually cruel cold 100'. The scene features a child in emotional distress being comforted by their mother."
        }
    ],
    [
        {
            "start": 0,
            "end": 3.56667,
            "text_on_screen": "Tik Tok @khaby.lame TikTok",
            "per_shot_summaries": "\"An elderly man is seen balancing buckets in an art gallery for a brief span of four seconds."
        },
        {
            "start": 3.56667,
            "end": 4.56667,
            "text_on_screen": "",
            "per_shot_summaries": "The next shot lasting for a second features a man observing an exhibition surrounded by other people."
        },
        {
            "start": 4.56667,
            "end": 14.3,
            "text_on_screen": "@khaby lame",
            "per_shot_summaries": "Following this, a lasting scene of ten seconds depicts an old man handling a rolled up red carpet in front of an audience."
        },
        {
            "start": 14.3,
            "end": 44.93333333333333,
            "text_on_screen": "",
            "per_shot_summaries": "Finally, a much longer scene, stretching over thirty-one seconds, presents a man amusing himself with a blue bucket.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 6.5,
            "text_on_screen": "TikTok @aguyandagolden Caught my dog having a special moment with his toy... Tik Tok",
            "per_shot_summaries": "\"Shot 1 displays a dog amusing itself with a toy while laying on the floor. The scene lasts for 6 seconds."
        },
        {
            "start": 6.5,
            "end": 12.7,
            "text_on_screen": "special moment with his toy... TikTok special moment with his toy... J. TikTok special moment with his toy...TikTok",
            "per_shot_summaries": "Shot 2, also of 6 seconds, showcases a golden retriever as it joyfully plays on the floor, located just in front of a fireplace.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 3.8,
            "text_on_screen": "im a photographer and i took this photo... @stickyboy69",
            "per_shot_summaries": "\"Shot 1: A man, who claims to be a photographer, is shown holding a camera and taking a selfie for a duration of 4 seconds."
        },
        {
            "start": 3.8,
            "end": 6.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: A tabby cat is seen sitting with his hind legs up and paws open while someone off-screen comments 'That's a thing' during a 3 second duration.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 0.666667,
            "text_on_screen": "how to create a two toned blue French tip manicure @lightslacquer",
            "per_shot_summaries": "\"Shot 1 presents an introduction to a tutorial on creating a two-toned blue French tip manicure with text on the screen and audio."
        },
        {
            "start": 0.666667,
            "end": 1.36667,
            "text_on_screen": "",
            "per_shot_summaries": "In shot 2, 'How to create a two-tone' is heard, accompanied by the visual of creating a blue French tip manicure."
        },
        {
            "start": 1.36667,
            "end": 2.13333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3 continues the instructional voice-over, adding the colored references 'blue? French tip,' while visualizing the manicure process."
        },
        {
            "start": 2.13333,
            "end": 2.8,
            "text_on_screen": "",
            "per_shot_summaries": "The fourth shot repeats the information of creating a two-toned blue French manicure, with the added query in the audio transcript, 'manicures?'"
        },
        {
            "start": 2.8,
            "end": 3.53333,
            "text_on_screen": "",
            "per_shot_summaries": "In the fifth shot, you watch as nails are painted blue, without any supplemental text or audio."
        },
        {
            "start": 3.53333,
            "end": 4.76667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6 is a silent clip showing a blue nail being placed on a finger."
        },
        {
            "start": 4.76667,
            "end": 8.86667,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "During shot 7, the frame is filled with two blue and white nail polishes in someone's hand. The text 'Tik Tok' is displayed although there's no dialogue."
        },
        {
            "start": 8.86667,
            "end": 10.633333333333333,
            "text_on_screen": "",
            "per_shot_summaries": "The final shot, shot 8, shows a hand with beautifully painted nails in blue and white, with no accompanying text or audio.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 31.625,
            "text_on_screen": "When your Mom & Dad buy you something Tik Tok @theclassifics @theclassiiics why is it so quiet here? what you doing? TikTok just playing my game yeah okay that's what I thought anyway We got you SneakERASERS oh man about time what you mean about time? no I'm saying dad you know I wanted them thank you, I appreciate it wait no no no before you use the eraser you have to go wet it first oh okay please go wet it first alright yeah",
            "per_shot_summaries": "Shot 1 Summary: For 32 seconds, the scene is focused on a man and a woman in a living room. The on-screen text captures a conversation about a gift, namely 'SneakERASERS' that the parents have bought for their child. The child expresses gratitude and is instructed to wet the erasers before use."
        },
        {
            "start": 31.625,
            "end": 31.6667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2 Summary: The second shot, which has no duration, shows a person tying his shoes, symbolizing the gift mentioned in the previous shot, with the text \"when mom & dad buy you something\" appearing on screen, hinting at the narrative."
        },
        {
            "start": 31.6667,
            "end": 56.6667,
            "text_on_screen": "all right, so how do I use it? so you gotta make sure you scrub gently because you're gonna waste it use the white side and gently scrub and then flip it over to the orange side so you can wipe away the residue okay I will thank you guys I've been wanting these for a while you're welcome sweetie yeah you better not waste them I won't dad oh man this is so cool",
            "per_shot_summaries": "Shot 3 Summary: Over the span of 25 seconds, a man is seen tying his colorful sneakers while the on-screen text and audio transcript detail how to use 'SneakERASERS'. The man thanks his parents and promises not to waste the gift, expressing excitement."
        },
        {
            "start": 56.6667,
            "end": 86.0,
            "text_on_screen": "isn't that so easy? right, you see how it's working? yeah super easy set these right here what are those for? just need to take care of those for us, cool? but those are y'all shoes I thought you bought this for me? right tootles actually you know if you want come on oh",
            "per_shot_summaries": "Shot 4 Summary: The concluding shot, of 29 seconds, presents a woman and a man in an apartment. The audio transcript and on-screen text carry on the narrative, indicating that the man finds the 'SneakERASERS' easy to use. However, he is asked to also take care of his parents' shoes, sparking a bit of confusion and banter."
        }
    ],
    [
        {
            "start": 0,
            "end": 9.766666666666667,
            "text_on_screen": "@visit",
            "per_shot_summaries": "\"During the first 10-second shot of the video, a train ride is depicted leading to a beautiful girl. The subject expresses her awe verbally, stating 'Beautiful'. The screen also displays the text '@visit'.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 2.2,
            "text_on_screen": "Reply to mosheree's comment What about blue lotus Do you know what the flower of choice was @affirmation.love Did you know TikTok was highly favored by for the pharaohs of ancient of ancient Egypt?",
            "per_shot_summaries": "Shot 1 summary: There is text on screen revealing a trivia about the favored flower of the pharaohs while the screen shows a box of weed with related captions."
        },
        {
            "start": 2.2,
            "end": 3.03333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2 summary: The audio continues the dialog from previous shot about ancient Egypt and the screen displays a box of purple powder indicating that it's a pharaohs' favor."
        },
        {
            "start": 3.03333,
            "end": 6.53333,
            "text_on_screen": "this is the Egyptian Water Lily It was none Egyptian water lily. other than the also known as the Blue Lotus Flower",
            "per_shot_summaries": "Shot 3 summary: It is clarified that the favorite flower was the Egyptian Water Lily, also known as the Blue Lotus Flower which is shown on a cardboard box."
        },
        {
            "start": 6.53333,
            "end": 7.23333,
            "text_on_screen": "Commonly referred to as it's a mildly psychoactive flower that's often consumed as a tea the blue lotus",
            "per_shot_summaries": "Shot 4 summary: The screen shows that the blue lotus, also referred to as the Egyptian water lily, is mildly psychoactive and could be consumed as a tea."
        },
        {
            "start": 7.23333,
            "end": 9.16667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5 summary: The shot showcases a bowl of blue lotus flowers hinting at their use."
        },
        {
            "start": 9.16667,
            "end": 10.1333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 6 summary: The focus is on the blue lotus flower extract."
        },
        {
            "start": 10.1333,
            "end": 11.8333,
            "text_on_screen": "this extraordinary blossom possesses mild properties and \"other\" flowers",
            "per_shot_summaries": "Shot 7 summary: A wooden board displays words revealing that the extraordinary Blue Lotus blossom possesses mild psychoactive properties."
        },
        {
            "start": 11.8333,
            "end": 14.1667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8 summary: The screen reinforces the description of the blue lotus blossom with its mild psychoactive properties."
        },
        {
            "start": 14.1667,
            "end": 14.6,
            "text_on_screen": "and also commonly smoked is often enjoyed as a tea or",
            "per_shot_summaries": "Shot 9 summary: The shot presents people cutting out tea on a cutting board indicating its consumption methods."
        },
        {
            "start": 14.6,
            "end": 15.4667,
            "text_on_screen": "here I'm just using mugwort and lavender for reference",
            "per_shot_summaries": "Shot 10 summary: The video shifts to a kitchen setup where someone is preparing herbal tea or cigarettes, possibly of Blue Lotus."
        },
        {
            "start": 15.4667,
            "end": 16.3333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11 summary: A person is shown cutting an apple into slices while mentioning of these flowers being smoked alone."
        },
        {
            "start": 16.3333,
            "end": 17.0333,
            "text_on_screen": "alone, occasionally blended with",
            "per_shot_summaries": "Shot 12 summary: An explanation is given about these flowers occasionally being blended with others."
        },
        {
            "start": 17.0333,
            "end": 24.6333,
            "text_on_screen": "Blue Lotus has been used for thousands of years In this instance, I'll mention to promote a déep state of relaxation to promote a deep state of and lavender for comparison and it is also known to have mood-lifting and aphrodisiac effects",
            "per_shot_summaries": "Shot 13 summary: Blue Lotus' benefits such as promoting deep relaxation and having mood-lifting and aphrodisiac effects are properly detailed on screen."
        },
        {
            "start": 24.6333,
            "end": 28.6333,
            "text_on_screen": "effects For thousands of years, the blue lotus For many people also experience a subtle increase employed to induce a profound state of",
            "per_shot_summaries": "Shot 14 summary: The text on screen and audio both explain how the blue lotus has been used for thousands of years to induce a profound state of relaxation."
        },
        {
            "start": 28.6333,
            "end": 29.5333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15 summary: The narration completes the sentence started in the previous shot, talking about a state of relaxation induced by blue lotus."
        },
        {
            "start": 29.5333,
            "end": 30.4667,
            "text_on_screen": "and others take it to promote vivid and lucid dreaming",
            "per_shot_summaries": "Shot 16 summary: The shot showcases a jar holding text about promoting relaxation using Blue Lotus."
        },
        {
            "start": 30.4667,
            "end": 31.4667,
            "text_on_screen": "It is renowned for its mood enhancing qualities",
            "per_shot_summaries": "Shot 17 summary: Tumeric is shown on screen with a caption mentioning its mood enhancing qualities."
        },
        {
            "start": 31.4667,
            "end": 36.4667,
            "text_on_screen": "this is a really unique alternative plant and its ability to ignite feelings of for people who have insomnia or anxiety",
            "per_shot_summaries": "Shot 18 summary: The shot describes the plant's mood-enhancing qualities and its ability to spark feelings of passion."
        },
        {
            "start": 36.4667,
            "end": 37.7667,
            "text_on_screen": "tolerance break some individuals Moreover, report an sense",
            "per_shot_summaries": "Shot 19 summary: Some individuals reportedly experience an augmented sense of awareness, likely after consuming the plant."
        },
        {
            "start": 37.7667,
            "end": 39.8,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 20 summary: The report of heightened sense of awareness is continued in this shot."
        },
        {
            "start": 39.8,
            "end": 39.8667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 21 summary: A quick reference is made to individuals who report an augmented sense of awareness."
        },
        {
            "start": 39.8667,
            "end": 40.2667,
            "text_on_screen": "of awareness, while others utilize it to",
            "per_shot_summaries": "Shot 22 summary: This shot swiftly transitions to a new topic."
        },
        {
            "start": 40.2667,
            "end": 40.9667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 23 summary: The narration on the soundtrack appears to be making a point about others' experiences."
        },
        {
            "start": 40.9667,
            "end": 41.9667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 24 summary: In this frame, a woman is seen holding a jar with a quote about awareness possibly related to the plant's effects."
        },
        {
            "start": 41.9667,
            "end": 44.7333,
            "text_on_screen": "facilitate vivid and lucid dreaming.",
            "per_shot_summaries": "Shot 25 summary: The shot shows a jar of what appears to be blue borax, with the text underscoring its role in facilitating vivid and lucid dreaming."
        },
        {
            "start": 44.7333,
            "end": 48.1333,
            "text_on_screen": "to promot remarkable This plant serves as an alternative for disiac mood-liftin",
            "per_shot_summaries": "Shot 26 summary: A tray of seeds are shown as an exceptional alternative for those dealing with certain difficulties."
        },
        {
            "start": 48.1333,
            "end": 48.5667,
            "text_on_screen": "those dealing with insomnia or anxiety piety, as well",
            "per_shot_summaries": "Shot 27 summary: The shot concentrates on anxiety and insomnia, introducing the plant as an alternative for people dealing with these conditions."
        },
        {
            "start": 48.5667,
            "end": 52.5667,
            "text_on_screen": "as anyone seeking an alternative to flower@affirmation.love their usual flowere flower flow",
            "per_shot_summaries": "Shot 28 summary: The insomnia or anxiety topics continue, with mention of people seeking alternative options to their usual flower."
        },
        {
            "start": 52.5667,
            "end": 53.4667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 29 summary: The shot shows a person cutting flowers on a cutting board, possibly involving an alternative utilisation."
        },
        {
            "start": 53.4667,
            "end": 54.4,
            "text_on_screen": "during a period of tolerance",
            "per_shot_summaries": "Shot 30 summary: A mason jar on screen holds a quote regarding a period of tolerance."
        },
        {
            "start": 54.4,
            "end": 55.4,
            "text_on_screen": "break.",
            "per_shot_summaries": "Shot 31 summary: The shot continues to discuss a period of a tolerance break."
        },
        {
            "start": 55.4,
            "end": 56.6,
            "text_on_screen": "and others take it to promote -",
            "per_shot_summaries": "Shot 32 summary: In the final shot, viewers are guided to make their own lavender and sage incense with text overlay promoting the plant."
        }
    ],
    [
        {
            "start": 0,
            "end": 7.13333,
            "text_on_screen": "so there is a little bit of a secret to this Reply to ajajajajaj734's comment I need your skin routine asap because I'm not looking that fresh after a long hospital shift. TikTok @stellarosalife and it's not just necessarily my skincare I do take care of my skin skin I'm not lying about that but there's one key thing that I feel like a lot of people don't know about",
            "per_shot_summaries": "In the first shot of the video, a woman in a car reveals a skincare secret while answering a user's comment about her post-hospital shift appearance. She emphasizes the importance of skincare."
        },
        {
            "start": 7.13333,
            "end": 30.4333,
            "text_on_screen": "like literally they don't know about and it's this this little volcanic rock thing okay I put it in my TikTok shop I never advertise off there @stellarosalife. but this is something that I feel like is importante to people um this is just greasy it might appear glowy but it's not it's like thick grease",
            "per_shot_summaries": "In the second shot, the woman continues her previous point, introducing a little volcanic rock product that she finds crucial, although it's not widely known. She advertises this product in her TikTok shop and addresses the misconception of greasiness being mistaken as glowiness."
        },
        {
            "start": 30.4333,
            "end": 31.2,
            "text_on_screen": "okay I also tell you touch up my makeup mid shift okay I do",
            "per_shot_summaries": "The third shot is brief, with the woman filming herself in the car's mirror and starting to discuss touching up makeup while working."
        },
        {
            "start": 31.2,
            "end": 34.4333,
            "text_on_screen": "okay I also tellyou 2013",
            "per_shot_summaries": "In the fourth shot, the woman elaborates on her makeup routine during her shift, reinforcing the idea that looking good corresponds to feeling good."
        },
        {
            "start": 34.4333,
            "end": 44.9,
            "text_on_screen": "you look good you feel good you know when I look like a grease pit and no l don't feel good like a grease pit and nol so l go ahead and fix myself up just a little smidger",
            "per_shot_summaries": "The fifth shot has the woman continuing her point on looking and feeling good, mentioning that she rectifies her appearance when she feels greasy to boost her morale."
        },
        {
            "start": 44.9,
            "end": 46.6667,
            "text_on_screen": "I feel like no one even has one of these",
            "per_shot_summaries": "In the sixth shot, she introduces a new product, presumably a hair-dryer, indicating its rarity among users."
        },
        {
            "start": 46.6667,
            "end": 48.6667,
            "text_on_screen": "let me show you how she works okay look at this",
            "per_shot_summaries": "The seventh shot shows the woman demonstrating the use of the previously mentioned product in the car."
        },
        {
            "start": 48.6667,
            "end": 64.7667,
            "text_on_screen": "okay so it like takes off the grease without do you see the difference see this it's like that's pretty and this is a shine ball",
            "per_shot_summaries": "In the eighth shot, she talks about the effects of the product on her skin while using a makeup brush in her car. She points out the noticeable difference it makes to her oily skin without affecting her makeup."
        },
        {
            "start": 64.7667,
            "end": 71.3333,
            "text_on_screen": "and then it takes off the grease the grease without removing your makeup",
            "per_shot_summaries": "In the ninth shot, she continues by showing that the product removes greasiness without removing makeup."
        },
        {
            "start": 71.3333,
            "end": 79.9,
            "text_on_screen": "okay so then when we put powder on to freshen up she doesn't look all nasty hey I swear by this stupid thing",
            "per_shot_summaries": "In the tenth video shot, she notes that applying powder to freshen up doesn't look bad due to the previously introduced product, swearing by its effectiveness."
        },
        {
            "start": 79.9,
            "end": 85.2,
            "text_on_screen": "key for midday touch up makeup so that is all good night",
            "per_shot_summaries": "In the final eleventh shot, she wraps up her points on midday make-up touch-ups and wishes her viewers a good night, ending in the car with text on screen."
        }
    ],
    [
        {
            "start": 0,
            "end": 0.166667,
            "text_on_screen": "POV: Me verses Alarm TikTok",
            "per_shot_summaries": "\"Shot 1: A couple of cartoons sleep in bed under the text 'POV: Me verses Alarm TikTok.'"
        },
        {
            "start": 0.166667,
            "end": 0.233333,
            "text_on_screen": "J TikTok",
            "per_shot_summaries": "Shot 2: Two men lay in bed while a cartoon man looks at a phone under the text 'J TikTok'."
        },
        {
            "start": 0.233333,
            "end": 0.666667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: There's a cartoon character visual representing 'pcv me versus alarm'."
        },
        {
            "start": 0.666667,
            "end": 2.06667,
            "text_on_screen": "Alarm 5:00 am 5:05 am 5:10 am 5:15 am 5:20 am 5:25 am 5:30 am 5:35 am О",
            "per_shot_summaries": "Shot 4: An on-screen text displays alarm time intervals from 5:00 am to 5:35 am under the title 'PCV me versus alarm screenshot'."
        },
        {
            "start": 2.06667,
            "end": 3.23333,
            "text_on_screen": "POV:Me verses Alarm",
            "per_shot_summaries": "Shot 5: The text 'POV: Me verses Alarm' is shown on the video screen."
        },
        {
            "start": 3.23333,
            "end": 4.9,
            "text_on_screen": "@dark_tales",
            "per_shot_summaries": "Shot 6: A cartoon illustration is shown with the phrase 'pc me versus alarm.'"
        },
        {
            "start": 4.9,
            "end": 7.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A table with an alarm on it is depicted in a drawing."
        },
        {
            "start": 7.4,
            "end": 10.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: A scene features two cartoon characters in bed, with one sleeping."
        },
        {
            "start": 10.5,
            "end": 14.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: An illustration depicts 'pcv me versus alarm.'"
        },
        {
            "start": 14.3,
            "end": 15.0667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: A cartoon shows a man lying down in bed."
        },
        {
            "start": 15.0667,
            "end": 16.233333333333334,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: The scene is a drawing of a person standing next to a door.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 1.33333,
            "text_on_screen": "Do you like waffles Steve? TikTok @therealsamalkhatib",
            "per_shot_summaries": "\"Shot 1: A man in a suit is sitting at a table and eating waffles as he responds affirmatively to the text on screen asking if he likes waffles."
        },
        {
            "start": 1.33333,
            "end": 3.45833,
            "text_on_screen": "Ilike waffles Terry.",
            "per_shot_summaries": "Shot 2: Despite expressing his love for waffles, a man is seen in a suit eating pancakes instead during the shot of 2 seconds."
        },
        {
            "start": 3.45833,
            "end": 4.75,
            "text_on_screen": "Then why'd ya get pancakes?",
            "per_shot_summaries": "Shot 3: The man in his suit and tie continues to eat pancakes, with a text on screen questioning his choice of pancakes over waffles."
        },
        {
            "start": 4.75,
            "end": 6.95833,
            "text_on_screen": "'cause I also like pancakes.",
            "per_shot_summaries": "Shot 4: A man is seen holding a plate of pancakes, justifying his choice by stating that he likes pancakes as well."
        },
        {
            "start": 6.95833,
            "end": 7.66667,
            "text_on_screen": "That's weird.",
            "per_shot_summaries": "Shot 5: A man in a suit is seen eating breakfast, with a text on screen labeling his food choices as weird."
        },
        {
            "start": 7.66667,
            "end": 10.375,
            "text_on_screen": "It's not that weird Terry.",
            "per_shot_summaries": "Shot 6: The man in a suit with pancakes in front of him defends his choice, stating it's not weird."
        },
        {
            "start": 10.375,
            "end": 12.3333,
            "text_on_screen": "If ya like waffles you should get waffles.",
            "per_shot_summaries": "Shot 7: A suited man is seen having breakfast with a plate of waffles, with the text on screen suggesting he should have gotten waffles if he likes them."
        },
        {
            "start": 12.3333,
            "end": 14.0833,
            "text_on_screen": "Maybel will next time. nexttime .",
            "per_shot_summaries": "Shot 8: The man in the suit considers getting waffles next time as he sits at a table in front of pancakes."
        },
        {
            "start": 14.0833,
            "end": 15.3333,
            "text_on_screen": "What if there is no next time.",
            "per_shot_summaries": "Shot 9: While eating breakfast, the man in a suit contemplates the uncertainty of a next time to get waffles according to the text on screen."
        },
        {
            "start": 15.3333,
            "end": 16.7917,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: A man is eating breakfast at a table in silence, without any speech or text on screen."
        },
        {
            "start": 16.7917,
            "end": 18.2083,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: A man in a suit is seen eating breakfast at a table without any text or audio transcript."
        },
        {
            "start": 18.2083,
            "end": 19.9583,
            "text_on_screen": "Amlin danger or somethin?",
            "per_shot_summaries": "Shot 12: A man is seen eating pancakes, wondering aloud if he is in danger which is echoed by the text on screen."
        },
        {
            "start": 19.9583,
            "end": 20.6667,
            "text_on_screen": "I'm just sayin.",
            "per_shot_summaries": "Shot 13: A man sits silently at a breakfast table, only briefly remarking that he's just saying, according to the text on screen."
        },
        {
            "start": 20.6667,
            "end": 22.4167,
            "text_on_screen": "There will most likely be anext time Terry.",
            "per_shot_summaries": "Shot 14: A man eating pancakes on a table reassures that there will most likely be a next chance, according to the audio transcript and text on screen."
        },
        {
            "start": 22.4167,
            "end": 24.9167,
            "text_on_screen": "You can't like the rest of your life settling for you second option. Tik Tok",
            "per_shot_summaries": "Shot 15: As the man in a suit continues to eat his breakfast, the text on screen warns against settling for second options in life."
        },
        {
            "start": 24.9167,
            "end": 26.7083,
            "text_on_screen": "What is this atherapy session?",
            "per_shot_summaries": "Shot 16: The man in a suit, while eating pancakes, questions whether this is a therapy session according to the audio transcript."
        },
        {
            "start": 26.7083,
            "end": 29.9583,
            "text_on_screen": "You deserve waffles Steve. In a world where everyone's settling for pancakes...",
            "per_shot_summaries": "Shot 17: Still eating breakfast, the man is told via text on screen and audio transcript that he deserves waffles in a world where everyone's settling for pancakes."
        },
        {
            "start": 29.9583,
            "end": 32.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 18: A silent shot of a man eating a pancake on a table, with the audio transcript echoing the previous sentiment that he deserves waffles.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 0.566667,
            "text_on_screen": "@monicas.cutting.b",
            "per_shot_summaries": "\"Shot 1: A one-second scene where someone is cutting a slice of watermelon, and the on-screen text denotes a username, and audio guides about a route to cut fast."
        },
        {
            "start": 0.566667,
            "end": 10.2333,
            "text_on_screen": "l@monicas.cutting.b @monicas.cutting. @monicas.cutting b @monicas.cutting.bi",
            "per_shot_summaries": "Shot 2: A 10-second scene that shows a person slicing watermelon on a white grater, with on-screen text that appears to be repetitive, and audio instructions about using a slicer and steel needle."
        },
        {
            "start": 10.2333,
            "end": 14.5,
            "text_on_screen": "SE AND STAR",
            "per_shot_summaries": "Shot 3: The four-second shot shows a person dicing watermelon using a grater, the text on the screen is 'SE AND STAR', and the audio conveys that the tool is easy to use."
        },
        {
            "start": 14.5,
            "end": 15.1,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: The one-second scene presents a woman slicing a watermelon, and the audio comments on the appealing outcome of fruit cuts."
        },
        {
            "start": 15.1,
            "end": 17.6,
            "text_on_screen": "E AND S",
            "per_shot_summaries": "Shot 5: In a three-second shot, there is no audio or on-screen text, just watermelon slices being cut on a cutting board."
        },
        {
            "start": 17.6,
            "end": 20.9,
            "text_on_screen": "ND ST SE AND PAUSE AND STA PAUSE AND ST @monicas.cutting.br",
            "per_shot_summaries": "Shot 6: A three-second scene is demonstrating cutting watermelon preparation for salad, with repetitive text on screen, but no accompanying audio."
        },
        {
            "start": 20.9,
            "end": 22.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A two-second shot which is without audio or text, only shows a steak and watermelon being cut on a cutting board.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 5.9,
            "text_on_screen": "Conroe The Woodlands 99 When you learn Houston is Atascocita 69 249 Cypress 1 hr 13 min Katy Hunters Creek Houston Village shear Fastest ague CityG Bayto Hunters Creek 45 no League CityG n Vlec ta Fe Pearland ge no. Pearland anta Fe Sienna fuge Santa Fe Refuge efuge Inta Fe an Grove 1 hr 11 min erg luge @texastravel Jamai a Fe Tik Tok",
            "per_shot_summaries": "\"SHOT 1: A 6-second shot features a girl using her phone to display a map. The map is detailed with various Houston-related locations and travel durations. She questions audibly, 'You mean, we didn't meet?'"
        },
        {
            "start": 5.9,
            "end": 5.933333333333334,
            "text_on_screen": "",
            "per_shot_summaries": "SHOT 2: The second shot, of no specified duration, presents a look at her mother, who is visibly upset and crying.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 3.56667,
            "text_on_screen": "medication for patientin. room 2\" \"Hi! I'm missing the medication for patientin @scrubhacks medication for patientin1",
            "per_shot_summaries": "Shot 1: A woman in a scrub uniform is seen sitting at her laptop with a message about missing medication for a patient popping up on the screen."
        },
        {
            "start": 3.56667,
            "end": 7.4,
            "text_on_screen": "\"On my end it says it was delivered this morning\" Tik Tok",
            "per_shot_summaries": "Shot 2: A woman wearing glasses is shown working on a laptop. The screen text suggests a delivery had been made earlier that day."
        },
        {
            "start": 7.4,
            "end": 11.0667,
            "text_on_screen": "\"I am not seeing it on my end\"",
            "per_shot_summaries": "Shot 3: There's a woman in scrubs at a kitchen table using a laptop. The on-screen text indicates she isn't seeing the mentioned delivery on her end."
        },
        {
            "start": 11.0667,
            "end": 22.2333,
            "text_on_screen": "*calling pharm tech to assure it was delivered* assure it was delivered** \"I have a time stamp of 0734 that it was delivered to the unit.\" 0734 that it was delivered.",
            "per_shot_summaries": "Shot 4: A woman with glasses is shown on a phone call, with her laptop in front of her. Text appearing on the screen refers to a call to a pharmacy technician about the reportedly delivered medication."
        },
        {
            "start": 22.2333,
            "end": 29.8,
            "text_on_screen": "\"Could you please send another? I cannot locate it. Thanks!\" .\"Could you please send \"Have you checked the med box by the tube station?\"",
            "per_shot_summaries": "Shot 5: A businesswoman is seen working on her laptop with an on-screen message requesting the resend of the missing medication, followed by an inquiry about checking the med box by the tube station."
        },
        {
            "start": 29.8,
            "end": 33.3333,
            "text_on_screen": "\"Yes, 've checked there and everywhere else. It's not here.\" \"Yes, I've checked there",
            "per_shot_summaries": "Shot 6: A shot featuring a man and a woman in scrubs in front of a laptop, the text on screen suggests they have checked everywhere and the medication is not found."
        },
        {
            "start": 33.3333,
            "end": 35.2667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A woman wearing glasses and a shirt is focused on her work on a laptop."
        },
        {
            "start": 35.2667,
            "end": 36.5,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: A joyful scene where a man and woman in scrubs are seen smiling in front of a laptop."
        },
        {
            "start": 36.5,
            "end": 37.9333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: A woman wearing glasses is portrayed using her laptop in the kitchen."
        },
        {
            "start": 37.9333,
            "end": 40.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: Two people are shown in an RV, engrossed in something on a laptop."
        },
        {
            "start": 40.0333,
            "end": 43.6,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: A woman is shown on a cell phone while busy working at her computer."
        },
        {
            "start": 43.6,
            "end": 45.5,
            "text_on_screen": "*remembers one spot that wasn't checked* wasn't checked Sremembers one spot that",
            "per_shot_summaries": "Shot 12: On-screen text hints at a remembered place that wasn't checked, coupled with a visual of a woman in pink engaged in a video call."
        },
        {
            "start": 45.5,
            "end": 46.2667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 13: The video clip features an individual opening a refrigerator."
        },
        {
            "start": 46.2667,
            "end": 48.9,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 14: A woman is seen taking a selfie inside an illuminated refrigerator."
        },
        {
            "start": 48.9,
            "end": 57.1,
            "text_on_screen": "\"If you could please check the patient specific bin, refrigerator, patient specific bin in the fridge, box next to Pyxis, tube station and every nurse on the unit",
            "per_shot_summaries": "Shot 15: A shot of a nurse asking someone to check specific areas including the patient-specific bin, refrigerator, and tube station."
        },
        {
            "start": 57.1,
            "end": 58.7667,
            "text_on_screen": "\"I found it, thanks!\"",
            "per_shot_summaries": "Shot 16: A woman in pink scrubs is seen working on her laptop, where on-screen text reveals that the missing item was found."
        },
        {
            "start": 58.7667,
            "end": 61.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 17: The final shot features a woman in a suit using her phone and glasses, seemingly busy with work."
        }
    ],
    [
        {
            "start": 0,
            "end": 8.1,
            "text_on_screen": "TikTok @kristy.sarah testing out the viral egg shell heels Tik Tok",
            "per_shot_summaries": "\"Shot 1: A woman is seen showcasing her high heels as she walks around a house for eight seconds. The screen text mentions that it's a test of viral egg shell heels on TikTok."
        },
        {
            "start": 8.1,
            "end": 9.46667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: The video briefly showcases, for a second, a character named Trina attempting to do a flip and falling down."
        },
        {
            "start": 9.46667,
            "end": 12.5,
            "text_on_screen": "shall we see what my chef husband thinks",
            "per_shot_summaries": "Shot 3: Over a span of three seconds, we see a woman asking for her chef husband's opinion on an unknown subject. The text on screen echoes her query, and they are both seen near a pan."
        },
        {
            "start": 12.5,
            "end": 16.7667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: In this four-second shot, a person is shown walking in heels while cooking."
        },
        {
            "start": 16.7667,
            "end": 20.1667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: A three-second shot presents a man in a grey shirt standing in a hallway."
        },
        {
            "start": 20.1667,
            "end": 23.5667,
            "text_on_screen": "I feel like I've been walking on eggshells around you lately TikTok eggshells around you lately eggshells around you lately ct TikTok",
            "per_shot_summaries": "Shot 6: The sixth shot, lasting three seconds, shows a woman's feet in a pan. On-screen text suggests metaphoric walking on eggshells."
        },
        {
            "start": 23.5667,
            "end": 25.5667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: A two-second shot focusing on a man observing someone standing on the floor in a domestic setting."
        },
        {
            "start": 25.5667,
            "end": 26.5667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: For one second, the viewer sees a woman standing in a frying pan while wearing black heels."
        },
        {
            "start": 26.5667,
            "end": 27.5333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: A simple one-second shot features a man standing in a hallway with a white-themed decor."
        },
        {
            "start": 27.5333,
            "end": 29.5667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10: A man is seen performing a handstand near a frying pan, all within a brief two seconds."
        },
        {
            "start": 29.5667,
            "end": 33.3,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: A four-second shot shows a woman and man engaging in some playful activity in a living room while frying eggs is involved."
        },
        {
            "start": 33.3,
            "end": 35.666666666666664,
            "text_on_screen": "SsSsSsSsSsSs",
            "per_shot_summaries": "Shot 12: Concluding the video with a two-second shot, Kim Kardashian is depicted revealing her purchased shoes. The screen text, however, features a non-descript repetition of 'Ss'.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 7.1,
            "text_on_screen": "@cauliflowercarol this man parked outside our apartment had a smashed car window and Oour apartment had a",
            "per_shot_summaries": "\"Shot 1: For seven seconds, the footage shows a car that has crashed into a tree outside someone's apartment, referred to by the text on the screen as 'cauliflowercarol'."
        },
        {
            "start": 7.1,
            "end": 10.1,
            "text_on_screen": "Like fr",
            "per_shot_summaries": "Shot 2: In a 3-second scene, the suggestion is given to 'like' the video if one finds the damaged car intriguing, illustrated by the text 'Like fr'."
        },
        {
            "start": 10.1,
            "end": 17.5,
            "text_on_screen": "So we ran upstairs to calf 911 but he changed positions.... And he looked",
            "per_shot_summaries": "Shot 3: The scene displays a parked blue car under a tree for seven seconds. The text on the screen narrates that they ran upstairs to call 911, but the person changed positions."
        },
        {
            "start": 17.5,
            "end": 19.1333,
            "text_on_screen": "Tik Tok Like wtf",
            "per_shot_summaries": "Shot 4: A 2-second shot features a man lying in a car with the title 'Like wtf' displayed on the text on the screen."
        },
        {
            "start": 19.1333,
            "end": 26.8667,
            "text_on_screen": "The ambulance finally came BRONX LITTLE SBH ITALY (LITTLE",
            "per_shot_summaries": "Shot 5: Over an 8-second period, we see a parked car on a street lined with buildings. The text on screen indicates that 'The ambulance finally came'."
        },
        {
            "start": 26.8667,
            "end": 55.03333333333333,
            "text_on_screen": "The moment of truth his peaceful nap My apologies sir @cauliflowercarol: EMT going in for the fistbump",
            "per_shot_summaries": "Shot 6: The last shot lasts for 28 seconds and depicts a NYC firefighter stooping into the car, inferred by the text on the screen which tells 'The moment of truth' and 'EMT going in for the fistbump'.\""
        }
    ],
    [
        {
            "start": 0,
            "end": 2.46079,
            "text_on_screen": "$100 Walmart business Walmart Tik Tok @steviesells",
            "per_shot_summaries": "Shot 1: A man stands outside a Walmart with the text \"100 Walmart Business\" displayed, communicating his plan to start a low-budget business venture."
        },
        {
            "start": 2.46079,
            "end": 3.54521,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: The scene shifts to empty store aisles, where items are spread all over the floor, with the man indicating the business won't involve selling clearance items."
        },
        {
            "start": 3.54521,
            "end": 4.33767,
            "text_on_screen": "Clearance $15 av",
            "per_shot_summaries": "Shot 3: The focus moves to a man in the toy aisle of a Walmart store, with clearance sale information displayed on the screen."
        },
        {
            "start": 4.33767,
            "end": 4.37938,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 4: A brief shot showcases the store brimming with a variety of art supplies."
        },
        {
            "start": 4.37938,
            "end": 5.42209,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: The shot features various school supplies for sale, and the man continues his audio monologue about his love for business."
        },
        {
            "start": 5.42209,
            "end": 6.42309,
            "text_on_screen": "MOUNTAIN MOUN",
            "per_shot_summaries": "Shot 6: A store billing itself as the first smart bike store on Tiktok is shown, with the man considering the idea of purchasing a bike for his venture."
        },
        {
            "start": 6.42309,
            "end": 7.25726,
            "text_on_screen": "DOORDASH",
            "per_shot_summaries": "Shot 7: The idea of using the bike for delivering through Doordash is floated as the scene shows a man riding a bike inside a store."
        },
        {
            "start": 7.25726,
            "end": 7.29897,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: A Doordash trucker hat is displayed, reinforcing the delivery idea."
        },
        {
            "start": 7.29897,
            "end": 8.50851,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: Doordash hats from a bicycle shop are showcased with the audio implying potential city performances."
        },
        {
            "start": 8.50851,
            "end": 9.4678,
            "text_on_screen": "$98.00 Huffy 24\" R Mountain Bi Save with W+",
            "per_shot_summaries": "Shot 10: A mountain bike at Walmart, priced at 1498 dollars, is shown."
        },
        {
            "start": 9.4678,
            "end": 10.5522,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 11: The man muses on how the mountain bike's price after taxes would exceed his budget."
        },
        {
            "start": 10.5522,
            "end": 11.1778,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 12: A close-up view of a V8 mountain bike at the store is provided."
        },
        {
            "start": 11.1778,
            "end": 11.7618,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 13: The focus shifts to the rear tire of the bike in the store."
        },
        {
            "start": 11.7618,
            "end": 12.304,
            "text_on_screen": "FRONT SU BREATI",
            "per_shot_summaries": "Shot 14: A black saddle on the back of a bike is shown, suggesting he's looking for a cheaper bike."
        },
        {
            "start": 12.304,
            "end": 12.9713,
            "text_on_screen": "Low Price 28.00 Price",
            "per_shot_summaries": "Shot 15: A cheaper bike option priced at only 58 dollars is pointed out in the store."
        },
        {
            "start": 12.9713,
            "end": 13.8472,
            "text_on_screen": "24 UNIT PRICE 2888 0026-0001 Fac 1 Cap 1 12B ROCK IT EZ GREY RETAIL PRICE 03/10/23",
            "per_shot_summaries": "Shot 16: A shot of a \"cash coupon\" is displayed, following comments suggesting an affordable purchase choice."
        },
        {
            "start": 13.8472,
            "end": 14.2643,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 17: A man (assumedly the speaker), in glasses and a hoodie, takes a selfie."
        },
        {
            "start": 14.2643,
            "end": 14.6396,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 18: A wide range of bikes during a sale is displayed, showing the speaker's persistence in searching for the best deal."
        },
        {
            "start": 14.6396,
            "end": 14.9733,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 19: The scene shifts to a close-up of an orange bike rack, possibly indicating his final choice."
        },
        {
            "start": 14.9733,
            "end": 15.9326,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 20: The speaker is captured taking a selfie inside a supermarket."
        },
        {
            "start": 15.9326,
            "end": 16.4748,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 21: The story progresses to a telescopic rake display at the store."
        },
        {
            "start": 16.4748,
            "end": 17.3507,
            "text_on_screen": "Homes Curved 1496 496 028295372268",
            "per_shot_summaries": "Shot 22: The speaker is shown holding a lint brush in the store. He talks about always seeing someone cleaning windows."
        },
        {
            "start": 17.3507,
            "end": 18.5185,
            "text_on_screen": "New York C12 JENSEN",
            "per_shot_summaries": "Shot 23: The man is now seen holding a mop and broom in the store, apparently considering home cleaning services as a business route."
        },
        {
            "start": 18.5185,
            "end": 20.0617,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 24: A man in glasses holds up a toothbrush, continuing the idea of a cleaning business."
        },
        {
            "start": 20.0617,
            "end": 20.1034,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 25: The scene switches to a shelf with Giffas bottles - a potential cleaning supply for the speculated business."
        },
        {
            "start": 20.1034,
            "end": 21.1044,
            "text_on_screen": "AMMONIA-FREE GRADABLE SURFACTANTS Cleaner Refill with Ammonia STREAK-FREE SHINE Value CAUTION: EYE IRRITANT",
            "per_shot_summaries": "Shot 26: A hand holds a bottle of blue liquid, possibly a cleaning product, with the speaker stating his preference to stick with something online."
        },
        {
            "start": 21.1044,
            "end": 23.023,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 27: An individual strolls through a store filled with flowers."
        },
        {
            "start": 23.023,
            "end": 24.4411,
            "text_on_screen": "Crafts & Sewing 36 COPY PAPER 34 10-REAM OFFICE PACK DO NOT OPEN in store DEAM OFFICE PA",
            "per_shot_summaries": "Shot 28: The sight of the craft section in a store is shown, indicating a shift in the business idea."
        },
        {
            "start": 24.4411,
            "end": 24.4828,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 29: A wide range of art supplies at Walmart is presented, suggesting possible merchandise for the new venture."
        },
        {
            "start": 24.4828,
            "end": 25.4004,
            "text_on_screen": "TikTOK",
            "per_shot_summaries": "Shot 30: A shelf filled with paint and craft supplies is displayed."
        },
        {
            "start": 25.4004,
            "end": 26.4431,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 31: The speaker, a man with glasses, is seen posing in the store."
        },
        {
            "start": 26.4431,
            "end": 27.6944,
            "text_on_screen": "Beads",
            "per_shot_summaries": "Shot 32: Wooden beads are shown, indicating a potential product of interest for his business."
        },
        {
            "start": 27.6944,
            "end": 27.7361,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 33: A shot of a wood burning tool on sale at a shop is shown, possibly suggesting a crafting tool for the business."
        },
        {
            "start": 27.7361,
            "end": 28.6119,
            "text_on_screen": "WOOD BURNING BURNING SET TOOL",
            "per_shot_summaries": "Shot 34: A person is seen holding what looks like a tool, possibly the mentioned wood burning set."
        },
        {
            "start": 28.6119,
            "end": 30.3637,
            "text_on_screen": "I grabbed some other",
            "per_shot_summaries": "Shot 35: The speaker is seen looking at supplies in the store and suggesting the idea of making customized bracelets."
        },
        {
            "start": 30.3637,
            "end": 30.4054,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 36: Various crafting supplies are presented, hinting at materials required for the suggested product."
        },
        {
            "start": 30.4054,
            "end": 31.1979,
            "text_on_screen": "6+ 75 FT PACK! SATIN SILVER FRIENDSHI VALUE PA CREATE! BEAD 'N STRETCH",
            "per_shot_summaries": "Shot 37: A sign reads \"Bead 'N Stretch\", indicating the type of beads to be used in the bracelets."
        },
        {
            "start": 31.1979,
            "end": 31.2396,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 38: A view of additional crafting supplies is shown as the narrator talks about placing meaningful words on the bracelets."
        },
        {
            "start": 31.2396,
            "end": 32.2406,
            "text_on_screen": "supplies too :) :: supplies too :): supplies too )",
            "per_shot_summaries": "Shot 39: A well-stocked shelf displays jewelry and other supplies necessary for the proposed bracelet endeavor."
        },
        {
            "start": 32.2406,
            "end": 33.1582,
            "text_on_screen": "STONE STRAND 344",
            "per_shot_summaries": "Shot 40: A person wearing slippers is shown standing on a floor, possibly deliberating over how the crafted product will be sold."
        },
        {
            "start": 33.1582,
            "end": 33.9089,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 41: A display of turquoise bracelets from Walmart is shown, likely suggesting a potential product example."
        },
        {
            "start": 33.9089,
            "end": 34.7014,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 42: The speaker is seen in a store taking a selfie, suggesting he has spent 50 dollars on the necessary supplies."
        },
        {
            "start": 34.7014,
            "end": 35.3687,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 43: A transition to the speaker's involvement in a cash-free retail solution, possibly hinting at his potential sales method."
        },
        {
            "start": 35.3687,
            "end": 36.2446,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 44: An individual is observed retrieving a plastic bag of granola from a vending machine, suggesting he acquired additional supplies."
        },
        {
            "start": 36.2446,
            "end": 37.0787,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 45: An image is displayed possibly advertising the mentioned wood burning tool."
        },
        {
            "start": 37.0787,
            "end": 37.8295,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 46: The scene shifts to a hand inserting a plastic card into a machine, suggesting a payment or verification action."
        },
        {
            "start": 37.8295,
            "end": 38.5385,
            "text_on_screen": "AWARNING WARNING",
            "per_shot_summaries": "Shot 47: The speaker is pictured sitting in a car, holding a plastic bag, likely brimming with purchased supplies."
        },
        {
            "start": 38.5385,
            "end": 39.5812,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 48: An image of someone flipping a switch with the Tiktok logo appears, possibly representing the start of the project."
        },
        {
            "start": 39.5812,
            "end": 40.04,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 49: A hand holds a plug of a charging port, suggesting the wood burning tool is being prepared for use."
        },
        {
            "start": 40.04,
            "end": 40.9993,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 50: A hot solder tool sits on a table, possibly the wood burner mentioned."
        },
        {
            "start": 40.9993,
            "end": 42.0003,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 51: Someone is seen doing a repair job on a guitar using a screw, with the speaker talking about starting his crafting practice."
        },
        {
            "start": 42.0003,
            "end": 43.1682,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 52: The scene transitions to a tutorial on how to remove a ring from a ring using pliers, possibly serving as a handy tip for handling the wooden beads."
        },
        {
            "start": 43.1682,
            "end": 43.8772,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 53: A person cuts a bead with scissors and pliers, illustrating progress in the project."
        },
        {
            "start": 43.8772,
            "end": 45.0868,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 54: The speaker is captured making a bracelet, disclosing the primary product for his business."
        },
        {
            "start": 45.0868,
            "end": 45.8375,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 55: An image shows a false nail being removed with a toothpick, a process potentially metaphorical to the speaker's careful crafting."
        },
        {
            "start": 45.8375,
            "end": 46.63,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 56: A point of view shot shows an individual handling a needle with white powder, possibly suggesting the meticulous nature of the craft."
        },
        {
            "start": 46.63,
            "end": 47.9646,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 57: A pair of tweezers is used to break an egg shell, possibly representing the delicate nature of working with small beads."
        },
        {
            "start": 47.9646,
            "end": 48.5903,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 58: The speaker bends a wire into shape, further illustrating the bracelet creation process."
        },
        {
            "start": 48.5903,
            "end": 49.2159,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 59: A person ties a mono worm onto a fishing hook, possibly symbolizing the stringing together of the bracelet."
        },
        {
            "start": 49.2159,
            "end": 50.634,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 60: A DIY wooden bead bracelet with the word \"love\" is presented, showcasing the final product."
        },
        {
            "start": 50.634,
            "end": 51.2179,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 61: The speaker shows off a completed bracelet, demonstrating the fruit of his crafting labor."
        },
        {
            "start": 51.2179,
            "end": 53.637,
            "text_on_screen": "P request requests Trained to decline inappropriate with 30 names for a business w. ChatGPT may produce inaccurate information about people, plac 30 names for a business th 30 names for a business thay 30 names for a business that| w. ChatGPT may produce inaccurate information about people, pla 30 names for a business that sell riate Limited knowledge of world and ew. ChatGPT may produce inaccurate information about people, pl events after 2021 30 names for a business that sells F6 ew. ChatGPT may produce inaccurate information about people, w. ChatGPT may produce inaccurate information about people, pl ood burned bead bracelets Limited knowledge of F8 n about people, places, or facts. ChatGPT May 24 Version od burned bead bracele d burned bead bracelets oout people, places, or facts. ChatGPT May 24 Version od burned bead bracelets bout people, places, or facts. ChatGPT May 24 Version t people, places, or facts. ChatGPT May 24 Version please come up with 30 names for a business that sells Sure! Here are 30 name ideas for a business that sells wood 1. Wood Fire Jewels 2. BurntBead Creations 3. Charmed Ember 4. BlazeBeads 5. Firebrand Jewelry 6. Timber Treasures 7. Embered Elegalice 8. Smoldering Beads 9. PyroCrafted Jewelry 10. IgniteBeads Send a message 17. EmberEtch Bracelets 12. TimberGlow Bracelets Free Research Preview. ChatGPT may produce inaccurate information about people, pla",
            "per_shot_summaries": "Shot 62: A screenshot from a MacBook shows a chat with AI developed by OpenAI, as the speaker seeks a name for his craft business."
        },
        {
            "start": 53.637,
            "end": 54.7631,
            "text_on_screen": "13. FlameStitched Jewelry 14. Fiery Baubles 15. SmokyCharms 16. KindledKnots 18. FlamingBeads 19. PyroBangles 20. Enflamed Accents 21. AshenGems 17. 'EmberEtch Bracelets 23. Burnished Beads 24. Scorch Marked Jewelry 25. WoodPyro Bracelets 22. TorchCrafted Brace etiRTok",
            "per_shot_summaries": "Shot 63: The AI bot provides numerous business name suggestions for a wood burned bead bracelet business."
        },
        {
            "start": 54.7631,
            "end": 56.8902,
            "text_on_screen": "1340 COLLECTIVE LOS",
            "per_shot_summaries": "Shot 64: The speaker scrolls through social media on his smartphone, preparing for the marketing phase of his venture."
        },
        {
            "start": 56.8902,
            "end": 58.9756,
            "text_on_screen": "I have a question. Can you help? Business Inquiry š h there would you let your page During the would be making bead The 123 space I'm would be live streaming and making bead bracelets with custom wood burned beads. I would be willing to pay you During the couple hours ! $40 for these 2 hours. Please would be lives making bead bracelets w custom wood burned beads. return let me know! Thanks!",
            "per_shot_summaries": "Shot 65: He drafts a business inquiry message proposing to rent a social media page for live streaming his bead crafting process."
        },
        {
            "start": 58.9756,
            "end": 59.1842,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 66: The speaker is seen cutting some string at a table, marking the beginning of his live crafting session."
        },
        {
            "start": 59.1842,
            "end": 59.5179,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 67: The camera focuses on a three-hand object on the table, potentially used in the crafting process."
        },
        {
            "start": 59.5179,
            "end": 59.7264,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 68: Crafting materials are arranged on the table, ready for the live session."
        },
        {
            "start": 59.7264,
            "end": 60.5189,
            "text_on_screen": "Premium",
            "per_shot_summaries": "Shot 69: The speaker holds up a sign displaying his handmade wooden beads priced at 20 dollars, earmarking the commercial launch of his product."
        },
        {
            "start": 60.5189,
            "end": 61.1028,
            "text_on_screen": "All wood BRACELE Tap to add a description... Earn Stars Enabled Go Live",
            "per_shot_summaries": "Shot 70: The crafting supplies for the bead bracelet are displayed against the backdrop of the individual's streaming setup."
        },
        {
            "start": 61.1028,
            "end": 61.7284,
            "text_on_screen": "BRACELETS Premium $20",
            "per_shot_summaries": "Shot 71: The bead collection is showcased as the bracelet live stream session is underway."
        },
        {
            "start": 61.7284,
            "end": 61.7701,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 72: The speaker sits in front of the live streaming setup, facing the camera. No dialogue is provided in this shot."
        },
        {
            "start": 61.7701,
            "end": 62.312312312312315,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 73: The video concludes with a shot of the speaker, wearing a hoodie and a backpack, sitting at a desk with his laptop and a tripod, reflecting on his new entrepreneurial venture."
        }
    ],
    [
        {
            "start": 0,
            "end": 2.47351,
            "text_on_screen": "TikTok @alluredbeauty",
            "per_shot_summaries": "In the first shot, a woman with glasses is shown holding a large slice of bread, while exclaiming that she's cooking a 20-pound burger for dinner."
        },
        {
            "start": 2.47351,
            "end": 9.29238,
            "text_on_screen": "Tik Tok",
            "per_shot_summaries": "In the next shot lasting seven seconds, the woman is seen in the kitchen holding up a bagel, stating the ingredients needed for a large burger including a seven pound patty, a five pound bun and three to five pounds of vegetables."
        },
        {
            "start": 9.29238,
            "end": 13.0361,
            "text_on_screen": "AECCIE",
            "per_shot_summaries": "In the following shot, the woman, holding up an organic diet guide, ponders about purchasing a new kitchen gadget."
        },
        {
            "start": 13.0361,
            "end": 22.9301,
            "text_on_screen": "",
            "per_shot_summaries": "In the fourth shot, the woman stands before a box filled with fruits and vegetables, expressing her desire to purchase a vegetable chopper which she has held off buying for a year as she believes it will ease her kitchen work."
        },
        {
            "start": 22.9301,
            "end": 25.7044,
            "text_on_screen": "",
            "per_shot_summaries": "During the fifth shot, the woman reiterates her expectation that the gadget will help in saving her time."
        },
        {
            "start": 25.7044,
            "end": 31.9216,
            "text_on_screen": "",
            "per_shot_summaries": "The sixth shot shows an employee using a green toaster to prepare bread while the woman discusses other features of the gadget, stating it includes dicers."
        },
        {
            "start": 31.9216,
            "end": 37.5372,
            "text_on_screen": "",
            "per_shot_summaries": "The seventh shot demonstrates the woman slicing something that falls straight into a receptacle, suggesting it's a convenient way of prepping ingredients."
        },
        {
            "start": 37.5372,
            "end": 42.4508,
            "text_on_screen": "",
            "per_shot_summaries": "In the following shot, she continues to swipe a grater by Tekniq across an onion hinting at its effectiveness in chopping onions perfectly."
        },
        {
            "start": 42.4508,
            "end": 45.0914,
            "text_on_screen": "",
            "per_shot_summaries": "The ninth shot simply shows the woman placing chopped onions in a plastic container."
        },
        {
            "start": 45.0914,
            "end": 47.8323,
            "text_on_screen": "",
            "per_shot_summaries": "In the tenth shot, a compliment is rendered to the quality of the chopped tomatoes as they are placed on a sandwich."
        },
        {
            "start": 47.8323,
            "end": 60.4673,
            "text_on_screen": "",
            "per_shot_summaries": "In the eleventh shot, the woman shows how to use a feature of the gadget to make french fries to be used in the burger recipe, by pushing a potato into a grater."
        },
        {
            "start": 60.4673,
            "end": 69.02430056489621,
            "text_on_screen": "",
            "per_shot_summaries": "The final shot shows two vegetable graters on a table while the woman announces their affordable pricing and that they can be purchased via a yellow shopping cart."
        }
    ],
    [
        {
            "start": 0,
            "end": 0.888889,
            "text_on_screen": "we actually don't have a TV for our bedroom @mamaruppert DeaPLAY PJ80 MULTIMEDIA Full HD 1080P Projector",
            "per_shot_summaries": "Shot 1 Summary: The video starts with an explanation on why they chose a PJ80 MULTIMEDIA Full HD 1080P Projector for their bedroom."
        },
        {
            "start": 0.888889,
            "end": 2.8,
            "text_on_screen": "and we have a long dresser in front of our bed",
            "per_shot_summaries": "Shot 2 Summary: The video moves on to talk about their bedroom setup of having a long dresser at the foot of the bed."
        },
        {
            "start": 2.8,
            "end": 3.71111,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3 Summary: This shot provides a visual of a box for a vacuum cleaner, however, no direct reference is related to the narrative."
        },
        {
            "start": 3.71111,
            "end": 5.51111,
            "text_on_screen": "so we didn't want to have",
            "per_shot_summaries": "Shot 4 Summary: The video continues discussing their bedroom setup further, emphasizing their preference to avoid a large television in front of their bed."
        },
        {
            "start": 5.51111,
            "end": 6.82222,
            "text_on_screen": "So we didn't want to have like a huge TV",
            "per_shot_summaries": "Shot 5 Summary: In this shot, the video further emphasizes their decision against having a large TV in the bedroom."
        },
        {
            "start": 6.82222,
            "end": 8.42222,
            "text_on_screen": "so we opted for a projector instead",
            "per_shot_summaries": "Shot 6 Summary: The shot reveals that they opted to go for a projector as an alternative to having a huge TV."
        },
        {
            "start": 8.42222,
            "end": 9.68889,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7 Summary: This shot reinforces their decision to opt for a projector, showing a visual of a woman folding a suitcase."
        },
        {
            "start": 9.68889,
            "end": 11.8667,
            "text_on_screen": "So we opted for a projector I found this one on the TikTok shop",
            "per_shot_summaries": "Shot 8 Summary: The video mentions that the projector was purchased from the TikTok shop."
        },
        {
            "start": 11.8667,
            "end": 16.1111,
            "text_on_screen": "and I am actually really pleased with it my husband even was such a sweetheart and used his skills",
            "per_shot_summaries": "Shot 9 Summary: The narrator expresses their satisfaction with the projector and appreciation for the husband who helped set it up."
        },
        {
            "start": 16.1111,
            "end": 18.6444,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10 Summary: The video shows the installation of an RV wall mount but the shot isn't directly referenced."
        },
        {
            "start": 18.6444,
            "end": 20.9111,
            "text_on_screen": "like he has been doing since we moved into this house",
            "per_shot_summaries": "Shot 11 Summary: Here, the husband's handy skills are further acknowledged, the ones which he's been using around the house since they moved in."
        },
        {
            "start": 20.9111,
            "end": 23.3778,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 12 Summary: The video hints towards the numerous tasks that the husband has been doing ever since they shifted into the house, visually showing a mattress installation."
        },
        {
            "start": 23.3778,
            "end": 25.1556,
            "text_on_screen": "and he built a little shelf for the projector",
            "per_shot_summaries": "Shot 13 Summary: The video reveals how the husband built a little shelf for the projector."
        },
        {
            "start": 25.1556,
            "end": 28.0889,
            "text_on_screen": "he actually used the other half of our headboard and just cut a little piece off",
            "per_shot_summaries": "Shot 14 Summary: The husband's ingenuity is further highlighted as he repurposes a portion of their headboard to create a shelf for the projector."
        },
        {
            "start": 28.0889,
            "end": 30.9778,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15 Summary: Continued narration of how the little shelf was made from the other half of their headboard, accompanied by visuals of bed cleaning."
        },
        {
            "start": 30.9778,
            "end": 34.2444,
            "text_on_screen": "and made this cute little shelf",
            "per_shot_summaries": "Shot 16 Summary: The video discusses the creation of a small charming shelf."
        },
        {
            "start": 34.2444,
            "end": 36.2667,
            "text_on_screen": "it was perfect because then we didn't have to hang it from the ceiling",
            "per_shot_summaries": "Shot 17 Summary: It's revealed that the solution was perfect as it eliminated the need to hang the projector from the ceiling."
        },
        {
            "start": 36.2667,
            "end": 37.7778,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 18 Summary: The shot reinforces the convenience of not having to hang the projector from the ceiling."
        },
        {
            "start": 37.7778,
            "end": 43.2,
            "text_on_screen": "and let me tell you the quality of this projector Owas blown away with like our walls aren't even completely white",
            "per_shot_summaries": "Shot 19 Summary: The picture quality of the projector is put into limelight with the narrator expressing their astonishment even though their walls aren’t fully white."
        },
        {
            "start": 43.2,
            "end": 48.8444,
            "text_on_screen": "they're this like weird pattern but look at how crisp that picture is",
            "per_shot_summaries": "Shot 20 Summary: The video shows a projected image on a patterned wall, complimenting the crispness of the picture from the projector."
        },
        {
            "start": 48.8444,
            "end": 49.8444,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 21 Summary: This shot visually displays a movie screen with the wall making it resemble human eyes."
        },
        {
            "start": 49.8444,
            "end": 52.3778,
            "text_on_screen": "we were watching Wall-E and oh my God I was like",
            "per_shot_summaries": "Shot 22 Summary: They discuss watching Wall-E on the projector and their amazement at the video quality."
        },
        {
            "start": 52.3778,
            "end": 56.3778,
            "text_on_screen": "blown away with how good the quality looks (SERVOS WHIRRING WEAKLY) TikTok it literally feels like we have a little movie theater in our bedroom",
            "per_shot_summaries": "Shot 23 Summary: The video concludes with rave reviews for the projector's quality, expressing it makes their bedroom feel like a mini movie theater."
        },
        {
            "start": 56.3778,
            "end": 54.62222222222222,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 24 Summary: The final shot shows a home theater system with an image of a robot on it but no information from the narrative or the scene itself is provided."
        }
    ],
    [
        {
            "start": 0,
            "end": 7.03333,
            "text_on_screen": "This $1.00 ol Buying my own product at a beauty supply store... :I love these new durags you guys have... oh yea man they're nice",
            "per_shot_summaries": "\"Shot 1: Two men have a discussion in a drug store about one's product available there, praising the new durags on offer."
        },
        {
            "start": 7.03333,
            "end": 8.3,
            "text_on_screen": "ey're nice",
            "per_shot_summaries": "Shot 2: One man is shown examining some items in the store."
        },
        {
            "start": 8.3,
            "end": 12.5,
            "text_on_screen": "HISPANICS HISPANIC HISPANI This regis Cloy O: Never seen them anywhere before 99 This register",
            "per_shot_summaries": "Shot 3: Tyga, capturing how shopping is done at the local drugstore, comments about never seeing some products elsewhere."
        },
        {
            "start": 12.5,
            "end": 24.5333,
            "text_on_screen": "??? ISPA SPAN SPA R.ORG : it's so new I don't even know the price... : it's so new l don't even know TAR.OR EAT MIN AMIN bao ÞRG SARA ZING ONA",
            "per_shot_summaries": "Shot 4: An elderly man is seen in the store, scrutinizing something on his phone."
        },
        {
            "start": 24.5333,
            "end": 24.6833,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 5: A man at the counter proceeds to take photographs of items in the store."
        },
        {
            "start": 24.6833,
            "end": 31.3167,
            "text_on_screen": "Please This registe This regist done This regi OLAPL Clos",
            "per_shot_summaries": "Shot 6: The subject converses about a belief that certain products will be found - the visuals in the shot goes unspecified."
        },
        {
            "start": 31.3167,
            "end": 35.1167,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 7: Discussion about the possibility of being given a randomized price takes place - no specific visuals are described."
        },
        {
            "start": 35.1167,
            "end": 35.1833,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 8: A store clerk is seen showing his mobile phone to the cashier."
        },
        {
            "start": 35.1833,
            "end": 20.216666666666665,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 9: A shot is presented without any associated audio or visual elements described."
        }
    ],
    [
        {
            "start": 0,
            "end": 0.833333,
            "text_on_screen": "with Aveeno's Calm & Restore Products @homeoflerM RNING SKINCARE @homeoflerMORNING SKINCARE",
            "per_shot_summaries": "\"Shot 1: The shot lasts for 1 second and features a morning skincare routine video with Aveeno's Calm & Restore Products text appearing on the screen."
        },
        {
            "start": 0.833333,
            "end": 2.4,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 2: It is a 2-second shot with an audio of someone talking about using Aveeno's calm skincare routine on a cold day."
        },
        {
            "start": 2.4,
            "end": 2.86667,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 3: Although the shot doesn't last for any second, it features a morning skincare routine in the kitchen with a spoken audio line 'and restart.'"
        },
        {
            "start": 2.86667,
            "end": 4.4,
            "text_on_screen": "Restore NOURISHING Sensitive Skin to preserve skin's moisture barrier FRAGRANCE FREE NOURISH @homeoflemons my skin has been feeling extra @homeoflemons Aveeno. Genty cleanseshydrate",
            "per_shot_summaries": "Shot 4: In this 2-second shot, there's a person holding a bottle of Aveeno facial cleanser, with on-screen text about skin feeling extra dry and irritated."
        },
        {
            "start": 4.4,
            "end": 8.03333,
            "text_on_screen": "dry and irritated the last few weeks so I have switched to using more calm",
            "per_shot_summaries": "Shot 5: This 4-second shot features a woman washing her hands under the sink, and the audio remarks on using more calming and soothing products due to dry and irritated skin."
        },
        {
            "start": 8.03333,
            "end": 11.6,
            "text_on_screen": "and soothing products The Gentle Nourishing Oat Face Cleanser",
            "per_shot_summaries": "Shot 6: It's a 4-second shot which shows face washing products for acne with an audio discussing the benefits of gentle nourishing O'Face."
        },
        {
            "start": 11.6,
            "end": 13.4333,
            "text_on_screen": "hydrates the skin to preserve its moisture barrier",
            "per_shot_summaries": "Shot 7: This 2-second shot has a person washing their hands on the faucet, while the audio speaks on hydrating the skin to preserve moisture."
        },
        {
            "start": 13.4333,
            "end": 14.8,
            "text_on_screen": "using oat and feverfew",
            "per_shot_summaries": "Shot 8: A woman is cleaning her teeth in the bathroom mirror during this 1-second shot, with shot audio mentioning use of oat and feverfew for skincare."
        },
        {
            "start": 14.8,
            "end": 16.2,
            "text_on_screen": "eno Calm Res are",
            "per_shot_summaries": "Shot 9: This 1-second shot has a person applying cream on wooden shelves with audio explaining the benefits of using oat and feverfew."
        },
        {
            "start": 16.2,
            "end": 19.8333,
            "text_on_screen": "This Triple Oat Serum TRIPLE OAT SERUM protects and smooths out my dry and irritated skin",
            "per_shot_summaries": "Shot 10: This 4-second shot shows a woman applying a skincare product, with an on-screen text and audio discussing how Triple Oat Serum protects and smooths out dry and irritated skin."
        },
        {
            "start": 19.8333,
            "end": 24.3667,
            "text_on_screen": "to finish off my skincare I moisturize with the Oat Ge Moisturizer I love how lightweight it feels",
            "per_shot_summaries": "Shot 11: Lasting for 5 seconds, this shot depicts a woman cleaning her face in a bathroom mirror while discussing moisturizing with oat gel moisturizer in the shot audio."
        },
        {
            "start": 24.3667,
            "end": 27.9333,
            "text_on_screen": "Calin and it leaves my skin hydrated for up to 24 hours AT GEL MOISTURIZE",
            "per_shot_summaries": "Shot 12: In this 4-second shot, a cream can is being shown with a hand, and the shot audio talks about how the product leaves the skin hydrated for up to 24 hours."
        },
        {
            "start": 27.9333,
            "end": 28.6667,
            "text_on_screen": "so now that my skin is feeling hydrated and glowy",
            "per_shot_summaries": "Shot 13: This 1-second shows a skin-healing night cream with the shot audio mentioning that the skin is starting to feel hydrated and glowy."
        },
        {
            "start": 28.6667,
            "end": 33.3,
            "text_on_screen": "I'm ready to tackle the day Try Aveeno's Calm and Restore today. You can shop online or at most retailers!",
            "per_shot_summaries": "Shot 14: In this 5-second shot, a woman is brushing her face in front of a mirror while the audio suggests that with the hydrated and glowy skin, she is ready to tackle the day."
        },
        {
            "start": 33.3,
            "end": 36.333333333333336,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 15: Lasting for 3 seconds, the shot featured a woman in a jumpsuit walking in her bathroom with the audio mentioning where Aveeno's Calm and Restore products can be bought. \""
        }
    ],
    [
        {
            "start": 0,
            "end": 2.73333,
            "text_on_screen": "all over the windows. already told you to stop NI already told you to stop",
            "per_shot_summaries": "Shot 1 features the task of cleaning room windows in less than 10 minutes, subtly supported by text on screen indicating it's time to stop."
        },
        {
            "start": 2.73333,
            "end": 6.26667,
            "text_on_screen": "@biglifejournalofficial Now I have to...\"",
            "per_shot_summaries": "In Shot 2, a young girl is seen cleaning a classroom window with some text, likely a username, briefly displaying."
        },
        {
            "start": 6.26667,
            "end": 8.16667,
            "text_on_screen": "Tik Tok @biglifejournal official",
            "per_shot_summaries": "Shot 3 continues with a scene of a woman cleaning her classroom window, cut with brief text identifying the account."
        },
        {
            "start": 8.16667,
            "end": 11.3333,
            "text_on_screen": "if you're still in the process of raising children",
            "per_shot_summaries": "An older man addressing a crowd is seen in Shot 4, with text punctuating his point about the process of raising children, echoed by the shot's own audio."
        },
        {
            "start": 11.3333,
            "end": 14.5667,
            "text_on_screen": "be aware that the tiny fingerprints that show up JTikTok J TikTok",
            "per_shot_summaries": "Shot 5 further communicates a tangential story about recognizing the signs of children's presence, seen in a text visually juxtaposed over an image of a door with no lock."
        },
        {
            "start": 14.5667,
            "end": 17.9333,
            "text_on_screen": "on almost every newly cleaned surface, @bigfejournalofficial @biglitejournalofficial @biglifeournalofficial",
            "per_shot_summaries": "Shot 6 shows the repair of a glass door while audio remarks on the traces left by children, indirectly referring to the previous window-cleaning activity."
        },
        {
            "start": 17.9333,
            "end": 19.9333,
            "text_on_screen": "the toys scattered about the house, TikTok",
            "per_shot_summaries": "The seventh shot body of text and audio add to the narrative by highlighting scattered toys, accompanied visually by a table full of toys that could be an advertisement."
        },
        {
            "start": 19.9333,
            "end": 21.4667,
            "text_on_screen": "about the house, J TikTok",
            "per_shot_summaries": "Shot 8 then features a children’s playroom cluttered with toys and boxes, with the shot's audio further emphasizing the state of the house."
        },
        {
            "start": 21.4667,
            "end": 23.2,
            "text_on_screen": "the piles and piles TikTok",
            "per_shot_summaries": "The context of toys continues in Shot 9, which shows a room crowded with books, toys, and clothes. The audio's mention of \"piles and piles\" further enhances the image."
        },
        {
            "start": 23.2,
            "end": 25.0333,
            "text_on_screen": "",
            "per_shot_summaries": "Shot 10 focuses on a basket holding laundry on a tile floor with an audio transcript indicating these scenes will disappear suggesting a passage of time."
        },
        {
            "start": 25.0333,
            "end": 28.5667,
            "text_on_screen": "will disappear all too soon",
            "per_shot_summaries": "In Shot 11, a man is seen giving a speech, but without audio. The text, however, suggests a continuation of the disappearing theme."
        },
        {
            "start": 28.5667,
            "end": 31.5,
            "text_on_screen": "and that you will, to your surprise,",
            "per_shot_summaries": "Shot 12 presents a little girl holding her mother's hand while walking down a hallway but with text suggesting that these moments will surprisingly be missed."
        },
        {
            "start": 31.5,
            "end": 35.166666666666664,
            "text_on_screen": "miss them profoundly.",
            "per_shot_summaries": "Concluding with Shot 13, a sentiment particularly striking for parents is made: the visual depicts baby care and stroller products while the text points to a profound feeling of missing these times."
        }
    ]
]