[
    {
        "tiny_desc": "Salad montage",
        "description": "Montage of making a salad over a popular song",
        "user": "nourished.by.mads",
        "caption": "This salad is actually AMAZING 🥗 - no joke. Ingredients and measuring portions are all listed in the video ♥️ #salad #saladrecipe #jenniferanistonsalad #friendstvshow #jeniferaniston",
        "likes": "174.0K",
        "comments": "535",
        "bookmarks": "10.4K",
        "shares": "3956",
        "originalSound": "Just a Cloud Away - @Pharell Williams ",
        "url": "videos/05.mp4",
        "video_description": "The video begins with a woman presenting a salad, supposedly consumed daily by Jennifer Aniston during the filming of 'Friends', according to a TikTok video by @nourished.by.mads. The preparation of the salad is shown, starting with 3 cups of cooked quinoa. Subsequently, a variety of ingredients are added, including 1 cup of cucumber, 1/3 cup of red onion, 1/2 cup each of roasted, salted pistachios, mint, parsley, and feta cheese, as well as chickpeas. Lemons are juiced into the mixture for added taste, whilst 1/4 cup of olive oil and a sprinkle of salt and pepper garnish the salad. The ingredients are mixed together with a wooden spoon. The final narration shows a woman tasting the salad, again referencing the fact that it was a favored meal of Jennifer Aniston. The video concludes with the TikTok logo and the handle of @nourished.by.mads.",
        "summary_10": "Video shows woman making Jennifer Aniston's rumored 'Friends' quinoa salad.",
        "summary_25": "The video features a woman preparing a quinoa salad, rumored to be Jennifer Aniston's daily 'Friends' set meal, according to TikTok's @nourished.by.mads.",
        "summary_50": "The video showcases a woman preparing and tasting a quinoa salad, attributed to Jennifer Aniston's diet on the 'Friends' set, based on a TikTok by @nourished.by.mads. The salad is made from quinoa, cucumber, red onion, pistachios, mint, parsley, feta, chickpeas, lemon juice, olive oil, salt, and pepper.\n",
        "ocr": "Let's make the salad Jennifer Aniston ate every day on the set of Friends\n3 cups cooked quinoa\n1 cup cucumber\n1/3 cup red onion\n1/2 cup roasted, salted pistachios 1/2 cup mint 1/2 cup parsley 1/2 cup feta cheese 115 oz can chickpeas 1 15 oz can chickpeas\n2 lemons, juiced\n1/4 cup olive oil\nSalt & pepper",
        "shot_descriptions": "SHOT 1: A 3-second shot showing a lady holding a large salad bowl, mentioning she is making the salad Jennifer Aniston ate every day on the set of Friends.\n SHOT 2: In a 3-second span, we see a visual guide to preparing 3 cups of cooked quinoa.\nSHOT 3: For another 3 seconds, cucumbers in a cup appear on the screen.\nSHOT 4: We watch someone mixing cucumbers and red onions in a bowl over 3 seconds, with text stating 1/3 cup of red onion is used.\nSHOT 5: A relatively long shot, 13 seconds, emphasizing preparing various salad ingredients: 1/2 cup of pistachios, mint, parsley, feta cheese, and chickpeas.\nSHOT 6: For 3 seconds, the screen shows lemon juice being poured over the chickpea salad.\nSHOT 7: Olive oil is then shown to be added to the kale salad with chickpeas, all in 3 seconds.\nSHOT 8: In the shortest shot, 2 seconds, we see salt and pepper being added to the salad.\nSHOT 9: An image of a completed salad in a bowl in a kitchen for 2 seconds, with a wooden spoon on top. No text nor audio associated.\nSHOT 10: The last meaningful shot ends with a woman eating the salad in front of the camera for 4 seconds."
    },
    {
        "tiny_desc": "Dog toy babies",
        "description": "Dog showing off its toys with song that references \"babies\"",
        "user": "miss_noodles23",
        "caption": "Daisy’s little chippys #aussiesdoingthings  #littlebabies  #australianshepherd",
        "likes": "247.1K",
        "comments": "861",
        "bookmarks": "4353",
        "shares": "671",
        "originalSound": "original sound - linda.belcher.everyday",
        "url": "videos/00.mp4",
        "video_description": "The short video is a compilation of two shots from TikTok, posted by a user named \"@miss_noodles23\". The first shot, which lasts for 6 seconds, shows a dog, presumably named Miss Noodles, laying next to stuffed animals on a wooden floor. A text overlay on this shot introduces the user’s TikTok handle and also includes a few repeated lines of lyrics: \"If you aren't real, then how come I feel this way\", and the phrase \"little babies\". This audio, featuring the same lines, plays throughout this shot. The video switches to the next shot relatively quickly, lasting for four seconds. In this shot, the TikTok logo is presented on a stark black background, with no audio or supporting text.",
        "summary_10": "TikTok video by \"@miss_noodles23\": dog, lyrics, and silent logo display.",
        "summary_25": "The video features two TikTok shots by \"@miss_noodles23\": a dog with stuffed toys and lyrics, followed by a silent TikTok logo display.",
        "summary_50": "The video consists of two TikTok shots from \"@miss_noodles23\". The first shows a dog alongside stuffed animals, there is a lyrical text and audio. The second shot briefly displays the TikTok logo, without any audio.",
        "ocr": "If you're not real then how come I feel this way little babies",
        "shot_descriptions": "Shot 1: A 6-second shot featuring a resting dog on stuffed toys. As the dog looks up towards the camera, the onscreen text and audio voiceover pose the question, 'If you're not real, then how come I feel this way? Little babies?'"
    },
    {
        "tiny_desc": "Pasta recipe",
        "description": "Recipe video with a detailed step-by-step",
        "user": "mealsandmunchies",
        "caption": "An easy dinner for a busy weeknight! #dinner #familydinner #dinnerrecipe #dinnerideas#food #cooking #easyrecipe #pasta #weeknightdinner #lazycooking #easymeal #meal#fyp #foryou #familydinner #cheapdinner #familymeal",
        "likes": "4.2M",
        "comments": "14.9K",
        "bookmarks": "1.0M",
        "shares": "452.8K",
        "originalSound": "original sound - mealsandmunchies",
        "url": "videos/01.mp4",
        "video_description": "The video is a short and engaging cooking tutorial from TikTok user 'mealsandmunchies'. It shows the viewer how to prepare a quick and simple meal using only five ingredients. The cooking process begins with the heating of ground beef or turkey in a skillet, while simultaneously boiling a pot of water. Once the water boils, tortellini is added. The next step involves the shredding of mozzarella cheese, with the shredder linked on the user's Amazon storefront being recommended. The meat is seasoned with salt, pepper, Italian seasoning, and crushed red chili flakes. After this, a jar of marinara sauce and a block of cream cheese are mixed into the cooked meat. The cooked tortellini is then added to this mixture. The dish is topped with the previously shredded mozzarella cheese and is baked for 10 minutes at 350 degrees. The video ends with the user encouraging viewers to follow her for more quick and easy recipes. The video takes a brief advertising detour towards the end, mentioning that TikTok is the first app that users should download.\n",
        "summary_10": "TikTok's 'mealsandmunchies' provides a quick five-ingredient meal tutorial.",
        "summary_25": "This is a brief TikTok video from 'mealsandmunchies' showing how to quickly prepare a five-ingredient meal. It promotes the user's Amazon store and encourages TikTok downloads.",
        "summary_50": "The video, a tutorial from TikTok user 'mealsandmunchies', demonstrates a quick meal preparation using five ingredients. Steps include cooking meat and tortellini, shredding mozzarella cheese, seasoning, adding marinara and cream cheese, topping with mozzarella, and baking. The user's Amazon store's shredder is promoted, and followers are urged to download TikTok.",
        "ocr": "None",
        "shot_descriptions": "Shot 1: The video starts with a duration of 6 seconds of a man putting cheese on a skillet full of macaroni while speaking about the simplicity and deliciousness of the impending dinner dish which necessitate only five things.\nShot 2: In the following 2 seconds, we see a person using tongs to cook ground beef or turkey in a skillet while also suggesting boiling a pot of water.\nShot 3: Over the next 3 seconds, the shot focuses on the continued preparation of ground beef in a pan on the stove, while recommending to add tortellini once the water boils.\nShot 4: During a 4-second shot, we see an individual grinding garlic in a food processor and talking about shredding some mozzarella cheese according to the package.\nShot 5: The next shot lasting 1 second shows a person adding shredded cheese to a bowl, while simultaneously suggesting a recommended product on Amazon.\nShot 6: Over the course of 4 seconds, we watch ground meat being sprinkled with spices in a pan while the speaker mentions their storefront and suggests seasoning the meat with salt, pepper, and Italian seasoning.\nShot 7: With a duration of 3 seconds, the video shows a burger being fried in a pan, complemented by the addition of crushed chili flakes and instructions to drain.\nShot 8: The following 2-second clip showcases a person pouring marinara sauce over the meat in a skillet while talking about it.\nShot 9: Continuing with the 2-second segment, the cooking process progresses to incorporating meat and tomato sauce in a pan while suggesting adding a block of cream cheese.\nShot 10: The next three seconds capture the process of cooking beef in a pan with tomato sauce and cheese, hinting at the addition of the already cooked tortellini.\nShot 11: A brief, one-second scene shows the person preparing a pasta dish with spaghetti sauce.\nShot 12: This one-second shot portrays the preparation of a tortellini dish in a large pan.\nShot 13: Another swift shot lasting only a second focuses on the addition of mozzarella cheese to a skillet filled with food.\nShot 14: The video then moves to a frying pan brimming with cheese-coated pizza and bakes it for 10 minutes.\nShot 15: An iRobot cooking scene goes by in a single second mention of baking at 350 degrees.\nShot 16: Over 3 seconds, a young blonde woman is depicted enjoying a plateful of the cooked dish, as the speaker prompts the viewer to follow their channel for more recipes.\n"
    },
    {
        "tiny_desc": "Tired cat",
        "description": "Video of cat yawning and audio about being drained after a long day",
        "user": "ichysmom",
        "caption": "He works so hard to feed his family #catsoftiktok #cattok #foryou #fyp",
        "likes": "1.8M",
        "comments": "6687",
        "bookmarks": "110.7K",
        "shares": "24.4K",
        "originalSound": "original sound - joegunn",
        "url": "videos/02.mp4",
        "video_description": "The short video consists of two shots, with a total duration of 10 seconds. The first part of the video, lasting six seconds, features a white cat yawning and looking drowsy on a bed. Throughout this shot, a humorous text overlay is displayed, describing the cat's typical day such as sleeping for 18 hours, pestering its owner by stomping on their head at 4:00 am until it is fed, and playfully fighting with its sibling. A dialogue can be heard in the background, saying \"Lord have mercy. Hmm. They drink me.\" However, this doesn't seem to relate directly to the cat's actions at the moment. The second shot, lasting for four seconds, shows the TikTok logo prominently displayed against a black background. No dialogue or text accompanies this shot, marking the end of the video.",
        "summary_10": "Humorous video of white cat's daily antics, ending with TikTok.",
        "summary_25": "The video humorously portrays a white cat's daily routine of prolonged sleep, pestering its owner for food, and sibling fights, concluding with the TikTok logo.",
        "summary_50": "This 10-second video showcases a white cat's humorous daily antics ending with TikTok's logo. The cat, known for sleeping 18 hours, pokes the owner until fed, and playfully fights its sibling. A voiceover shares unrelated dialogue, and the video concludes without any accompanying text or dialogue.",
        "ocr": "my cat after sleeping for 18 hours, stomping on my head at 4:00am until i fed him, and beating up his little brother for no reason",
        "shot_descriptions": "Shot 1: A 6-second shot featuring a white cat yawning and lying down. The on-screen text refers to the cat's mischievous behavior, like sleeping for 18 hours, stomping on someone's head at early morning, and showing aggression towards its sibling. The audio transcript reveals someone remarking 'Lord have mercy' as if in disbelief, and comments about the cat's drinking."
    },
    {
        "tiny_desc": "Woman singing",
        "description": "Woman singing a song to the camera",
        "user": "elysebelll",
        "caption": "this song and scene raised me🫶 rest in peace olivia🥺 #hopelesslydevoted2u",
        "likes": "61.6K",
        "comments": "598",
        "bookmarks": "4133",
        "shares": "469",
        "originalSound": "original sound - elysebelll",
        "url": "videos/03.mp4",
        "video_description": "The short form video revolves around a young girl, identified as @elysebelll from her TikTok profile which is displayed as text on the screen. She is seen sitting at a table, clad in a white top and green pants. The duration of this shot is quite long, lasting 78 seconds and is accompanied by an audio transcript where it's indicated that she is expressing her emotions through her heart's song titled 'Don't Let Go', portraying feelings of hopelessness. The video concludes with a brief 4-second shot displaying the TikTok logo set against a dark backdrop. There is no audio transcript in this last shot. This video appears to be a emotional recital shared through the social media platform TikTok.",
        "summary_10": "Video features @elysebelll singing emotionally on TikTok, ends with logo.",
        "summary_25": "The video showcases @elysebelll, singing 'Don't Let Go' on TikTok, dressed in white and green. Concludes with a TikTok logo display.",
        "summary_50": "The video features a girl @elysebelll, expressing her emotions through a song 'Don't Let Go' in a 78-second TikTok clip. She's clad in white and green, seated at a table. The video ends with a 4-second display of the TikTok logo.",
        "ocr": "None",
        "shot_descriptions": "Shot 1 is 78 seconds long displaying a young girl standing at a desk with her arm behind her back. She is heard singing with the lyrics, 'I hate to see my heart is singing. Don't Let Go. Hopelessly."
    },
    {
        "tiny_desc": "Dog in pool",
        "description": "Dog jumping in pool, no added audio",
        "user": "abrollerguy",
        "caption": "#englishlabradors",
        "likes": "218",
        "comments": "218",
        "bookmarks": "1120",
        "shares": "2148",
        "originalSound": "original sound - abrollerguy",
        "url": "videos/04.mp4",
        "video_description": "The short-form video comprises two shots. The first shot, lasting for 5 seconds, shows two dogs energetically leaping over a swimming pool located in a backyard. The accompanying audio records someone excitedly exclaiming \"Wait, wait. Wait, wait.\" The scene is accentuated with the text \"TikTok Tik Tok\" displayed on the screen, pointing to the popular social media platform. The very next shot transitions to a static image of the recognizable TikTok logo paired with a depiction of the TikTok app interface open on a device. Interestingly, this second shot is devoid of any accompanying audio or on-screen text and lasts for 4 seconds. With its visual storytelling, the video utilizes the popularity of pets and social media, specifically TikTok, creating a possibly engaging and modern spectator experience.\n",
        "summary_10": "Video features dogs jumping, \"Wait, wait\" audio, and TikTok branding.",
        "summary_25": "The video showcases two dogs jumping over a pool with \"Wait, wait,\" audio and TikTok motifs, corroborating pet fondness and social media.",
        "summary_50": "A short video features two dogs jumping over a pool, with audio exclaiming \"Wait, wait.\" Text reads \"TikTok Tik Tok.\" It transitions to a TikTok logo and app interface in silent, demonstrating the blend of pet enthusiasm and social media.",
        "ocr": "None",
        "shot_descriptions": "Shot 1: A 5-second shot featuring two dogs frolicking in the pool under the sunshine. The screen text reads 'TikTok Tik Tok' and there's someone exclaiming 'Wait, wait. Wait wait.'"
    }
]