[
    {
        "tiny_desc": "Falling in pool",
        "description": "Dad fell in pool during a conference call ",
        "user": "ola.unithaha",
        "caption": "Video funny & cute #funnyvideos #funny #fyp #cute #xuhuong",
        "likes": "2.3 Million",
        "comments": "17K",
        "bookmarks": "142.3K",
        "shares": "65.6K",
        "originalSound": "original sound - Animals funny ☠️",
        "url": "videos/40.mp4",
        "video_description": "The short-form video features a humorous scenario where a man, referred to as 'Dad', accidentally falls into a pool while on a conference call. Despite the mishap, he continues the call unfazed, creating a comedic moment. The video, originating from TikTok, was posted by the user @brycehamilton_3 and then reshared on @funny123us. This mishap is introduced and elaborated in the on-screen text that accompanies the video, with the text indicating that the video was capturing the moment when the dad slipped into the pool during a conference call and proceeded with the call nonchalantly. The funny incident is briefly encapsulated in the audio transcript through the statement \"I'm home.\"",
        "summary_10": "\"Dad\" humorously continues conference call despite falling into pool.",
        "summary_25": "The video humorously captures 'Dad', undeterred by a fall into the pool, continuing his conference call. Laughter unfolds via on-screen text and \"I'm home\".",
        "summary_50": "The video humorously shows a man, 'Dad', continuing a conference call despite accidentally falling into a pool. Originating from TikTok by user @brycehamilton_3 and reposted on @funny123us, the on-screen text and the phrase \"I'm home\" highlight the comedic moment.",
        "ocr": "My dad slipped into the pool on a conference call and kept talking",
        "shot_descriptions": "The first shot lasts for 14 seconds and shows a dad unintentionally slipping into a pool while being on a conference call. The accompanying audio indicates someone stating that they're home."
    },
    {
        "tiny_desc": "Muffin man joke",
        "description": "Person drives past Drury Lane and makes muffin man joke",
        "user": "dawsonaro",
        "caption": "No. Freaking. Way. #TheMuffinMan #DruryLane",
        "likes": "1.9 Million",
        "comments": "5466",
        "bookmarks": "104.2K",
        "shares": "11.2.2K",
        "originalSound": "original sound - Dawson Haywood",
        "url": "videos/39.mp4",
        "video_description": "The video runs for a total of six seconds and is a short clip from TikTok user @dawsonaro. The video begins with a car driving through a scenic route surrounded by trees and hills, and the on-screen text introduces the location as DRURY LN. The audio features a voice expressing surprise amongst the ambient noise of the driving car. The second shot, lasting four seconds, focuses on a road sign clearly showing the name 'DRURY LN', reiterating the location. However, there's no accompanying text or audio in this particular shot.",
        "summary_10": "Six-second TikTok by @Dawsonaro highlights car ride on DRURY LN.",
        "summary_25": "@Dawsonaro’s six-second TikTok features a car journey at DRURY LN, starting with energized commentary and closing on a silent road sign.",
        "summary_50": "This six-second TikTok video by @dawsonaro shows a car driving down a scenic route at DRURY LN. It starts with excited audio commentary, followed by a silent shot of the 'DRURY LN' road sign.",
        "ocr": "DRURY LN.",
        "shot_descriptions": "Shot 1: Over a brief two seconds, the viewer is shown a captivating view of a mountain road through a car window. Amid this beautiful landscape, there is an audible expression of awe, 'Oh my gosh, you guys.' \nShot 2: The next shot, lasting four seconds, presents a close-up view of a street sign that reads 'Duryl Ln'. This scene unfolds without any textual elements or audible commentary."
    }, 
    {
        "tiny_desc": "Vegan Mozzarella Recipe",
        "description": "Mozzarella recipe with text instructions",
        "user": "herbifoods",
        "caption": "VEGAN MOZZARELLA 🌱🇮🇹 the best recipe I know! #veganrecipes #easyrecipes #veganfood",
        "likes": "529.1K",
        "comments": "3358",
        "bookmarks": "77.6K",
        "shares": "10.9K",
        "originalSound": "herbifoos",
        "url": "videos/20.mp4",
        "video_description": "The video is a tutorial uploading by the TikTok account @herbifoods, demonstrating how to make vegan mozzarella. The video begins with a shot showing a plate that has tomatoes, basil, and cheese. Then, a man is seen holding a fork that has some vegan mozzarella on it. This is followed by a quick shot of a person holding a spoon with a piece of food, and then cuts to another man staring at his plate of food. The ingredients for the vegan mozzarella are shown next: cashews, soy yogurt, nutritional yeast, tapioca starch, miso paste, and salt. These ingredients are blended together. The video continues by instructing to add water and Agar agar into the blend and bring it to a boil. The mixture is then cooked until it thickens, resembling the consistency of ricotta cheese. The video then shows the thickened mix being scooped into a bowl containing cold water. A man is shown forming and squeezing the mixture into the shape of a ball, simulating the characteristic shape of mozzarella cheese. The final few seconds of the video showcase the finished vegan mozzarella being aesthetically spread over a plate of tomatoes.",
        "summary_10": "TikTok's @herbifoods demonstrates creating and serving vegan mozzarella.",
        "summary_25": "The video by @herbifoods on TikTok shows how to make vegan mozzarella using various ingredients, cooking, molding, and serving it.\n",
        "summary_50": "The video by TikTok user @herbifoods demonstrates making vegan mozzarella. The process involves blending different ingredients like cashews, soy yogurt, nutritional yeast, tapioca starch, miso paste, and salt, cooking until it thickens, molding into balls, and serving on a plate of tomatoes.",
        "ocr": "Let's make this... Vegan Mozzarella, Thy Original, Cashews Soy yogurt Nutritional yeast yeast Tapioca starch Miso paste Salt Blend, Water Agar agar Bring to a boil, Cook until thickened, Scoop in cold water.",
        "shot_descriptions": "Shot 1: Shot 1 shows a plate of mozzarella and tomatoes surrounded by several pieces of bread being displayed.\nShot 2: In Shot 2, the text 'Let's make this... Vegan Mozzarella' appears on the screen, resonating with the voice that says 'make this vegan mozzarella'.\nShot 3: Shot 3 displays a young man enjoying his food with a spoon in his mouth.\nShot 4: Shot 4 shows a man holding a plate while examining food, however, there's no audio or text on the screen.\nShot 5: Shot 5 provides a list of ingredients needed to prepare the dish: Cashews, Soy yogurt, Nutritional yeast yeast, Tapioca starch, Miso paste, and Salt.\nShot 6: Shot 6 is a visual guide on making whipped cream by hand.\nShot 7: In Shot 7, the instruction 'Water Agar agar Bring to a boil' appears on the screen, pertaining to the boiling water process from scratch.\nShot 8: Shot 8 gives instructions to 'Cook until thickened' through text on the screen, while showing eggs being whisked in a pan over the stove.\nShot 9: Shot 9 features a young man mixing flour with a whisk.\nShot 10: Shot 10 shows the process of scooping cold water into a food processor with the on-screen instruction.\nShot 11: In Shot 11, we see a hand placing fresh mozzarella into a bowl of water.\nShot 12: The final shot, Shot 12, captures someone squeezing tomatoes and mozzarella onto a plate, completing the dish."
    },
    {
        "tiny_desc": "Bad Acoustic Guitar Songs",
        "description": "Man describing 5 worst songs to play guitar",
        "user": "kainoahbow",
        "caption": "Replying to @thegrandkomodo im gonna stop you! #guitartok #musiciansoftiktok #guitarcenter #guitarmeme #guitarjokes #classicrock",
        "likes": "99.4K",
        "comments": "807",
        "bookmarks": "13.2K",
        "shares": "125",
        "originalSound": "original sound - Kainoah Bowman",
        "url": "videos/14.mp4",
        "video_description": "The video features a musician sharing five songs that he considers should not be played on acoustic guitar. The video starts with him responding to a comment asking for a list of such songs. He then plays and mentions each song. The list includes the classic rock songs \"Iron Man,\" which he says is overplayed, especially at music shops like Guitar Center. The second song is \"Sweet Child O' Mine,\" which the musician finds unsuitable for acoustic. Third on his list is \"Sunshine of Your Love,\" followed by an AC/DC number which was actually originally performed on an electric guitar. Finally, the musician names 'the forbidden riff', a song initially played on acoustic but he believes shouldn't be. The video concludes with him playing his guitar while asking viewers to comment on any songs that he might have missed.",
        "summary_10": "Musician names five rock songs unsuitable for acoustic guitar play.\n",
        "summary_25": "A musician lists five rock songs, like \"Iron Man,\" that he deems inappropriate for acoustic guitar, concluding with a request for viewer suggestions.",
        "summary_50": "The video showcases a musician categorizing five classic rock songs, including \"Iron Man\" and \"Sweet Child O' Mine,\" as unsuitable for acoustic guitar. Concluding with an appeal for viewer input, the musician highlights the frequent misuse of acoustic guitar with originally electric songs.\n",
        "ocr": "Reply to the challenge: Who gonna stop me? 5 songs that are criminal to play on Acoustic. The list includes: 1.) Iron Man, 2.) Sweet Child O Mine, 3.) Sunshine Of Your Love, 4.) Some AC/DC, and the worst offender, 5.) THE FORBIDDEN RIFF. What did I miss?",
        "shot_descriptions": "Shot 1: The video begins with a reply to a comment posing the challenge, '5 songs that are criminal to play on Acoustic'. The statement 'Five songs that are criminal to play on the acoustic guitar. Number' appears to be setting up the list.\nShot 2: The first song on the list is revealed to be 'Iron Man', with the text on the screen and the man playing the guitar in the background for 8 seconds, subtitled with a comment about it being commonly heard in Guitar Center.\nShot 3: The next song considered inappropriate for acoustic play is 'Sweet Child O Mine'. This shot features visual reference to the guitar lesson for this song and a vocal affirmation that it sounds wrong on an acoustic guitar.\nShot 4: 'Sunshine Of Your Love' is the third song on the list. The shot contains the guitar tab for the song and an audio comment suggesting that despite the song being great, it should not be played on an acoustic guitar.\nShot 5: The fourth song is AC/DC's song, but the focus shifts to the worst offender, a song known as 'THE FORBIDDEN RIFF.' The shot includes an extensive monologue about the inappropriateness of these songs for acoustic guitar, emphasizing that 'THE FORBIDDEN RIFF' was intended for acoustic but still shouldn't be played in such style. The visuals show a man in a baseball cap playing the guitar.\nShot 6: The video ends with a challenge to the audience to identify any additional songs that should not be played on an acoustic guitar, alongside the text 'What did I miss?' The shot also features an image of a TikTok singer performing an acoustic cover of a Drake's song."
    },
    {
        "tiny_desc": "Dog ringing doorbell",
        "description": "Owner's dog ran out of the house at 4AM and came back and rang the doorbell",
        "user": "ambatukamyesiammhm",
        "caption": "#foryou #dogs #dog #cutedogs #putbulls #fyp #fy #fypfy",
        "likes": "2.7 Million",
        "comments": "15.4K",
        "bookmarks": "244.5K",
        "shares": "118.6K",
        "originalSound": "original sound - 💰",
        "url": "videos/37.mp4",
        "video_description": "The short video is a humorous clip about a dog accidentally escaping their house during the early hours of the morning. The clip lasts for 9 seconds and is presented with a text on screen detailing the events, \"My dog got out at 4:AM and rang the doorbell\". A user identified as 'dreamyiscuming' on TikTok is also credited on the screen text. The video features the dog accidentally knocking its head against the doorbell, apparently in an attempt to get back into the house. There is no audio or spoken dialogue throughout the clip, focusing entirely on the visual humor of the situation.",
        "summary_10": "'Dreamyiscuming' TikTok shows dog humorously ringing doorbell after escape.\n",
        "summary_25": "A 9-second TikTok by 'dreamyiscuming' comically shows a dog ringing the doorbell with her head after accidentally escaping the house.",
        "summary_50": "In a 9-second humorous TikTok video, a dog gets out of the house and accidentally rings the doorbell with her head, attempting to re-enter. Creator 'dreamyiscuming' shares this comedic moment with no spoken dialogue, letting the visual humor tell the story.",
        "ocr": "My dog got out at 4:AM and rang the doorbell",
        "shot_descriptions": "During the 9-second long first shot, the scene shows a dog being outside at 4:AM and ringing the doorbell."
    },
    {
        "tiny_desc": "Cat straws",
        "description": "Meme of cat always stealing straws, 2 shots",
        "user": "oswaldandolivia",
        "caption": "#cattok #SearchForWonderMom\n",
        "likes": "2.6 Million",
        "comments": "11.9K",
        "bookmarks": "78.9K",
        "shares": "48.3K",
        "originalSound": "Gary's Song - Spongebob Squarepantss",
        "url": "videos/24.mp4",
        "video_description": "The short video starts with a man looking directly into the camera while a text overlay identifies the video as a TikTok by @ohnolivia_. The onscreen caption humorously suggests a dialogue between a shelter and the protagonist, in which the assumed reply from the man is an unconditional acceptance of a straw-stealing cat. The second shot shifts the scene to the mentioned cat on a bed, interacting with a drink, while there is an unrelated affectionate voice over stating \"You're my best friend, you can come back\". The video showcases a humorous yet endearing relationship between the protagonist and his cat.",
        "summary_10": "TikTok by @ohnolivia_ shows man's acceptance of straw-stealing cat.",
        "summary_25": "In this humorous TikTok by @ohnolivia_, a man warmly accepts a straw-stealing cat from a shelter, underscored by a loving voice-over.",
        "summary_50": "The video, a TikTok by @ohnolivia_, humorously showcases a man's welcoming acceptance of a straw-stealing cat from a shelter. The clip transitions to the cat on a bed, interacting with a drink, as a loving voice-over reaffirms their bond.",
        "ocr": "are you sure you want him? he steals straws me: im sure",
        "shot_descriptions": "Shot 1: A 4-second shot of a girl, who is seen smiling as she is interacting with TikTok on her phone, with on-screen text hinting at a conversation about a straw-stealing shelter animal.\nShot 2: The following 5-second shot shows a cat drinking from a plastic cup, with an audio playing in which someone is heard saying 'You're my best friend, you can come back.'"
    },
    {
        "tiny_desc": "Tato Corn Chow",
        "description": "Tato corn chow recipe with text instructions",
        "user": "quincylk",
        "caption": "Super simple and so good!! Perfect for chilly evenings! #quincys #quincystavern #dnd #taverncore #cottagecore #easyrecipes #soup #recipes #foodtok",
        "likes": "517.1K",
        "comments": "4064",
        "bookmarks": "41.3K",
        "shares": "18.1K",
        "originalSound": "Fireflies Irish Version - Cullen Vance",
        "url": "videos/21.mp4",
        "video_description": "The video is a culinary tutorial for \"Tato Corn Chow\", shared by the TikTok user @quincylk. The recipe involves various ingredients, including 1/2 onion, 1 carrot, 1 celery stalk, and 5 potatoes. The video starts with a shot of the finished Corn Chow soup. It then transitions to the various steps of chopping the onions, carrots, and celery, performed on a wooden cutting board with a chef knife. Then, the video demonstrates the process of mixing the batter in a pot, adding butter and flour, and setting the stove to medium heat. The instructions involve adding cream of chicken to the mixture, followed by stirring and adding cheese into the pot. A key step highlighted is cooking the soup on medium-high until the potatoes are tender. The final shot showcases the ready-to-serve bowl of Tato Corn Chow soup accompanied by bread at a dining table.",
        "summary_10": "TikTok's @quincylk demonstrates making 'Tato Corn Chow' soup, from prep to cooking.",
        "summary_25": "The video by TikTok's @quincylk shows how to make 'Tato Corn Chow' soup, involving vegetable prep, batter-making with chicken cream and cheese, and cooking till potatoes soften.\n",
        "summary_50": "The video is a step-by-step cooking tutorial by TikTok user @quincylk, demonstrating how to make 'Tato Corn Chow' soup. The process involves chopping vegetables, preparing a batter with cream of chicken and cheese, and cooking the mixture until potatoes are tender. Ends with a served bowl of soup.",
        "ocr": "Tato Corn Chow 1/2 onion 1 carrot 1 celery stalk 5 potatoes, 2 tbs Butter 2 tbs flour MED KitchenA 3-5 cups of water 2 cans of cream of chicken, FRONT, Cook on medium high until potatoes are tender.",
        "shot_descriptions": "Shot 1: For four seconds, we see a person enjoying corn bread that is served on a plate of soup, alongside details of a TikTok handle and a mention of Tato Corn Chow, onion, carrot, celery, and potatoes.\nShot 2: In a quick one-second shot, preparation of an onion alongside some potatoes and onions is showcased.\nShot 3: Vegetables for a recipe, specifically an onion, carrot, and celery stalk, are shown being cut, despite the shot being listed with zero seconds.\nShot 4: For one second, we see various vegetables - onion, carrot, celery stalk, and potatoes being cut on a cutting board.\nShot 5: Again in a non-duration shot, a person is shown chopping onions and carrots on a cutting board.\nShot 6: For two seconds, attention is focused on a person diligently cutting onions on a cutting board.\nShot 7: The two-second shot shows ingredients for a savory potato dish neatly arranged on the cutting board.\nShot 8: For 10 seconds, the process of adding butter and flour to a pan is shown, with on-screen text detailing the recipe, which includes butter, flour, and cream of chicken among other ingredients.\nShot 9: On to another culinary task for a second, we see a person cooking an egg with some chicken in a pot.\nShot 10: The next four-second shot features a pan of cheese sauce with potatoes and bacon being placed into a pot, with the word FRONT appearing on the screen.\nShot 11: As cooking continues for five seconds, an individual is shown stirring soup in a pot on the stove, while the screen text advises to cook on medium high until the potatoes are tender.\nShot 12: The final three-second shot displays a bowl of soup and bread well-placed on a table next to a small wooden box."
    },
    {
        "tiny_desc": "Basic italian phrases",
        "description": "Someone teaching 7 basic italian phrases",
        "user": "italianmatters",
        "caption": "#italianforbeginners  #learnontiktok  #italian",
        "likes": "9329",
        "comments": "28",
        "bookmarks": "2736",
        "shares": "445",
        "originalSound": "original sound - Italian matters",
        "url": "videos/35.mp4",
        "video_description": "The video is a brief, 26-second educational piece on basic Italian phrases. The presenter, a woman, displays several Italian greetings and phrases on her screen throughout the runtime. Some of the phrases she demonstrates include 'A Presto' (See You Soon), 'A Domani' (See You Tomorrow), 'Buon Viaggio' (Have a Good Trip), 'Buon Divertimento' (Have Fun), 'I Migliori Auguri' (Best Wishes), and 'In Bocca Al Lupo' (Good Luck). Additionally, she provides a vocal pronunciation for each phrase, helping the viewer with the correct pronunciation. The video serves as an instructive tool for those interested in learning and mastering fundamental Italian phrases and greetings.\n",
        "summary_10": "Woman provides short tutorial on basic Italian phrases and pronunciation.",
        "summary_25": "In this brief video, a woman teaches basic Italian phrases and their pronunciations, serving as a strategic tool for language learners.",
        "summary_50": "In a 26-second video, a woman instructs on basic Italian phrases like 'A Presto', 'A Domani', 'Buon Viaggio', among others. She additionally offers spoken pronunciations for each phrase. This video is an enlightening resource for mastering fundamental Italian greetings.\n",
        "ocr": "1. A PRESTO SEE YOU SOON 2. A DOMANI SEE YOU TOMORROW 3. BUON VIAGGIO HAVE A GOOD TRIP 4. BUON DIVERTIMENTO HAVE FUN 5. I MIGLIORI AUGURI BEST WISHES 6. IN BOCCA AL LUPO GOOD LUCK BASIC ITALIAN U J",
        "shot_descriptions": "SHOT 1 summary: The 26-second shot features an app demonstrating the basics of Italian writing. Concurrently, the audio provides translations and pronunciations of various everyday phrases, such as 'a presto' meaning 'see you soon', 'buon viaggio' meaning 'have a good trip', and 'in bocca al lupo' referring to 'good luck'."
    },
    {
        "tiny_desc": "Strawberry Cream Muffins",
        "description": "Recipe for strawberry and cream muffins with no instructions",
        "user": "freyadish",
        "caption": "Strawberry and cream muffins 🍓🤍 #baketok #strawberry #dessert #baking #bakingvideo #food #foodie #cooking #cookingvideo #sweet #bakingasmr #bakewithfreya #strawberrymuffin",
        "likes": "683.6K",
        "comments": "891",
        "bookmarks": "119.5K",
        "shares": "4544",
        "originalSound": "Obituary - Alexandre Desplat",
        "url": "videos/10.mp4",
        "video_description": "The video is a cooking tutorial featuring multiple recipes related to strawberries. It starts with the display of the user @freyadish and ingredients like eggs and liquids being mixed in a bowl. The video swiftly moves through various recipes such as a strawberry and orange juice mixture, baking batter with cinnamon, flour and sugar, and a bowl of peanut butter with strawberries, etc. Other sequences include strawberry jam preparation, the creation of strawberry sugar, and integration of dry cake ingredients. More elaborate sequences involve the viewer in the process of preparing chocolate cupcakes and strawberry cheesecakes both in pastry cups and muffin form. All steps are visually demonstrated without verbal instruction. The video ends with a shot of kneaded, gluten-free raspberry muffins being made. It's a fast-paced visual recipe tour with a strong focus on dessert preparations involving strawberries.",
        "summary_10": "@freyadish's video is a quick, visual guide to strawberry desserts.\n",
        "summary_25": "The video is a fast-paced, visually-guided tutorial by @freyadish, demonstrating various steps to create strawberry-based desserts, ending with raspberry muffins.\n",
        "summary_50": "The video is a swift, visually detailed cooking tutorial by @freyadish, focusing on various strawberry-based recipes. Elements include mixing ingredients, creating strawberry jam, preparing batter, and assembling pastries like chocolate cupcakes and strawberry cheesecakes. The video ends with gluten-free raspberry muffin preparation.",
        "ocr": "None",
        "shot_descriptions": "Shot 1 shows an egg being poured into an egg yolk and lasts for 6 secon\nShot 2, a 5 seconds shot, features a pitcher of milk being poured on top of strawberries.\nIn Shot 3, with a duration of 4 seconds, a bowl of flour is being poured into a bowl next to strawberries.\nThe 4th Shot is a 4-second clip of a person mixing a batter in a bo\nShot 5 is a 2 seconds shot of a clear bowl filled with peanut butter and strawberri\nShot 6, lasting 5 seconds, displays fresh strawberries being stirred with water being sprinkled.\nIn Shot 7, strawberries are being added to a pan on a table within a span of 2 seconds.\nOver 2 seconds, the 8th shot shows a pan full of strawberries that is being prepared with the spo\nShot 9 captures a woman mixing strawberry sauce with a spatula over 2 seconds.\nIn Shot 10, lasting 3 seconds, some sugar is shown in a glass dish with strawberries next to it.\nThe 11th shot, a 1-second clip, displays flour, sugar, strawberry, and butter in a glass bowl.\nIn Shot 12, a bowl of flour and a spoon are displayed next to strawberries over 2 seconds.\nThe 13th shot, lasting 2 seconds, showcases brown and white cupcake line\nShot 14 pictures cream and strawberries surrounded by paper cups in a frame of 1 second.\nThe 15th shot, over 2 seconds, presents strawberry truffle cookies in paper muffin cas\nShot 16, a 6-second clip, features a large plate with strawberry tarts in white paper cups.\nIn the 17th shot, strawberries and cheesecake are shown in pastry cups over 3 seconds.\nThe 18th shot, lasting just 1 second, presents strawberry muffins with crumble toppin\nShot 19 exhibits strawberry ricotta muffins on a plate in a 1-second clip.\nThe 20th shot, lasting for 3 seconds, features cranberry-nut butter cup muffins.\nThe final Shot 21, a 4-seconds clip, showcases cranberry crumble muffins"
    },
    {
        "tiny_desc": "Can't park",
        "description": "Meme about passing driver's test but still not being able to park",
        "user": "evangelinajade",
        "caption": "Hate parking w a passion #greenscreen",
        "likes": "924K",
        "comments": "6795",
        "bookmarks": "24.2K",
        "shares": "9228",
        "originalSound": "I just came to say AY YO by Boxout - Boxout",
        "url": "videos/41.mp4",
        "video_description": "The video is a short-form humorous content from TikTok, starring a young woman who has just passed her driving test but faces issues with parking. It begins with her in a car adorned with a text message that somewhat reveals the predicament, providing a point-of-view (POV) perspective. Over the course of the video, the character unsuccessfully attempts to park at different locations. The video shows the woman in a parking lot, trying to position her white car correctly. Despite her failed efforts, the woman remains adamant that she can park in a particular spot, leading to a humorous conclusion. This progression is not aided by any text or voice during the clips, relying solely on the shot descriptions to narrate the story.",
        "summary_10": "Humorous TikTok video shows a new driver failing at parking.\n",
        "summary_25": "The TikTok video humorously shows a new driver struggling to park in different locations, despite her persistent, unyielding belief in her parking skills.",
        "summary_50": "This short TikTok video humorously depicts a young woman who, despite recently passing her driving test, struggles to park her car in various locations. The story, conveyed solely through shot descriptions, concludes on a comedic note with her unwavering confidence in her non-existent parking skills.\n",
        "ocr": "pov u passed the test but can't park",
        "shot_descriptions": "Shot 1: For 7 seconds, we see a girl drive a car and there are words appearing on the screen indicating a point of view scenario where someone has passed a test. The audio content reveals a voice saying, 'I think it to you should know.'\nShot 2: This 1-second shot shows a scene symbolizing the aftermath of passing the parking test, although actual parking seems to be a challenge.\nShot 3: Lasting for 1 second, the shot centers on a woman standing in front of a white car.\nShot 4: The scene, spanning 1 second, showcases a car parked near a sidewalk, with an impression that the parking wasn't successful.\nShot 5: This 1-second shot gives a visual hint that although the car is parked, correctly parking it seems to be a problem."
    },
    {
        "tiny_desc": "Whitney Houston Drawing",
        "description": "Showcase of Whitney Houston drawing using only her name",
        "user": "jaycehallart",
        "caption": "The Voice 🎙️ #whitneyhouston #micrography #fanart",
        "likes": "1.5 Million",
        "comments": "39.4K",
        "bookmarks": "56.5K",
        "shares": "46.8K",
        "originalSound": "what falling in love feels like x turning page - alex",
        "url": "videos/06.mp4",
        "video_description": "The video begins with an introduction by Jayce Hall, who specializes in art by handwriting names and phrases. The focus of the art in this instance is a likeness of singer Whitney Houston, created by writing her name multiple times. This unique artwork is etched onto a wooden panel, enhancing its aesthetic appeal and texture. The viewer follows the progress of the creation, displayed through various shots of the artist drawing on the wood with a black marker. Notably, Jayce seems particularly proud of the way Houston's smile turned out in the sketch. At different intervals, we see the brand name of the pen he used, 'Sakura Color PRC'. The final piece is a detailed pencil drawing of Whitney Houston on the wood panel, illustrated by using her name as an ink pattern. The video does not contain any audio aside from Jayce's initial introduction.",
        "summary_10": "Jayce Hall's art portrays Whitney Houston using repetitive name inscription.\n",
        "summary_25": "Jayce Hall creates a distinct Whitney Houston portrait using her name repeatedly on wood, emphasizing an artistic technique and the singer's smile.",
        "summary_50": "The video features Jayce Hall creating a unique portrait of Whitney Houston by repeatedly writing her name on a wooden panel. The black marker sketch, using 'Sakura Color PRC', reveals an impressive likeness, particularly the singer's smile. Jayce's innovative art technique is showcased without additional dialogue.\n",
        "ocr": "The drawing that you're about to see is of Whitney Houston and I made it by writing her name thousands of times. If you've never seen my art before, I specialize in drawing with words, names, and phrases. This time I actually drew on a wood panel, so it made for a pretty cool texture, and I am so proud of how the smile turned out in this one. It's one of my new favorites. I love it a ton, and I hope you dig it too\nWhitney Houston\n\nSAKURA COLOR PRC\n\n",
        "shot_descriptions": "Shot 1: The video begins with a 20-second shot of a man with glasses taking a selfie at home. He announces that he is an artist named Jayce, specializing in drawing using words, names, and phrases. He has created a drawing of Whitney Houston by writing her name countless times on a wooden panel and is especially proud of the depiction of her smi\nShot 2: The second shot is three seconds long, showing someone writing the name 'Whitney Houston' on a wood panel with a marker. The action seems to signify the beginning of a new drawi\nShot 3: The next shot lasting 2 seconds shows the actual process of drawing a human face using a pen on a wooden surfa\nShot 4: For a single second, shot 4 gives a closer look at the drawing process on wood, focusing on the pen which is labeled 'SAKURA COLOR PR\nShot 5: In another one-second shot, the video continues to showcase the artist at work, drawing an image on a wood panel with a p\nShot 6: A seven-second long final shot reveals an old pencil drawing of a smiling woman on the wood panel, presumably completed by Jayce, showcasing the depth of his unique artistry.\n"
    },
    {
        "tiny_desc": "Croc Boots",
        "description": "Man showing off and describing large croc boots",
        "user": "stevenatto",
        "caption": "I Wore the MSCHF Crocs Big Yellow Boots🐊",
        "likes": "668.4K",
        "comments": "5993",
        "bookmarks": "35.8K",
        "shares": "33.4K",
        "originalSound": "original sound - stevenatto",
        "url": "videos/07.mp4",
        "video_description": "The video features the introduction of a new footwear product: yellow rubber Croc boots by MSCHF, a brand known for its creativity and whimsy. At the beginning, some children are seen walking on sidewalks in yellow boots, and subsequent shots reveal the new Croc boots' unique appeal. The Croc boots follow the previous success of the brand's big red boots, now stylized in vibrant yellow and included in an official collaboration with Crocs. They are showcased in different settings, accompanied by narrated descriptions. The yellow Crocs are intricately manufactured with the classic Crocs branding, equipped with an iconic back strap and are notably bigger than regular Crocs. They feature the characteristic top holes of regular Crocs that provide a see-through view to the user's feet. The video also addresses potential customer concerns regarding the footwear's comfortability, proving that they are lighter than the original pair and solely as high regarding length, making them a comfortable fit. The comfort factor holds true whether they are worn with shorts or pants.\n",
        "summary_10": "The video unveils MSCHF's comfortable, uniquely featured yellow Croc boots.",
        "summary_25": "The video introduces MSCHF's yellow rubber Croc boots, highlighting their unique features, comfortability, and versatility with different clothing.",
        "summary_50": "The video presents MSCHF's new yellow rubber Croc boots, a collaboration with Crocs. The boots, larger than regular Crocs, maintain classic branding with unique features like see-through holes and an iconic back strap. They are lightweight, comfortable, and versatile with both shorts and pants.",
        "ocr": "MSCHF MADE ANOTHER BIG RED BOOT\nTHIS TIME IT'S YELLOW AND AN OFFICIAL COLLABORATION WITH CROCS\nSOI NEEDED TO SEE WHAT THESE WERE LIKE\nTHEY COME IN A GIANT BOX AGAIN EXCEPT THIS TIME IT'S YELLOW AND HAS SOME CROCS BRANDING LIKE ON THE PAPER AND THE SHOES\nAND THEY EVEN HAVE THE ICONIC BACK STRAP\nNOW THESE ARE HUGE COMPARED TO REGULAR CROCS\nTHE SAME SET OF HOLES ON TOP THAT SEE THROUGH RIGHT TO YOUR FEET TOO\nBUT THAT STILL LEFT ME WONDERING WERE THEY COMFORTABLE\nWELL THEY'RE A LOT LIGHTER THAN THE ORIGINAL PAIR AND GO UP JUST AS HIGH ON YOUR LEG WHICH I TRIED\nWHICH I TRIED WITH BOTH SHORTS AND PANTS BUT SINCE THEY ARE BASICALLY A PAIR OF CROCS, THEY'RE ACTUALLY PRETTY COMFORTABLE",
        "shot_descriptions": "Shot 1: The shot is a brief 2 seconds long and presents producing another big red boot with mentions of MSC\nShot 2: During this 1-second shot, it's revealed that this time around, they've produced a yellow version of the shoe in partnership with Cro\nShot 3: The shot showcases a pair of yellow plastic crocs with holes on top, indicating the collaborative project with Cro\nShot 4: The presenter expresses their curiosity about the yellow crocs as they are seen swaggering in the yellow shoes in the one-second sh\nShot 5: The crocs come in a giant box, that's yellow this time around, as explained in this 3-second video cl\nShot 6: This 3-second shot highlights the branding of Crocs, displayed on both the paper and the shoes, with a person standing on yellow paper evident in the backgrou\nShot 7: The shoes are described to have an iconic back strap, useful for combating back pain, in this 2-second sh\nShot 8: This is a 2-second video explaining how these revealed Crocs are significantly larger than the standard on\nShot 9: This shot briefly depicts a person wearing the presented yellow Crocs while walking down the stre\nShot 10: It is revealed in this 3-second shot that these Crocs feature the same pattern of holes on top, allowing one to clearly see through to the feet undernea\nShot 11: Here, the presenter queries about the comfort of the shoes. The words 'Let me wondering' are visible on a pair of rubber boots worn by a man in this 2-second sh\nShot 12: In this fleeting shot, a person is seen wearing the same yellow Crocs on the ro\nShot 13: The presenter comments that these shoes are lighter than the original pair, with text on the shoes that reads 'lighter than' as referen\nShot 14: This 2-second shot emphasizes that the Crocs can go on either your lower or upper leg and the presenter experimented with both optio\nShot 15: A 4-second shot shows a man wearing both shorts and pants with the yellow Crocs, concluding that they are pretty much just a pair of regular Crocs in different atti\nShot 16: To conclude, these Crocs are deemed quite comfortable as indicated in this one-second video of two crocs stomping around in boots."
    },
    {
        "tiny_desc": "April Fools Joke",
        "description": "Woman pretends to get pregnancy call to prank teacher",
        "user": "funny.life5.usa",
        "caption": "Funnyvideos #funny #meme #comedyvideo #viral #xuhuong",
        "likes": "918.4K",
        "comments": "1793",
        "bookmarks": "104.3K",
        "shares": "7441",
        "originalSound": "original sound - Funny's Video",
        "url": "videos/08.mp4",
        "video_description": "The video opens with a TikTok labeled as @funny.life5.usa and @basicallytheinternet. The scenario portrayed is a classroom rule - if someone's phone rings during the session, they have to put it on speaker. The situation escalates when someone's phone indeed rings, and an intriguing phone call ensues. The call, captured using on-screen text, starts with Kevin informing Ms. Nefco of surprising test results returning positive, presumably a pregnancy test. Throughout the call, Kevin assures Ms. Nefco of supporting her throughout the process, offering free counseling and even providing an oddly specific suggestion for a baby name, April Fool. The in-class announcement of the unexpected expectance is followed by a brief moment of silence in the classroom as the phone call ends with no other scene exploration in the 2-second shot.",
        "summary_10": "TikTok video: Classroom rule reveals Ms. Nefco's pregnancy as April Fool.",
        "summary_25": "In the video, a TikTok classroom rule leads to a public pregnancy announcement for Ms. Nefco, with a proposed baby name, April Fool.",
        "summary_50": "The video showcases a TikTok scenario set in a classroom. A student's phone rings, and due to a rule, it is answered on speaker. The call reveals an unexpected news of a positive pregnancy test result for Ms. Nefco, leading to a surprised classroom. The suggested baby name is April Fool.",
        "ocr": "If someone's phone rings in the middle of the class, they have to put it on speaker. Answer it! Hello, is this Ms. Nefco? Yes? Hi, this is Kevin from the you to inform you that the test results have come back positive. Congratulations! Okay, you might - you might want to shut that down. Thank you - There is no need to worry, but we will be in contact with you throughout this whole process. So, don't worry about anything. Don't worry about anything. We provide counseling at no charge. Thank you, going to name the banny. The first name will be April. name will be Fool. name will be Foolfunny.",
        "shot_descriptions": "Shot 1: Over the span of 57 seconds, a man is seated in a classroom with a laptop. The scene is coupled with an interesting text on screen concerning a unique rule where any phone call in the middle of class must be answered through speakerphone. The conversation involved a person receiving news that they are expecti\nShot 2: Short duration of 2 seconds showing the teacher in a classroom receiving a phone call."
    },
    {
        "tiny_desc": "Amazon products",
        "description": "Woman showing off small amazon purchases",
        "user": "askine million",
        "caption": "Some of my favorite small finds from amazon! ⭐️💄 #musthaves#amazonfinds#asmr#cleantok#organized#beautyfinds#gadget",
        "likes": "1589",
        "comments": "3",
        "bookmarks": "161",
        "shares": "6",
        "originalSound": "original sound - Emily Askin - Home/Lifestyle",
        "url": "videos/09.mp4",
        "video_description": "The video begins with a woman lying in bed and presenting a box from KIOK LANEIGE, a beauty and skincare brand, and a pink box from Touchland. The scene switches to different shots of actions, such as a carton of milk being opened, a white packet being unfolded on a bed, and a paper bag being passed from one person to another. The video then presents some beauty products including a Lip Sleeping Mask, a skincare face cream, and a red lip balm from Laneige. Images of a woman holding various beauty products, applying lip balm, and using a toothbrush are interspersed with images of a smart sensor bracelet and other tech products. In one shot, the video shows a TikTok Comfort Pack with an orange and white sticker. As the video progresses, we see instances of different skincare items being applied, including a pink beauty stick called Lip Glowy Balm and Claireskin moisturizing eye gel. Towards the end, a product called Sweet Orange Bergamot + Aloe is introduced. The video's primary focus lies on skincare products and small technology devices, presenting these in a relaxed, domestic setting.",
        "summary_10": "Video displays woman introducing beauty products and tech at home.",
        "summary_25": "The video features a woman presenting KIOK LANEIGE and Touchland beauty products and tech devices in a cozy home setting.",
        "summary_50": "The video showcases a woman in bed introducing beauty products from KIOK LANEIGE and Touchland. Various beauty and skincare items, including Lip Sleeping Mask and Lip Glowy Balm, are displayed along with small tech devices. The primary focus is on a comfortable domestic presentation of skincare essentials.\n",
        "ocr": "Venus my my favol my favorite mini's from KIOK LANEIGE touchland. LIP SLEEPING MASK MASQUE DE NUIT [BERRY / FRUITS ROUGES POUR LES LEVRES. LANEIG. Lip Glowy Balm. Fruits rouge. Sweet Orange Bergamot + Aloe.",
        "shot_descriptions": "Shot 1 features beauty and makeup products such as KIOK LANEIGE and touchland positioned on a b\nShot 2 shows a box of tissues located next to a bed.\nIn Shot 3, a hand is seen opening a box of powd\nShot 4 involves a person holding open a box of coffee bea\nShot 5 shows a tissue bag purposed for bed sheets, also known as a titot\nShot 6 doesn't include anything to mention due to the constraints.\nIn Shot 7, a hand is placed on top of a white b\nShot 8 introduces a sleep mask, inviting viewers to question whether it's worth the hy\nShot 9 displays a smart bracelet affiliated with TikTok.\nIn Shot 10, a person's hand is interacting with their bracelet while laying on a b\nShot 11 has two hands resting on a bed, with a suggested association to TikTok.\nIn Shot 12, a pink object—referenced as a 'tok bed'—is shown floating over the shee\nShot 13 doesn't involve anything to summarize due to the constrain\nShot 14 presents a reusable electronic breast pump that is notable for its discreetne\nShot 15 displays a person gripping an arm of a white garment.\nIn Shot 16, someone's hand is holding up a pink pi\nShot 17 shows a picture of a white sheet laid out on a bed.\nIn Shot 18, a box of cosmetics marked 'Lip Sleeping Mask' in multiple languages, including 'Masque De Nuit' and 'Fruits Rouges Pour Les Levres', is placed on a b\nShot 19 involves a pink box, potentially related to TikTok.\nIn Shot 20, a new product line from TikTok, 'TikTok Beauty Box', is introduc\nShot 21 doesn't provide anything to mention due to the constraints.\nIn Shot 22, an image shows someone applying pink nail polish to their own finge\nShot 23 features a product identified as Lanczee Lancre eye cream or gel creme.\nIn Shot 24, a lip balm product from the brand Laneige, tinted in love red, is display\nShot 25 involves a person applying lotion onto their arm.\nIn Shot 26, an air mattress is presented without any additional conte\nShot 27 shows a pink plastic device set in front of a bed.\nIn Shot 28, an individual is seen holding a pink toothbrush to their wri\nShot 29 presents a scene of a phone being revealed as a pink case is opened.\nIn Shot 30, a girl is seen holding an unidentified pink plastic produ\nShot 31 involves a 'trik' bed sheet that features a sock for temperature sensing.\nIn Shot 32, someone is holding a piece of white plast\nShot 33 presents a snore alarm app without other context.\nIn Shot 34, a bedsheet cleaning solution is offer\nShot 35 shows a person holding a piece of tissue, presumably to fold it.\nIn Shot 36, a white bed clothed with a bedsheet and an electric blanket, is sho\nShot 37 involves a mattress protector developed for bed sheets, associated with a hotel in Singapore.\nIn Shot 38, a Lip Glowy Balm is display\nShot 39 doesn't have anything to mention due to the constraints.\nIn Shot 40, a pink tube of lipstick known as 'Fruits Rouge' is placed on a b\nShot 41 involves two hands holding a tube of lipstick next to a bed.\nIn Shot 42, a person is holding onto a tube of lipstick while in b\nShot 43 presents an array of makeup items organized on a white bed, accompanied by a pink towel, and labeled as 'Sweet Orange Bergamot + Aloe'."
    },
    {
        "tiny_desc": "Sink Care ASMR",
        "description": "Various shots of woman cleaning kitchen, no audio or text",
        "user": "_catben_",
        "caption": "I take my sink care very seriously! 🤪✨🫧 #asmr #sinkcleaning #cleantok #motivation #blacksink #deepclean #momlife #organizedhome",
        "likes": "509K",
        "comments": "1232",
        "bookmarks": "21.5K",
        "shares": "1975",
        "originalSound": "original sound - Catherine Benson",
        "url": "videos/11.mp4",
        "video_description": "The short-form video primarily showcases cleaning methods for a kitchen sink, specifically a black kitchen sink, using various methods and products, with the username @_catben_ featured in the beginning. The video content includes several items being placed in the sink, and a myriad of cleaning procedures involving sponges, brushes, and a variety of soapy solutions. One of the unconventional tools employed is a rubber used to clear a trash can. Additionally, it displays the use of TikTok’s augmented reality feature that offers virtual utensils, and a refillable spray bottle from TikTok. The brand also introduces a new way to monitor water consumption, a smart water stopper and a black pull-down kitchen faucet, extending their line of innovative household items. As the video progresses, it transitions into a demonstration of an array of cleaning hacks shared on TikTok that encapsulates a plethora of cleaning strategies for sinks and general kitchenware. It concludes by introducing a new black quartz sink model, Tritak Black, compelling viewers to use their vivid range of sink cleaning solutions and cutting-edge kitchen accessories to facilitate a clean and organised kitchen.",
        "summary_10": "The video showcases @_catben_'s innovative methods for sink cleaning and new products.",
        "summary_25": "The video by @_catben_ demonstrates unique techniques and tools to clean a black kitchen sink, along with introducing TikTok's augmented reality utensils and Tritak Black sink.\n",
        "summary_50": "This video showcases various methods and products for cleaning a black kitchen sink by @_catben_. It includes unconventional tools, TikTok’s augmented reality utensils, a smart water stopper, and a black pull-down faucet. The video culminates with the introduction of a new black quartz sink model, Tritak Black.",
        "ocr": "None",
        "shot_descriptions": "The first shot involves interaction with a kitchen sink. In the next shot, a sink is observed being washed with green and red water. During the third shot, the focus is on revealing the trash drawer in a kitchen. The fourth shot shows a person making use of an open trash bin with a trash bag. A bottle of cleaning solution is held in the fifth shot. The sixth shot focuses on a jug dispenser. The next scene involves a black silicone bowl featuring some text. In the eighth shot, water is poured into a black bowl. The ninth shot displays a black bowl filled with water located on the ground. The technological capabilities of an application are highlighted in the tenth shot. The eleventh shot shows a man using a phone stand in a kitchen setting. An ad for soap is presented in the twelfth shot. A toothbrush is used to clean an oven in the following shot. In the fourteenth shot, a pink tub cleaner is showcased. For the fifteenth shot, an emulsion clean-up in the kitchen takes the spotlight. In the sixteenth shot, a counter is cleaned using a pink bottle of cleaning solution. The seventeenth shot shows a liquid being sprayed in a tray marked with white lines. A close-up of a sponge in a dish is seen in the eighteenth shot. The subsequent shot involves handwashing of a dish soap. Following that, a sink is cleaned with soapy water in the twentieth shot. In the following shot, a sink is cleaned using a white sponge. A person is observed using a sponge to clean a sink in the next scene. In the twenty-third shot, a person is seen washing dishes in the sink. The twenty-fourth shot shows the washing of a sponge on a soapy dish in a sink. A sink full of soap scum is cleaned in the twenty-fifth shot. The twenty-sixth shot involves washing a bowl full of soap in a black sink. In the next shot, a kitchen sink is washed with a sponge. A sink is cleaned with a sponge in the following scene. Someone is observed washing a sink with soap in the twenty-ninth shot. The thirtieth shot depicts a sink being washed with water from a faucet. Water spraying from a sink is captured in the thirty-first shot. The thirty-second shot is a video showcasing a drain cleaner. A kitchen faucet is showcased in the thirty-third shot. In the subsequent shot, liquid soap is poured into a glass jar. They are seen placing pills in a glass container in the next scene. A sink plug with a blue water drop is presented in the thirty-sixth shot. Water is seen being dispersed from a hose in the following shot. A sink drain filled with water is displayed in the next shot. The thirty-ninth shot focuses on the drain of a sink. Next, a small black hole in a sink filled with water is showcased. Another shot of a drain, this time in a black sink filled with water, follows. The forty-second shot guides on how to make glass cleaner. A Black sink is cleaned with a sponge in the forty-third shot. An empty sink is cleaned with black water in the next scene. The next shot shows a hand holding a bottle of cleaning liquid in front of a sink. Cleaning liquid is poured into a sink in the subsequent shot. The scene changes to showing a suitable towel for a sink in the forty-seventh shot. The following scene provides tips on how to use a cloth to remove wax and polish. In the forty-ninth shot, a kitchen sink is being cleaned. The top of a black kitchen sink is washed in the subsequent scene. A sink is rinsed out using an abrasive cleaner in the next shot. The following scenes are focused on cleaning a bathroom vanity, a black sink, stone countertops, and a kitchen sink. In the following scene, a black kitchen sink is cleaned with a cloth. Then, a countertop is cleaned with a rag in the next scene. In the next scene, an iPod touch is seen on a stand. The focus shifts to a universal charger in the next shot. A kitchen towel dispenser takes the spotlight in the sixtieth shot. The next scene depicts a person placing two bottles on a tray in a kitchen. Water is seen being poured from a bowl into a black strainer in the sixty-second shot. The next scene shows someone cleaning a sink with a sponge brush. The final shot features a smart kitchen sink in black and white."
    },
    {
        "tiny_desc": "Cucumber Splitting",
        "description": "Man splitting cucumbers to see how many he can split at once",
        "user": "scottsreality",
        "caption": "Guess how many cucumbers this challenge took! 🥒🤯",
        "likes": "111.3K",
        "comments": "547",
        "bookmarks": "6829",
        "shares": "602",
        "originalSound": "original sound - Scott",
        "url": "videos/12.mp4",
        "video_description": "The short-form video is a compilation featuring a man and his antics with cucumbers. Throughout the video, the man in a red Nike tee is seen engaging with cucumbers in various ways. From holding up a giant cucumber, showcasing two bigger ones in front of his house, flexing muscles while holding two cucumbers, to finally giving a bowl of cucumbers to a chicken. Interspersed with these visuals, he also holds a large cucumber showcasing three distinct numbers, holds a bundle of green vegetables, and displays a bag emblazoned with the number 7. Interestingly, the video features a voice count from one to five, but the number four is strangely skipped. The video concludes with a chicken pecking at cucumbers from the ground, with the words, \"Follow for the next impossible challenge\" appearing on the screen. The entire video seems to be an entertaining, tongue-in-cheek promotion of cucumbers or possibly, a quirky gardening vlog. The video is fast-paced, lasting only a few seconds per shot. A TikTok watermark \"@scottsreality NIKE\" is visible in the first shot.",
        "summary_10": "Man humorously interacts with cucumbers on TikTok video, ending with challenge.",
        "summary_25": "A TikTok video features a man engaging with cucumbers humorously, including displaying them, flexing muscles, and feeding chickens, ending with a challenge.\n",
        "summary_50": "In this fast-paced TikTok video, a man in a red Nike tee humorously engages with cucumbers in various ways. From showcasing massive cucumbers, flexing muscles holding them, giving them to a chicken, to revealing numeric clues, the video culminates with the text, \"Follow for the next impossible challenge\".",
        "ocr": "Follow for the next impossible challenge",
        "shot_descriptions": "Shot 1: A man holds a green pepper before his face. An audible countdown with numbers '1' and '2' can be heard. There's a caption displayed mentioning 'NIKE\nShot 2: Shot involves a man showcasing some hefty cucumbers. The count '3' was hea\nShot 3: In the next shot, the same man displays two long cucumbers, each marked with the number '\nShot 4: This shot captures the man humorously placing two cucumbers on his fa\nShot 5: A man dressed in red holds up a plastic-wrapped cucumber bundle to the camera. The number '5' is hea\nShot 6: Featuring a man with cucumbers up to his face, marked with an '\nShot 7: A man appears holding a bundle of bags. The number '7' can be hea\nShot 8: Next shot surprisingly features a chicken eating cucumbers from a pla\nShot 9: The shot captures a chicken in grass with some food. There's an invitation on screen asking viewers to 'Follow for the next impossible challeng\nShot 10: The final shot of the video shows a chicken standing on the ground, surrounded by scattered vegetables."
    },
    {
        "tiny_desc": "Man playing guitar",
        "description": "Man playing guitar song, no singing or on-screen text",
        "user": "andrecarrier",
        "caption": "“Its better to feel pain, than nothing at all” #stubbornlove #lumineers #acoustic #guitar #fyp",
        "likes": "106K",
        "comments": "443",
        "bookmarks": "11K",
        "shares": "374",
        "originalSound": "original sound - dre",
        "url": "videos/13.mp4",
        "video_description": "This short-form video, with a duration of 30 seconds, features a man skillfully playing a guitar in a room. The video does not contain any audio dialogue, thus the focus is solely on the music produced by the guitarist. The identity of the guitarist is revealed through textual information displayed on screen, indicating that the man is Andre Carrier, known by the username @andrecarrier_ on TikTok. The man seems to be engrossed in his guitar playing, as he stares intently at the wall. This video likely serves as a showcase of Andre Carrier's musical talents on the digital platform.",
        "summary_10": "Video shows Andre Carrier's (@andrecarrier_ TikTok) 30-second guitar performance.",
        "summary_25": "The video presents Andre Carrier (@andrecarrier_ on TikTok) engrossed in a 30-second silent guitar performance, highlighting his musical skills.",
        "summary_50": "This 30-second video showcases Andre Carrier (@andrecarrier_ on TikTok) as he skillfully plays his guitar in a room. Engrossed in his performance, there's no dialogue - only music. The video underlines his musical prowess on the popular digital platform.",
        "ocr": "None",
        "shot_descriptions": "In the first shot, which lasts for 30 seconds, a man is seen playing a guitar in his room while wearing a red shirt. No spoken audio is present in this shot."
    },
    {
        "tiny_desc": "Disney Medley",
        "description": "Man playing disney songs on piano in 1 medley asking us if we can name them all?",
        "user": "naluthepian",
        "caption": "Last song is goated",
        "likes": "127.6K",
        "comments": "1759",
        "bookmarks": "13.9K",
        "shares": "2432",
        "originalSound": "original sound - Nalu the Piano Man",
        "url": "videos/15.mp4",
        "video_description": "The short-form video has a single shot with a duration of 124 seconds. It features a challenge to viewers to name all eight Disney songs in the video. There's no audio speech present, only text appearing on the screen providing the viewer with the challenge. An individual named @naluthepiaman is tagged implying he presented the challenge. The element of interactivity and fun is included with the mention of emoji hints. The visual shows the phrase \"Can you name all the Disney songs?\" indicating this is the main theme of the video.",
        "summary_10": "It's a silent, interactive 124-second video challenge to identify Disney songs.",
        "summary_25": "The video is a 124-second, silent interactive challenge by @naluthepiaman to recognize eight Disney songs, using on-screen text and emojis.",
        "summary_50": "This 124-second video is a silent challenge by @naluthepiaman for viewers to recognize eight Disney songs, through on-screen text and emoji hints. The video is interactive and focuses on viewer engagement while having a fun Disney theme.",
        "ocr": "Can you name all 8 Disney songs? Wait for the emoji hints. 8. III",
        "shot_descriptions": "Shot 1: For a duration of 124 seconds, a man is seen playing a piano. The text on screen prompts the viewer to name 8 Disney songs, with emoji hints expected to follow."
    },
    {
        "tiny_desc": "Class Zoom prank",
        "description": "Everyone pretends to have WiFi issues on Zoo million",
        "user": "samuelgrub",
        "caption": "Our WHOLE class pranked our teacher Pt.12 😂😂 (Come back in 24 hours for Part 13) #foryou #foryoupage #fyp #viral #funny #comedy #tiktok #trend #meme",
        "likes": "11.3 Million",
        "comments": "53K",
        "bookmarks": "390.1K",
        "shares": "196.7K",
        "originalSound": "original sound - Samuel Grubbs",
        "url": "videos/16.mp4",
        "video_description": "The video begins with a view of a table and a laptop displaying a group of people in a video call. This appears to be a scene from a TikTok video by Samuel Grubbs, as indicated by the on-screen text. The camera then switches to a close-up view of the laptop screen, where a speaker named Noah Weaver is instructing others in the call to move to slide 37, creating the impression of a work conference or meeting. However, the twist in the video is that all other participants in the video call have changed their names to \"Reconnecting...\", indicating a prank or joke, possibly as a part of an April Fools' day celebration. The video thus presents an interesting blend of formal work communication undermined by a light-hearted prank strategy.",
        "summary_10": "TikTok video by Samuel Grubbs features a humorous meeting prank.",
        "summary_25": "Samuel Grubbs' TikTok video showcases a prank where meeting participants change their names to \"Reconnecting…\", humorously disrupting a professional call.",
        "summary_50": "The video features a TikTok prank by Samuel Grubbs where participants in a video call change their names to \"Reconnecting…” during a professional meeting, creating a humorous contrast between serious work communication and lighthearted tomfoolery.\n",
        "ocr": "We ALL cut our cameras off and changed our names to 'Reconnecting...'\nSpeaker View Noah Weaver Obadiah Clay command Evan Mullis Jack Buza | 'Reconnecting...' Reconnecting Reconnecting. - Reconnecting- Reconnecting9 - Reconnecting - Reconnecting9- Reconnecting.. Reconnecting. Reconnecting9 к andra Cell Sandra",
        "shot_descriptions": "Shot 1: The video opens with a brief shot of a video chat happening on a laptop, with the text on the screen indicating the users are pretending to reconnect.\nShot 2: A 19-second shot follows, showing a closer view of the laptop screen during a conference call, accompanied by an audio instruction to move to slide 37 and an off-handed question."
    },
    {
        "tiny_desc": "Adele cover",
        "description": "Girl does a cover of Adele's \"Easy on Me\"",
        "user": "ladominique",
        "caption": "Man… Adele has us all hypnotized #adele #fypシ #trending #hereforit #easyonme #singing #hireme #adele30",
        "likes": "2.6 Million",
        "comments": "63.8K",
        "bookmarks": "68.8K",
        "shares": "55.4K",
        "originalSound": "original sound - PAME",
        "url": "videos/17.mp4",
        "video_description": "The video is about a woman, identified as @ladominiqueen, who has been frequently requested by her followers to sing a song. When the video starts, she is seen posting a tweet from another user which implies a high demand for her rendition of a TikTok song. As she talks to her viewers, she shares that she's just off the plane and decided to finally acquiesce to her viewers' requests. The song she sings talks about challenging times where she mentions about washing her hands and her inability to swim despite hope being in the waters. She expresses her challenging journey where she didn't have the chance to rise. The woman's emotions and sincerity reflect in her voice captivating the viewers.",
        "summary_10": "@ladominiqueen performs an evocative song about struggles and hope.\n",
        "summary_25": "The video shows @ladominiqueen succumbing to popular demand and singing a poignant song about hardships and hope, deeply engaging the viewers.",
        "summary_50": "The video features @ladominiqueen, who has been heavily requested to sing a song. Responding to the demand, she sings a heartfelt piece discussing hardships and hope. The profound emotions and sincerity in her performance captivate viewers.\n",
        "ocr": "You all have been requesting this one like crazy",
        "shot_descriptions": "Shot 1: The video lasts for 59 seconds. During this time, Sharieah engages in a conversation with a man in her bed. On-screen text references TikTok and indicates that Sharieah's audience had requested a specific action or song from her. Sharieah then speaks in response to these requests and sings a song for her followers."
    },
    {
        "tiny_desc": "Bebe Rexha cover",
        "description": "Girl does a cover of Bebe Rexha's \"In the Name of Love\"",
        "user": "howdyhales",
        "caption": "Replying to @C.203 difficult but SO fun ❤️‍🔥 #singer #nameoflove #beberexha #sing #vocals #voice #belting #bridge #voiceeffects #belt #singingchallenge #cover #garage #acoustics #singingcover #foryou #singing #testify #new #trend",
        "likes": "2.2 Million",
        "comments": "11.5K",
        "bookmarks": "327.6K",
        "shares": "4417",
        "originalSound": "original sound - hailey",
        "url": "videos/18.mp4",
        "video_description": "The video is a 39 second clip, which appears to be a reply to a comment by user C.203 on the TikTok platform. The video is posted by the user @howdyhales. The video features an older girl who stands in front of a garage door. In the audio of the video, the girl is heard saying \"this is very hard but I track just if I were you.\"",
        "summary_10": "@howdyhales' TikTok replies to C.203, showing a girl with life advice.",
        "summary_25": "This 39-second TikTok by @howdyhales is a reply to C.203, featuring a girl by a garage saying, \"this is very hard but I track just if I were you.\"",
        "summary_50": "The 39-second TikTok video by @howdyhales is a response to user C.203's comment. It features an older girl near a garage door, saying, \"this is very hard but I track just if I were you.\"",
        "ocr": "Reply to comment.",
        "shot_descriptions": "Shot 1: The shot shows a young woman staring at a garage door with a surprised expression. The video lasts for 39 seconds. The accompanying audio has the woman stating that the task at hand is quite challenging."
    },
    {
        "tiny_desc": "Egg and zucchini dinner",
        "description": "Woman teaches recipe of easy dinner with zucchini and eggs, audio instructions",
        "user": "bakedbymelissa",
        "caption": "Easy dinner #food #recipe #tiktokpartner #tiktoktaughtme #fyp #fypシ #asmr #viral #learnontiktok #easyrecipe",
        "likes": "532.4K",
        "comments": "2025",
        "bookmarks": "150.1K",
        "shares": "32.9K",
        "originalSound": "bakedbymelissa",
        "url": "videos/19.mp4",
        "video_description": "The video seems to belong to a Tik Tok account named Bakedbymelissa, where the user is demonstrating a recipe using zucchini as the primary ingredient. The video begins with a cucumber and transitions into showing a vegetable cutter being used. As the video progresses, the user discusses coming up with the recipe, which includes shredding zucchini and removing moisture using a cheesecloth. The user also mentions sauteeing a large red onion, though the duration and sequence are not clear. Following this, ingredients such as garlic, eggs, parsley, cheese, and chives are added and mixed, and seasoned with salt and pepper. Also featured in the video are people sampling green smoothies or juices, presumably made from similar vegetable ingredients. The end product appears to be a sort of zucchini and cheese casserole or tart that is baked in an oven set at 375 degrees. Throughout the video, various people are shown consuming and appreciating the finished product.",
        "summary_10": "Bakedbymelissa shows a zucchini recipe, resulting in a baked casserole.\n",
        "summary_25": "TikTok's Bakedbymelissa demonstrates a zucchini recipe involving shredded zucchini, sautéed onions, and various ingredients. The result is a baked zucchini-cheese casserole.",
        "summary_50": "The video, from TikTok user Bakedbymelissa, presents a zucchini-based recipe. Key processes include shredding zucchini, sautéing onions, and incorporating ingredients like garlic, eggs, parsley, cheese, and chives. The final product, a zucchini and cheese casserole, is baked at 375 degrees and enjoyed by various individuals.\n",
        "ocr": "375 Kitchen Settings Clear/Off",
        "shot_descriptions": "Shot 1: The video kicks off with instruction on how to cut a cucumber.\nShot 2: It then transitions to a shot of a jumbo vegetable strainer.\nShot 3: The video then displays a person placing shredded green onions into a strainer.\nShot 4: This scene shows shredded fresh green onions sitting on a cutting board.\nShot 5: The video then cuts to a scene where there is a close-up of a white sheet.\nShot 6: The next scene shows a serene white table with various green plants.\nShot 7: In this shot, viewers see shreds of cucumber at a supermarket.\nShot 8: A person can be seen slicing green cabbage in a plastic bag in this shot.\nShot 9: Immediately the shot transitions to display the texture of a silver platter.\nShot 10: The video then depicts cucumbers being drained in a glass bowl.\nShot 11: In the next shot, someone is pouring liquid into a bowl with some green contents.\nShot 12: The following scene shows a knife positioned next to a bowl of green sauce.\nShot 13: The focus then shifts to two people who are holding a glass filled with lime juice.\nShot 14: A man is shown holding a glass filled with some green liquid in this shot.\nShot 15: The video then transitions to Joshua Morgan enjoying a hot dog.\nShot 16: The scene changes to a woman sipping green juice.\nShot 17: The woman continues to drink her green juice.\nShot 18: An onion is cut with a knife in this scene.\nShot 19: Here, a purple onion is sliced and prepared on a cutting board.\nShot 20: Next, viewers see sliced red onions perfectly laid out on a cutting board.\nShot 21: This shot shows a hand cutting red onions.\nShot 22: The chopped red onion finds its place on the cutting board in this scene.\nShot 23: The action shifts to a person slicing onions on a wooden cutting board.\nShot 24: Here, the shot reveals sliced red onions gathered in a large bowl.\nShot 25: The video highlights red onions being chopped in a pan.\nShot 26: The viewer then sees fresh green parsley being chopped on a wooden surface.\nShot 27: The video moves on to showcase fresh chives being sliced on a cutting board.\nShot 28: The shot then transitions to a person spreading parsley onto some silver foil.\nShot 29: The scene shows rice being grated in a bowl.\nShot 30: In the next shot, white rice flakes are shown in a white bowl on a table.\nShot 31: Here, we see a red onion being fried in a pan.\nShot 32: In this frame, sliced red onions, garlic, and cheese are cooking in a skillet.\nShot 33: The image moves on to display chopped onions and garlic being stirred in a pan.\nShot 34: Viewers see an onion being chopped in a wok.\nShot 35: The shot transitions to onions being fried in a hot pan.\nShot 36: The next frame displays yolks of three eggs in a bowl.\nShot 37: The video then captures eggs being whisked together in a bowl.\nShot 38: The scene changes to eggs and cheese being poured into a glass bowl.\nShot 39: The focus shifts to a blurry image of a mix of flour and cheese.\nShot 40: The following shot is centered on a bowl of yellow batter with a whisk.\nShot 41: Thereafter, viewers see a whisk with a bowl containing herbs, eggs, and cheese.\nShot 42: In this shot, an egg and herb mix is swirled in a glass bowl.\nShot 43: The scene changes to show a whisked bowl of egg and parsley mixture.\nShot 44: The video then reveals that the egg, cheese, and herb mixture is being stirred together.\nShot 45: The scene immediately cuts to a mix of chopped chives and cabbage being stirred with a fork.\nShot 46: Again, the focus is placed on green cabbage mixed with mayonnaise and green onions.\nShot 47: The camera shifts to a bowl of zucchini salad being stirred with a tong.\nShot 48: Up next, the shot shows a mix of vegetables, pasta, and cheese, being stirred in a bowl.\nShot 49: The camara then pans to an egg yolk mixture with ham in a bowl.\nShot 50: You can see a tongs mixing eggs and minced garlic in a blender.\nShot 51: The video moves on to show a salad with bacon and onion being prepared.\nShot 52: The scene changes to a bowl full of a cucumber salad with ham, eggs, and garlic.\nShot 53: In this shot, eggs are being added to a bowl of zucchini and bacon.\nShot 54: The scene shifts to a closeup of broccoli in a glass dish.\nShot 55: Here, a dish with noodles, cheese, and parmesan is displayed.\nShot 56: On screen next is grated food, being set as toppings"
    },
    {
        "tiny_desc": "Jumping cat",
        "description": "Cat suddenly jumps at person's foot",
        "user": "leeting2021",
        "caption": "He uses all his courage#funnypets #fyp #lovepetstory",
        "likes": "4.4 Million",
        "comments": "32.7K",
        "bookmarks": "196.1K",
        "shares": "169.3K",
        "originalSound": "original sound - Lovepetstory",
        "url": "videos/22.mp4",
        "video_description": "The video is a brief, 15-second clip primarily focusing on an orange cat positioned in front of a person's sock. No verbal audio is present in the video, but there's a display of text highlighting the TikTok handles '@leeting2021' twice. The central theme seems to revolve around the cat's antics or the interaction between the pet cat and the person, which draws viewer's attention towards the TikTok account named 'leeting2021'.",
        "summary_10": "15-second TikTok video features an orange cat and '@leeting2021' promotion.",
        "summary_25": "The 15-second video displays an orange cat by a sock, with text promoting '@leeting2021' on TikTok. The cat's antics form the main highlight.",
        "summary_50": "The video is a 15-second clip featuring an orange cat near a person's sock. The absence of verbal audio is compensated by a text overlay promoting the TikTok handle '@leeting2021'. The cat's antics or interaction with the person forms the video's focal point.",
        "ocr": "None",
        "shot_descriptions": "SHOT 1 shows a 15 second footage of a cat jumping on the foot of a person's socks."
    },
    {
        "tiny_desc": "Pet parrot",
        "description": "Girl having conversation with her pet parrot",
        "user": "tamarasblue",
        "caption": "Blue Chicken’s 2nd Birthday is next week! Stay tuned for the surprise 🎂 🎉 #funnypets #parrot #irn #funnyanimals #talkingparrot #thebluechicken",
        "likes": "4.3 Million",
        "comments": "35.1K",
        "bookmarks": "132.3K",
        "shares": "302.7K",
        "originalSound": "original sound - Tamara's Blue Chicken",
        "url": "videos/23.mp4",
        "video_description": "The short video opens with a woman holding a blue parrot in her arm. Over the duration of 35 seconds, a text conversation is displayed on the screen, suggesting an exchange between two users, '@tamaranovaa' and '@tamaranoyaa'. The conversation text essentially includes playful and affectionate words that seem to be directed towards a pet, hinting that the woman may possibly be talking to her parrot. During the clip, the woman's dialogue includes, \"Thank you. Kevin can I can I get a boop?\" The tone suggests a loving interaction between the woman and her pet parrot, further elaborating the bond they share.\n",
        "summary_10": "Video depicts woman's unique bond with blue parrot through interaction.",
        "summary_25": "The video illustrates a woman's playful interaction and unique bond with her blue parrot, as highlighted by an on-screen text conversation.\n",
        "summary_50": "The video features a woman affectionately interacting with her blue parrot. A text conversation between '@tamaranovaa' and '@tamaranoyaa' overlays the video, implying a playful interaction with the bird, with the woman even asking it for a 'boop’. It showcases the unique bond between them.\n",
        "ocr": "What are you doing? You being a good boy? You being a good baby? Can I have a kiss? Muahhh Thank you baby! Muahhhhh Zerbert! BOOP You be a good baby.",
        "shot_descriptions": "In the first 35-second shot, a woman is seen with her arm around a blue parrot. There's text appearing on the screen, likely a conversation between some of the video characters. The woman audibly thanks someone named Kevin and then asks for a 'Boop', expressing her gratitude when she gets it."
    },
    {
        "tiny_desc": "Cat touching everything",
        "description": "Various shots of cat touching everything they see",
        "user": "crystal.vettech",
        "caption": "She chose the opposite lol #hospitalcats #vethospital #vetmed #cats #funnycats #cattok #fypage",
        "likes": "2.2 Million",
        "comments": "6404",
        "bookmarks": "65.7K",
        "shares": "37.3K",
        "originalSound": "original sound - Mattness 🖤",
        "url": "videos/25.mp4",
        "video_description": "The video starts with a shot of a cat sitting in an office with a plate of food. The screen displays the text \"@crystalbessmer Veterinary staff: Try not to touch everything\" and the audio transcript notes someone saying, \"Don't put people through.\" In the next shot, the same cat can be seen attempting to climb into a cage, though there is no accompanying audio or text. The third shot transitions to another setting where the cat is absorbed in a scene, seemingly focused on something inside a cage. The audio captures a voice mentioning \"the barn.\" The fourth shot shows the cat standing next to a cage filled with chickens with a voice referencing \"a car game\", but no on-screen text. The video concludes with a shot of two cats sitting on top of a box under the label 'SHOR LINE', again with no spoken words or textual content. The video appears to center around interactions between cats and their surroundings, potentially within a veterinary or barn setting.",
        "summary_10": "The video shows cats interact in an office-barn, implying a veterinary context.",
        "summary_25": "The video portrays cats interacting within a blended office-barn environment, including scenes with cages, chickens, and a 'SHOR LINE' box, suggesting a veterinary setting.",
        "summary_50": "The video features cats within an office-cum-barn setting. Beginning with a cat beside food, the narrative shifts through shots of cats attempting cage interaction, observing chickens, and finally perched atop a 'SHOR LINE' box. Throughout the scenes, the minimal spoken and screen text underscores a vetinary ambiance.\n",
        "ocr": "Veterinary staff: Try not to touch everything\nSHOR LINE",
        "shot_descriptions": "Shot 1: Cats are seen eating sandwiches in an office setting. The on-screen text advises the veterinary staff to avoid touching everything, while the audio urges not to stress people. This shot lasts 2 seconds.\nShot 2: A cat is observed in a cage marked with a sign reading 'bee'. There is no accompanying on-screen text or audio transcript, and this scene lasts for 3 seconds.\nShot 3: A paiemental image of a cat pacing in a cage while scrutinizing another cat is captured. The audio transcript indicates they might be at 'the barn'. No accompanying text on screen is provided, and this shot lasts 2 seconds.\nShot 4: Chickens are seen in cages alongside cats. The audio transcript mentions something about a car game, though there's no relation visible in the scene. The shot is 2 seconds long without any text on screen.\nShot 5: Ending the visuals with a 2-second scene of cats snarking at each other in the box. The on-screen text reads 'SHOR LINE' without any related audio transcript."
    },
    {
        "tiny_desc": "Sad dog",
        "description": "Person consoling dog with meme caption",
        "user": "foxredjax",
        "caption": "At least i got my new ducky #dogsoftiktok #fyp #trend #dogvideos #doglover #dogs #dog #pet #pets #puppy #doggo #family #dogtok #foxredlab #funnydog",
        "likes": "758K",
        "comments": "4251",
        "bookmarks": "52.6K",
        "shares": "7275",
        "originalSound": "Only Love Can Hurt Like This - Paloma Faith",
        "url": "videos/26.mp4",
        "video_description": "The video is a short, 6-second clip posted on TikTok by the user @foxredjax. The video features a dog lying on a bed while a person stares at it. The text across the video screen hints at a scenario where the dog wanted to go into a store to choose a new plush toy but was deterred by the barking of other dogs. Notably, no words are spoken throughout the video; the storyline is conveyed within the text overlay and through the visual portion of the video.",
        "summary_10": "TikTok by @foxredjax shows dog deterred from toy due to barks.\n",
        "summary_25": "This short TikTok clip by @foxredjax features a dog deterred from picking a toy at the store due to barking dogs, as narrated by on-screen text.\n",
        "summary_50": "The 6-second TikTok video by @foxredjax shows a dog lying on a bed while a human watches. The on-screen text narrates an incident where the dog was scared off by other barking dogs at a store, preventing it from choosing a new toy.\n",
        "ocr": "When all you wanted was to go in the shop to pick a new teddy but the other dogs there barked at you",
        "shot_descriptions": "A 6-second shot showing a dog on the bed with its owner. The screen text reveals the dog's most-recent interaction of wanting to go in the shop and select a new teddy, but getting barked at by other dogs."
    },
    {
        "tiny_desc": "S'mores cookie bar",
        "description": "S'mores cookie bar recipe with instructions in only video caption",
        "user": "whatmollymade",
        "caption": "4 simple ingredients and a few minutes before this are in the oven! This is our go-to dessert we take to cookouts. Everyone loves them!\n\nIngredients\n2-3 packages @sweetlorens chocolate chip cookie dough\n2 cups chocolate chips (we used @enjoylifefoods )\n1 cup crushed gluten free graham crackers or @simplemills honey sweet thins\n1-2 cups marshmallow fluff\n\nPress half of your dough in a single layer in the bottom of a parchment line square baking pan. We used about 1 1/2 packs of @sweetlorenscookie dough for this. Use your fingers to press the dough into the pan.\n\nSprinkle the chocolate chips evenly on top and spread them out so the cookies are almost covered in chocolate.\n\nCrumble the graham crackers up and sprinkle them on top of the chocolate layer. The graham crackers have to be the middle layer because they won’t stick to the cookie dough.\n\nScoop the marshmallow fluff on top and use a spatula to spread it out into an even layer. Spray the spatula with nonstick spray before spreading if you’re having trouble with it sticking.\n\nPress the rest of the dough flat and lay them in rows on top of the marshmallow. It’s ok if the marshmallow is showing through.\n\nBake them for 25-30 minutes, until the cookies are set and just golden brown. Keep a close eye on them the last 10 minutes to make sure the edges of the cookies and the marshmallow don’t burn.\n\nLet them cool for at least an hour (ugh I know) then cut them into squares. You can speed up cooling by putting them in the fridge or freezer. #smorescookies #smoresbars #smores #summerdessert",
        "likes": "18.8K",
        "comments": "73",
        "bookmarks": "7827",
        "shares": "1550",
        "originalSound": "Na Na Na - Lay Bankz",
        "url": "videos/27.mp4",
        "video_description": "The short video is a quick TikTok recipe tutorial by @whatmollymade on making gluten-free and dairy-free s'mores cookie bars. The recipe starts by pressing packs of cookie dough into an even layer in a baking dish. This is followed by sprinkling chocolate chips on top. After the chocolate chips, a layer of crushed graham crackers and marshmallow fluff is added. Finally, the entire dish is topped off with another layer of cookies. Once complete, the dish is baked for approximately 25 to 30 minutes. The video provides visual cues to the audience by showing a whole process from the mixing of the ingredients to final product. The s'mores cookie bars recipe is touted as an easy summer dessert with only four ingredients. Various brands and types of gluten-free and dairy-free products are displayed throughout the video.",
        "summary_10": "TikTok video by @whatmollymade shows easy gluten-free s'mores bar recipe.",
        "summary_25": "The TikTok tutorial by @whatmollymade provides a step-by-step guide to making easy, gluten-free, dairy-free s'mores cookie bars, highlighting various product brands.",
        "summary_50": "The TikTok video by @whatmollymade is a quick tutorial on making gluten-free, dairy-free s'mores cookie bars. It guides viewers through the simple layering process then baking, making it an easy and healthy summer dessert option. Various gluten-free and dairy-free product brands are displayed throughout.\n",
        "ocr": "s'mores cookie bars gluten-free | dairy-free BAKE ONE OR ALL SAFE TO BEST BY: SHOW DETAL Sweet CRAFTED WITH ONLY clean INGREDIENTS GLUTEN DAIRY PLANT Project COOKIE DOUGH TREE NUT BASED NET WT 12 OZ (340g) (U PAREVE SAFETO VERIFIED NON GMO nongmoproject.org PEANUT MINI CHIPS 100% REAL CHOCOLATE SEMI-SWEET MADE IN A DEDICATED NUT FREE GLUTEN es'mores cookie bars",
        "shot_descriptions": "Shot 1: The shot presents gluten-free, dairy-free s'mores cookie bars. The audio mentions an easy summer dessert.\nShot 2: The screen displays gluten-free and dairy-free s'mores cookie bars recipe details. The voiceover continues talking about the dessert.\nShot 3: Marshmallow-dipped, gluten-free, dairy-free s'mores cookie bars are shown. The shot audio references the content being made with only four ingredients.\nShot 4: The shot showcases a cookie bar with smores filling. The narration states that the cookie bars only have four ingredients.\nShot 5: The shot features sweet loren's smart cookie bars, highlighted as gluten-free and dairy-free. The audio suggests taking a couple of packs of cookie dough.\nShot 6: Gluten-free, vegan cookie bars are presented. It's shared that pressing dough into packs is part of the process.\nShot 7: A person is shown holding a tray of cookie bars. The narrator continues the cooking process, talking about pressing the dough down.\nShot 8: A baking pan filled with gluten-free, dairy-free cookie bars is featured. The audio instructs on creating an even layer at the bottom.\nShot 9: The image shows enjoy life mini chip chocolate cookies, emphasized as gluten and dairy-free. The narration continues the cookie-making process, speaking about a baking dish.\nShot 10: The scene shows a tray with brownie batter labeled 's mores cookie bars.' The narrator suggests sprinkling it with chocolate chips.\nShot 11: The screen shares a recipe for gluten-free, dairy-free no-flour cookie bars. The step involving sprinkling chocolate chips is completed.\nShot 12: A person is seen scooping out a gluten-free, dairy-free cookie bar from a baking tray. The voiceover explains that the next layer is crushed graham crackers.\nShot 13: A dish of cookie bars on a table is displayed. The audio indicates the addition of marshmallow fluff to the recipe.\nShot 14: A person placing s'mores bars into a baking tray is shown on screen. The voiceover suggests finishing with a layer of cookie dough.\nShot 15: The shot provides a view of more gluten-free cookie bars. The commentary continues to discuss about the last layer of cookies.\nShot 16: Surprisingly, the content of this shot shows the recipe for s'mores cookie bars once again. The audio talks about baking them for 25 minutes.\nShot 17: The image displays the s'mores cookie bars recipe once more. The narrator speaks about the baking time of the bars, extending it to 30 minutes.\nShot 18: A gluten-free, vegan s'mores cookie bar is showcased. There are no spoken instructions in this shot.\nShot 19: Six s'mores cookie bars are exhibited in the shot. The voiceover introduces the bars as the best.\nShot 20: A cookie cutter next to bars labeled 'smores cookie bars' is displayed. There is no audio commentary.\nShot 21: The image shows someone cutting the cookies into bars. The shot ends with the declaration of the cookies being the best summer dessert."
    },
    {
        "tiny_desc": "Strawberry Tiramisu",
        "description": "Fast shot changes, strawberry tiramisu recipe text instructions",
        "user": "spponfulofsi",
        "caption": "Presenting the best summer desssert: Strawberry Tiramisu🍓 #tiramisu #berriesandcream #strawberries #dessert #recipes #summerdessert #easyrecipe #foodtiktok #tiramisucake #strawberrytiramisu",
        "likes": "2445",
        "comments": "11",
        "bookmarks": "1515",
        "shares": "223",
        "originalSound": "Could You Be Loved - Bob Marley & The Wailers",
        "url": "videos/28.mp4",
        "video_description": "The video is a step-by-step tutorial by TikTok user @spoonfulofsi about preparing Strawberry Tiramisu. It begins with brief text overlays mentioning the dish name. The first steps include mixing strawberry preserves and orange juice. Next, the whipping cream is added into a mixing bowl, along with powdered sugar and vanilla. After that, the whipped cream is combined with mascarpone cheese, and it's all thoroughly mixed together. The assembly process is shown next. Ladyfingers are carefully dipped and layered, and then generously covered with the cream filling. A layer of strawberry slices is added afterwards. These steps are repeated until the dish is assembled to the required height. The dessert is then covered and placed in the refrigerator overnight. Prior to serving, freshly sliced strawberries are arranged on the top as the final touch. The end of the video shows the plated scrumptious dessert ready to be savored.",
        "summary_10": "The video outlines @spoonfulofsi's complete process of making Strawberry Tiramisu.\n",
        "summary_25": "The video with TikTok user @spoonfulofsi presents a step-by-step guide for creating Strawberry Tiramisu, explaining ingredient mixing, layering, overnight refrigeration, and final garnishing.\n",
        "summary_50": "The video features TikTok user @spoonfulofsi demonstrating how to prepare Strawberry Tiramisu. The tutorial guides viewers through the ingredients, mixing process, and proper assembly, including layers of ladyfingers, mascarpone cream, and strawberries. The dish is refrigerated overnight and garnished with fresh strawberries before serving.",
        "ocr": "How to make Strawberry Tiramisu, 1 jar strawberry preserves, 1/2 cup orange juice, 1 + 1/3 cup whipping cream, 1/3 cup powdered sugar 1 tsp vanilla, Fold in whipped cream with 16 oz mascarpone cheese, Layer of dipped ladyfingers, Layer of cream filling, Layer of strawberries, Repeat layers, Repeat layers., Cover & refrigerate overnight, Add freshly sliced strawberries when ready to serve",
        "shot_descriptions": "Shot 1: The video begins with the introduction of a strawberry tiramisu tutorial.\nShot 2: In the next shot, a jar of strawberry preserves is poured into a bowl.\nShot 3: A mixture including orange juice is whisked in a bowl.\nShot 4: Raspberry sauce is being prepared with a whisk.\nShot 5: Buttercream frosting is being prepared in an electric mixer.\nShot 6: The next step involves mixing powdered sugar in a mixer.\nShot 7: A batter is shown being mixed, followed by\nShot 8: White icing being mixed with an electric mixer.\nShot 9: A person is seen mixing whipped cream using a mixer.\nShot 10: The process of whipped cream mixing continues in this shot.\nShot 11: Mixer is being used for whipping cream preparation.\nShot 12: Whipping cream and mascarpone cheese are brought together and mixed.\nShot 13: The tutorial goes on to demonstrate how to whip frosting.\nShot 14: The layering process begins with the placement of dipped ladyfingers.\nShot 15: A casserole dish is filled with sauce next.\nShot 16: Sausage sticks and tomato sauce are placed on a counter.\nShot 17: The layering process continues, this time with a cream filling on ice cream sticks.\nShot 18: The tutorial demonstrates how layers are made with cream filling.\nShot 19: Next is the layering of strawberries on a white cream-covered baking pan.\nShot 20: The layering steps are furthered by adding cream cheese and strawberries.\nShot 21: Fresh strawberries are cut and layered in a square baking dish.\nShot 22: The layered ingredients are shown, ready to be baked.\nShot 23: The dish now contains baked fries covered in sauce.\nShot 24: Baked bananas are added to the dish, topped with whipped cream.\nShot 25: The layering process is repeated, visually demonstrating the word 'Repeat layers.'\nShot 26: A close-up of whipped cream set on a marble counter is shown.\nShot 27: Following this, there's a shot showing off the cream cheese frosting cover on the baking dish.\nShot 28: The video proceeds with a short segment on making vegan cheesecake.\nShot 29: A woman is shown cutting strawberries which will be added to the dish.\nShot 30: The tutorial emphasizes adding the sliced strawberries when ready to serve.\nShot 31: The next shot steadily zooms in on strawberries and whipped cream atop a large serving tray.\nShot 32: Strawberries are again shown, this time immersed in white cheesecake batter.\nShot 33: The dish, now containing strawberries on top, is presented in a baking pan.\nShot 34: The next shot showcases someone slicing strawberries on a plate.\nShot 35: A large pan of strawberries with a white plate in the background is displayed.\nShot 36: The final steps of laying out the strawberry cake are demonstrated.\nShot 37: The video ends showcasing a slice of the freshly made strawberry cake on a plate."
    },
    {
        "tiny_desc": "Money giveaway",
        "description": "Man gives a service worker gift and money ",
        "user": "mdmotivator",
        "caption": "“My family really needs this” 🥺❤️ (GoFundMe L1VE) #quiznos #family #money #hungry #food #cookie #surprise #helping",
        "likes": "2.5 Million",
        "comments": "17.1K",
        "bookmarks": "103.2K",
        "shares": "5779",
        "originalSound": "original sound - Zachery Dereniowski",
        "url": "videos/29.mp4",
        "video_description": "The video begins with a bearded man asking a cashier at a fast food restaurant if he could get a cookie since he lost his wallet and was very hungry. The cashier's empathetic response was to let the man have his meal, which brightened up the bearded man's day. The cashier who identified himself as Zack mentioned that making someone's day was part of his job. The bearded man reveals that he doesn't need the cookie and instead, he had a surprise for the first kind person he met. He then presents Zack with a stay at a five-star hotel. The bearded man expresses his appreciation to Zack, saying his wife who is a nurse and has been working tirelessly, could now benefit from this treat. Later on, he surprises Zack yet again by pulling out his wallet, which he claimed he had lost earlier, and showing him $1000 in cash. Zack was very touched and said he would use it to help pay off the medical bills for his newborn nephew in the Philippines who had a difficult birth and was facing a big medical bill. They share a heartfelt moment at the end, expressing their love for each other.",
        "summary_10": "Man rewards kind cashier with hotel stay and $1000 cash.",
        "summary_25": "A man tests a cashier's kindness, rewarding it with a hotel stay and $1000. The cashier, Zack, plans to use the money for his nephew's medical bills.",
        "summary_50": "A man pretends to lose his wallet to test the kindness of a fast-food cashier, Zack. Zack feeds the man, so the man rewards him with a five-star hotel stay and $1000 cash. Zack plans to use the money for his nephew's medical bills in the Philippines.",
        "ocr": "Do you have like a couple bucks? Coca-Cola To help me get this cookie? - Sorry bro, uhm... Coca I don't... Ah dang... What was the question? Your Order PERMIT PHIL CLASSIC FOR A LI PHILL PH I lost my wallet... FOR A LIMI PHILLY SHE STE FOR A LIMITED TIME NEW! I was trying to get a cookie... Total FOR A really hungry... You're hungry? QUIZNOS SAVOURY Starving... You lost your wallet? Alright, enjoy it... CAlright, enjoy it... QUIZNOS QUIZN Alright, enjoy it..QUIZNOS Are you sure? QUIZ? Are you sure? Enjoy it... AVOURY VOURY JOURY URY I'm Zack man... Zack? You made my day man... It's all good... That's my job... IN A IN A RUSH? CLASSIC ITALIAN What do you mean? A RUSH? I make the day for everyone... RUSH? Help people out right? How long have you been working here for? 26 years man... I don't need the cookie... For the first person who was going to be kind to me... Seriously? Seriously? QUIZNOS I had something for you... What is that? RADOX Paradox... It's a It's a 5 star hotel... Yeah right... Yeah right.... For you... Because you were going to give me a cookie... My wife... She's a nurse... She's been working for so long... Tired and everything... QUIZNOS You gave me this for 2 night stay in the hotel.... wife and my kids there... I'm going to bring my I actually got another surprise for you Jay... What's that? My wallet's right here... I had a $1000 bucks... Cash! Serious? Congrats man... I can't do that... Im serious man..os I'm serious man.NOS But, are you sure? Positive... ОС 100% man... My nephew in the Philippines... Had a kid... She's had a caesarean... At 7 months... They had to get him out... Because the cord was around his neck... Oh my God... He has a big huge bill... To pay... I'm giving this to him... The $1000? Yeah... The whole thing? Love you... Love you too bro...",
        "shot_descriptions": "Shot 1: In the opening scene lasting 2 seconds, a man with his phone out and a Coke is attempting to acquire a cookie through a not so comprehensible exchange.\nShot 2: The second shot, also 2 seconds long, shows a bearded man purchasing food at a grocery store. The on-screen text suggests an awkward interaction.\nShot 3: In the third shot that lasts for just a second, a coffee shop employee is recorded on a tablet, with on-screen text suggesting their confusion about a question.\nShot 4: Spanning 4 seconds, this shot features a man by a computer, engaging in a conversation about losing his wallet, being hungry, and wanting a cookie, as indicated by the on-screen text.\nShot 5: In the fifth shot of 2 seconds, a man is seen standing in front of a chicken nuggets griller, with a brief exchange of words indicated on-screen.\nShot 6: The sixth shot, the longest so far at 11 seconds, shows what appears to be an employee-to-employee exchange with somewhat overlapping comments, and one of them named Zak expressing that making people's day is his job.\nShot 7: In 3 seconds-long shot seven, there's an interaction about how helping people is part of their job and the length of employment of one person for 26 years.\nShot 8: The eighth shot, lasting 7 seconds, shows a customer and waiter interaction at a Thai restaurant, with the customer rejecting a cookie and revealing a surprise for the kind person.\nShot 9: In the ninth shot of 2 seconds duration, there's a highlighting of a five-star hotel, as indicated by the on-screen text and audio.\nShot 10: In the tenth shot that lasts for 3 seconds, the man at the restaurant appears to be shocked and covers his face in response to a gesture of gratitude because he offered a cookie.\nShot 11: The eleventh shot, spanning 8 seconds, shows a man in a tuxedo talking about the hard work of his nurse wife, his family, and an opportunity for a hotel stay given to him.\nShot 12: In the twelfth shot, running the longest for 14 seconds, there's an unfolding of another surprise: a reveal of a hidden wallet with $1000, igniting reactions of disbelief.\nShot 13: The thirteenth shot, 3 seconds long, involves a confirmatory exchange about the legitimacy of the surprise, establishing the seriousness of the gesture.\nShot 14: Spanning 5 seconds, shot fourteen contains an account of a medical emergency concerning a nephew in the Philippines, introducing a new, serious note to the interaction.\nShot 15: The fifteenth shot, lasting 2 seconds, continues the story about the medical complications involving the newborn and the ensuing large medical bill.\nShot 16: In this 6 seconds-long sixteenth shot, a man behind a fast-food counter decides to give all the surprise cash to his relative to pay the medical bill.\nShot 17: The final shot of 1 second concludes with a warm exchange of Love you messages, enhancing the sense of camaraderie and humanity that permeates the entire video."
    },
    {
        "tiny_desc": "Family dress surprise",
        "description": "Family wearing matching outfits, surprised mother with one",
        "user": "josdavis",
        "caption": "Is it every mom’s secret/not secret wish to have her kids dressed in matching outfifs at 40 years old?! 😂😂😂 loooove surprising my mom on her bday! #surprise #christmas #vlogmas2022 #surprisingpeople #fyp",
        "likes": "1.4 Million",
        "comments": "5368",
        "bookmarks": "16.5K",
        "shares": "9597",
        "originalSound": "Monkeys Spinning Monkeys - Kevin MacLeod & Kevin The Monkey",
        "url": "videos/30.mp4",
        "video_description": "The video is a heartwarming story of a daughter surprising her mother for her birthday. The video opens with a daughter in a green dress dancing in front of a Christmas tree, revealing through overlaid text that they surprised their mother with matching outfits. The scene then shifts to two women talking in a room, where the daughter narrates how she duped her mother into wearing the matching dress, making her believe it was an accidental mix-up. As excitement builds up, they present her with her own green dress, and the mother seems initially upset. However, in a delightful twist, the mother not only accepts the matchy-matchy present but also embraces it fully. Scenes of the mother and daughter joyfully dancing and taking selfies in their green sequin dresses fill the rest of the video as the fun implications of the 'spoiler alert' text become apparent. The video concludes with a group shot of three women celebrating, all donned in the same green sequin dress, illustrating a successful and enjoyable birthday surprise.",
        "summary_10": "Daughter surprises mother with matching dresses; they celebrate joyfully.\n",
        "summary_25": "In the video, a daughter surprises her mother with matching green dresses for her birthday, leading to joyful celebrations, selfies, and dancing.",
        "summary_50": "A daughter surprises her mother with matching green dresses on her birthday. Initially perplexed, the mother fully embraces the present, and they joyfully celebrate, taking selfies and dancing in their matching outfits. The video concludes with a delightful scene of celebration in their sequin dresses.",
        "ocr": "for my mom's birthday this year we surprised her with matching outfits I distracted her asking her to zip me up an accident at first she actually thought it was she actually thought it Maok then we gave her one SPOILER ALERT: she was obsessed",
        "shot_descriptions": "Shot 1: A woman is seen standing next to a Christmas tree, donned in a green dress. Text on the screen explains that they surprised their mom with matching outfits for her birthday.\nShot 2: Filled with text on screen detailing the birthday surprise, this shot features a woman in a green dress being zipped up by a friend as part of the plan.\nShot 3: In silent shot, a woman is depicted standing next to her daughter at a table.\nShot 4: Dialogue indicates a gift was given as two women, both in festive green outfits, are seen dancing.\nShot 5: An elderly woman stands by a table, looking visibly upset, contradicting the text on screen that suggests that she's obsessed with the surprise.\nShot 6: Features a woman gravitating in her green dress, stationed on a hardwood floor.\nShot 7: An enthralling sight as two women decked in green dresses showcase their dance moves.\nShot 8: Focusing on a woman in a shimmering green sequin dress, joyfully dancing in the living room.\nShot 9: The joyous vibe continues with two women dressed in green sequined outfits, dancing together.\nShot 10: This brief shot features four women in green outfits, striking a pose.\nShot 11: Marking the video's end, the final shot is of four persons aptly dressed in green sequin attire, posing for a picture."
    },
    {
        "tiny_desc": "Duet dancing video",
        "description": "Two people doing a dance that went viral from a broadway show",
        "user": "haile.ferrier",
        "caption": "@piercewheeler  and I doing #maiselchallenge  #m#maisel m#missmaisel b#broadway d#dearevanhansen t#tour m#musictheatre c#choreography",
        "likes": "188K",
        "comments": "1086",
        "bookmarks": "11K",
        "shares": "1711",
        "originalSound": "Pink Shoe Laces - The Chordettes",
        "url": "videos/31.mp4",
        "video_description": "The video starts with a shot lasting for 32 seconds featuring three young individuals. They are seen dancing in what appears to be an art class and the text displayed on screen is the users' profile handles - @haile.ferrier, @haileferrier, and @haile ferrier Tik Tok ec 2999 lege 999. The audio playing in the background includes comments about someone not being as attractive as expected due to his wildly eccentric wardrobe, particularly the pink shoelaces on his regular shoes and his hat band that sports a bold purple shade. The dialogue hints at an intriguing, possibly flamboyant character, who is yet to appear in the video.",
        "summary_10": "Video features three dancing youngsters; audio hints at unseen character.",
        "summary_25": "The video shows three youngsters dancing in an art class for 32 seconds. Audio commentary hints at an intriguing yet unseen character.\n",
        "summary_50": "In the 32-second video, three youngsters are seen dancing in an art class. Their profile handles are displayed on-screen. The audio suggests an unattractive yet unique character, with pink shoelaces and a purple hat, possibly hinting to a flamboyant personality yet to appear in further shots.",
        "ocr": "ec 2999 lege 999",
        "shot_descriptions": "Shot 1 lasts for 32 seconds and features two people in jeans dancing in a studio. The audio outlines someone's distinctive attire, discussing his unusual clothing choices such as wearing the same shoes with pink shoelaces and a purple hat band."
    },
    {
        "tiny_desc": "Spray painting shirt design",
        "description": "Using spray paint and spaghetti to create a cool tshirt design ",
        "user": "andcarli",
        "caption": "none",
        "likes": "1.7 Million",
        "comments": "11.5K",
        "bookmarks": "90.7K",
        "shares": "8720",
        "originalSound": "som original - Andcarli",
        "url": "videos/32.mp4",
        "video_description": "The video is a step-by-step tutorial by a TikTok user @andcarli on how to add a paint-dyed design to a t-shirt. It opens with an image of a pile of spaghetti-like straws juxtaposed against a backdrop of a blank t-shirt. Then, it transitions into a series of shots showing a man meticulously adding paint to the t-shirt. The design consists of a creative spiral contour that is strikingly colored in black and pink hues. At several points, the video shows a close shot of the man's hands as he goes about painting the intricate pattern on the shirt. The video then continues the tutorial showing techniques on how to create similar designs using different colors, like a red and black spiral pattern. At the end of the video, the man sips a red drink, possibly to emphasize the relaxing and enjoyable aspect of the activity. Throughout the tutorial, no speech is present but text does appear occasionally including user identifier and other texts such as 'Super Cl Super Col' and 'Andcarli 11 12 12 Part 2 11'. The video, serving as a t-shirt painting tutorial, utilizes TikTok to deliver valuable instructions and insights on DIY shirt dyeing.",
        "summary_10": "The TikTok video by @andcarli is a DIY t-shirt painting guide.\n",
        "summary_25": "The video is a relaxing TikTok DIY tutorial by @andcarli on creating a spiral design on a t-shirt using various painting techniques.\n",
        "summary_50": "The TikTok video by @andcarli is a DIY t-shirt painting tutorial showcasing how to create a black and pink spiral design. The guide progresses through each step, highlighting detailed painting methods, including techniques for designing using different colors. The activity is presented as relaxing and enjoyable.",
        "ocr": "None",
        "shot_descriptions": "Shot 1: A brief shot, showcasing a person in a t-shirt while crafting a spiral from a straw.\nShot 2: In silence, a creative scene unfolds where someone employs paint and straws to design a t-shirt.\nShot 3: A man appears to be actively engaged in making a t-shirt featuring a striking red and black circle, while the screen text exclaims 'Super Cl Super Col'.\nShot 4: The viewer is treated to a flash of creativity, as a white t-shirt is transformed with the careful application of a black and pink circle.\nShot 5: A longer shot, the vid captures an artist meticulously painting a black and pink spiral onto a white t-shirt.\nShot 6: Focusing on a t-shirt adorned with a large spiral, the artist continues their intricate paintwork.\nShot 7: A man is spotted skillfully using paint to build a vibrant spiral on a t-shirt, reflecting a clear theme of fabric and art.\nShot 8: Another quiet but compelling shot of a t-shirt coming to life under the artist's hands, spirals of pink and black taking form.\nShot 9: An extensive scene unveils the detailed application of paint, a man shaping a black and pink swirled pattern on a t-shirt.\nShot 10: The scene shifts as a man is seen spray-painting a black and red spiral onto a table instead of a t-shirt.\nShot 11: In another extended shot, a man is witnessed crafting a tie-dye spiral design on a t-shirt, suggesting a connection to previous shots.\nShot 12: The video presents a clip showing a DIY galaxy tie-dye t-shirt, reflecting the overall theme of crafting creative t-shirt designs.\nShot 13: The reel moves to another shot associated with the shared motif of tie-dye t-shirts.\nShot 14: The concluding shot mixes in some dialogue, the words 'Angie, Callie,' punctuating the scene as a man is seen using a red phone. On-screen text reveals a series of numbers and naming the user 'Andcarli'."
    },
    {
        "tiny_desc": "Singing servers restaurant",
        "description": "A restaurant where the servers sing to the customers ",
        "user": "gaylesbroadwayrose",
        "caption": "Always ready to serve up your food AND a show! 🤩⭐️ #wedonttalkaboutbruno  #gaylesbroadwayrose",
        "likes": "105.9K",
        "comments": "202",
        "bookmarks": "7428",
        "shares": "403",
        "originalSound": "original audio - Gayle's Broadway Rose",
        "url": "videos/33.mp4",
        "video_description": "The video is a 45-second clip set in Gayle's Broadway Rose, a popular restaurant in New York City. The video spotlights a singing server who is also acquainted with the TikTok platform. Illustrated on the screen during the video is text that includes the eatery's name, a mention of its singing servers, and various iterations of the phrase, 'We don't talk about Bruno'. Unfortunately, the audio transcript is missing, but the visual description informs us that a man is seen talking in the restaurant. This video is essentially a short glimpse into the unique, interactive atmosphere at Gayle's Broadway Rose, where the staff enhances the dining experience by incorporating elements of social media trends.",
        "summary_10": "Video: singing server at NYC's Gayle's Broadway Rose references TikTok trends.",
        "summary_25": "The video shows a singing server at NYC's Gayle's Broadway Rose, integrating social media trends like the phrase 'We don't talk about Bruno'.\n",
        "summary_50": "The 45-second video features a singing server at Gayle's Broadway Rose, a well-known NYC restaurant. Text on screen references a trendy phrase 'We don't talk about Bruno' and the man talking in the restaurant suggests a vibrant interactive environment influenced by social media trends.",
        "ocr": "Gayle's Broadway Rose NYC / Singing Servers this to-go and we heard We Don't Talk About Bruno, Our guests said can I get this to-go and we heard Bruno.",
        "shot_descriptions": "Shot 1: This 45-second shot reveals a man holding a microphone at a bar. The prominent text on screen indicates it's Gayle's Broadway Rose in NYC and includes a caption about singing servers and a request heard from guests."
    },
    {
        "tiny_desc": "Mushroom humidifier",
        "description": "Someone showing their new humidifier that's shaped like a mushroo million",
        "user": "olliedreamer",
        "caption": "I love it so much 💙🌧️🍄 #fyp  #tiktokshop  #humidifier",
        "likes": "236.5K",
        "comments": "1302",
        "bookmarks": "26.4K",
        "shares": "2737",
        "originalSound": "time travel - chief. & nobuddy",
        "url": "videos/34.mp4",
        "video_description": "The video starts with a man who proudly declares his newfound love for humidifiers and gives a shoutout to a specific smart humidifier. The video then transitions between various scenes of him showcasing a small mushroom-shaped humidifier with a cloud-shaped top which emits a bright, color-changing light. He mentions that the humidifier can change colors and is highly customizable, allowing users to select their preferred light color. Further, the man appreciates that the device comes pre-assembled for ease of use, pointing out this feature would be particularly beneficial for people who may struggle with setting up such devices. He also mentions that the humidifier allows users to modify the mist/stream and that it supports essential oils, functioning as a diffuser as well. The man ends the video proclaiming his obsession with the humidifier, suggesting it has become a significant part of his life and personality. The overall video appears to be a fun, informal review or commentary on the product.",
        "summary_10": "Man humorously reviews a versatile, color-changing humidifier, showing obsession.",
        "summary_25": "A man comedically reviews a customizable, pre-assembled, color-changing humidifier that also serves as a diffuser, expressing his newfound obsession with it.",
        "summary_50": "The video features a man humorously reviewing a smart, color-changing humidifier. He mentions its customizable features, the fact it comes pre-assembled, and its ability to function as a diffuser. He concludes by asserting his newfound obsession with the product.\n",
        "ocr": "None",
        "shot_descriptions": "Shot 1: For six seconds, a man in glasses is seen standing in front of a humidifier while expressing his newfound fondness for humidifiers. The screen also displays the text 'TikTok'.\nShot 2: In a quick three-second shot, the same man gives a thumbs up as he stands next to a mushroom humidifier, making a playful comment about the product's combination of aesthetics and function.\nShot 3: For four seconds, the scene shows the man mesmerized by a small water-droplet air humidifier he's holding.\nShot 4: Over eight seconds, the video focuses on a review of the Tekkin mushroom air purifier, with the man commenting on the device's color-changing feature and user-friendly design.\nShot 5: This five-second shot features the man, still in his glasses, next to a humidifier, jokingly expressing relief over the product coming pre-assembled.\nShot 6: This lengthy 14-second shot shows the man enthusiastically demonstrating and discussing the ability to customize the mist and color of a purple mushroom humidifier.\nShot 7: The seventh shot, within three seconds, simply shows a young man in his room holding a humidifier.\nShot 8: Lasting five seconds, the eighth shot foregrounds the man, glasses still on, as he reveals that the humidifier doubles as an essential oil diffuser, expressing his excitement at trying out this feature.\nShot 9: For the final six-second shot, the man embraces his new obsession with a mushroom-shaped air humidifier, humorously declaring it as his new defining trait."
    },
    {
        "tiny_desc": "Baby in corner",
        "description": "Young child is in trouble and has to stand in the corner",
        "user": "funny.life6.usa",
        "caption": "Funnyvideos #funny  #meme  #comedyvideo  #viral  #xuhuong",
        "likes": "40.3K",
        "comments": "351",
        "bookmarks": "2585",
        "shares": "1098",
        "originalSound": "original sound - Funny's Video",
        "url": "videos/36.mp4",
        "video_description": "The video is a humorous and heartwarming clip lasting 33 seconds. It centers around a toddler standing by the door, seemingly requesting something from his parents. The screen repeatedly displays varying text saying \"Dad wasn't messing around\", indicating that the father is engaging with his child in a playful but instructive manner. This is reinforced by the audio transcript where the father is heard encouraging the toddler to apologize, presumably to his brother, and give him a hug as a form of reconciliation. The video is a showcase of a light-hearted and wholesome interaction within a family dynamic.",
        "summary_10": "The video humorously shows a dad teaching his toddler reconciliation.\n",
        "summary_25": "The video humorously portrays a dad teaching his toddler about reconciliation through playful interaction and apologizing, underlining a healthy family dynamic.",
        "summary_50": "The 33-second family video humorously captures a parent teaching his toddler about apologizing and reconciling, demonstrated via a potential scenario with his sibling. The text onscreen further emphasizes the dad's assertive, but playful approach to child-rearing. The video embodies a light-hearted and wholesome family dynamic.",
        "ocr": "Dad wasn't messing around Yup! Sorry Bruh",
        "shot_descriptions": "The first shot, lasting for 33 seconds, features a child standing in front of a door. The on-screen text indicates a humoristic situation involving a dad and another individual. The audio in the shot captures a conversation about someone needing to apologize and give a hug to the brother, likely after a dispute."
    },
    {
        "tiny_desc": "Shoe trading",
        "description": "Two people repeatedly trying to make high offer for sneakers",
        "user": "sneakersouffle",
        "caption": "They were not feeling that offer #fyp #sneakers #sneakerhead",
        "likes": "599.8K",
        "comments": "1145",
        "bookmarks": "23.7K",
        "shares": "457",
        "originalSound": "original sound - SneakerSouffle",
        "url": "videos/38.mp4",
        "video_description": "The video is a series of shots revolving around the purchase, sale and trading of sneakers, which takes place within a convention setting. It begins with a man opening a Nike box and discussing whether the shoes are new or used. Visitors are then shown discussing prices for the various shoes, with examples of haggling and assessing the value of the items based on their condition, brand, and scuffs being prevalent. As attendees haggle over prices, it is clear that the condition of the shoes and their rarity are primary factors in determining their value. Many shots feature different types of shoe models varying from Nike to Adobe Dunks. Interestingly, trade options are considered as an alternative to selling. Moments of decision making and negotiation about the price of sneakers underscore the video's theme. The video ends with a discussion about a pair of shoes referred to as \"these\", which the speaker would buy lower than the discussed price. Finally, he comments that the resale price would be around $112. Overall, the video captures the dynamics of shoe-trading conventions.",
        "summary_10": "Video shows sneaker trading at a convention, ending in haggling.",
        "summary_25": "The video illustrates a sneaker convention, highlighting haggling based on shoe condition and rarity. The final discussion points to a lower-than-expected purchase and $112 resale.",
        "summary_50": "The video captures a convention scene revolving around buying, selling, and trading sneakers. It underscores haggling over prices based on shoes' condition and rarity, also considering trade options. Featuring multiple shoe models, the video ends with a potential purchase below the discussed price and a resale value of $112.",
        "ocr": "brand new or used? used more done. How doers do you have a price in mind? $200? How I'd be pretty far off probably just pass for now then I'll probably just pass for now then hard to sell just with the scuffs they'd what about $175? I couldn't I couldn't I couldn't brand new, I'm usually paying around that so for used, like this too... to buy a used shoe with all the scuffs on it so it'd be under $100 appreciate it F MOMENTS LATER what we got? okay t more done. they're used once t more done how much did you want for these? bought it for $165 you want $165? I traded them oh you traded the breds for these? yeah I buy them new for $150 them so I'd probably be at like the other guy over there offering for $130 would honestly take that I would honestly take that that's a pretty good price would you do $130? I would not was it the guy with the beard? yeah that's a pretty good price ne. I would do that I'm back again what we get this time? brand new adobe dunks I'd be kind of low on those I'd be kind of low on those honest y I'd be kind of low on those how much? let me see what I'd be at yeah I'd be a bit lower on these... yeah I'd be a bit lower on these... payout's 74 bucks... they go for $112",
        "shot_descriptions": "Shot 1: A man is seen purchasing a box of shoes at a trade show.\nShot 2: A young man in a blue t-shirt is haggling over the price of a bag he's buying, with the discussion concerning the condition and pricing of used shoes.\nShot 3: A kid is seen opening a box of shoes at a convention.\nShot 4: Teasers for the upcoming scene are displayed, using the text 'MOMENTS LATER'.\nShot 5: A scene shows two people unveiling a pair of sneakers from a box.\nShot 6: Conversations continue about pricing of the shoes during a walk through an expo booth.\nShot 7: A man with a mustache is seen at an art show, discussing the pricing.\nShot 8: A mustached man is at a trade show discussing trading sneakers.\nShot 9: A lady and another person in a store continue the discussion on pricing of the sneakers and comparing with a rival's offer.\nShot 10: A haggling conversation is between a woman and her boy at an event, bouncing off offers around $130.\nShot 11: Transition scene with a text stating 'a few moments later' against a red background.\nShot 12: A young person is seen opening an empty shoe box and discussing the sneaker's potential value.\nShot 13: A young man at a trade show looking at his cellphone indicates the price deal might be lower than expected.\nShot 14: A girl is seen engaging in a conversation in a booth about the disparity in selling price and payout."
    },
    {
        "tiny_desc": "Cool apple pealer",
        "description": "Demonstration f a novel apple peeler",
        "user": "shein_official",
        "caption": "Looking for a faster way to prep fruit and veggies? 🍅🍏 Keep your eyes peeled 👀😉 #SHEINforAll #SHEINhome #homedecor #home #fyp",
        "likes": "305.6K",
        "comments": "858",
        "bookmarks": "30.9K",
        "shares": "3049",
        "originalSound": "original sound - SHEIN",
        "url": "videos/42.mp4",
        "video_description": "The video starts by showing a small toy model being pulled from a green cup, under the banner of Tik Tok. The subsequent shots feature various green objects and appliances such as a machine with two swivel chairs, a container, a coffee maker, an electric toothbrush device, and a manicure station. The focus then moves to various cutting devices, starting with an apple cutter labelled as 'takiko'. Several activities involving cutting apples are depicted, including using an apple slicer to chop the fruit into strips, a person holding a fruit shaped like an apple, and an apple being juiced. The video continues to spotlight different tools used in the kitchen like a vegetable juicer slicing an onion and a tool named 'apple and pear twister peeler'. There are also demonstrations of bacon and apple slicing on a glass plate, the application of a handheld fruit cutter, and finally the use of a tomato cutter. The concluding sequences display some sliced tomatoes on a plate with a green slicer. The overall video seems to be a product showcase for a variety of green kitchen appliances, tools and devices available on the SheIn platform as indicated by the text on screen '@shein_official'.",
        "summary_10": "SheIn's green kitchen appliances, including cutters and juicer, are demonstrated.\n",
        "summary_25": "The video promotes SheIn's green kitchen appliances and tools, including various cutters and a juicer, with practical demonstrations concluding with tomato slicing.",
        "summary_50": "The video showcases various green kitchen appliances and tools on the SheIn platform. It features several cutting devices including apple and tomato cutters, a vegetable juicer, and a 'apple and pear twister peeler', with demonstrations of their usage. The video concludes by slicing tomatoes using a green slicer.",
        "ocr": "None",
        "shot_descriptions": "Shot 1: A person is shown using a green plastic machine to make a cake.\nShot 2: A green smoothie machine with a plastic spoon attached is presented.\nShot 3: The shot focuses on a woman's hands holding a small green box with holes.\nShot 4: The scene showcases a kawaii pencil holder pencil sharpener in green color.\nShot 5: A person is viewed placing a toothbrush into a holder.\nShot 6: Green tongs with white plates are displayed on a white counter.\nShot 7: A person is shown slicing an apple with a machine.\nShot 8: An individual is trying to use an apple peeler with a fruit.\nShot 9: Someone is seen using an apple peeler with red strips in front of them.\nShot 10: A shot illustrates someone holding a 3D printed red apple.\nShot 11: An apple slicer is presented.\nShot 12: A review of a TikTok apple slicer and peeler is shown.\nShot 13: The video highlights a woman using an onion slicer.\nShot 14: A person is seen peeling an apple with a slicer.\nShot 15: A shot focuses on a person with a pink apple being cut on top of a glass tray.\nShot 16: A person is depicted cutting an apple using a green apple cutter.\nShot 17: The shot presents an apple corer made out of plastic.\nShot 18: An apple slicer is being used to cut apple slices.\nShot 19: A shot of a person cutting an apple into slices with a knife is shown.\nShot 20: A hand is shown putting a pink ball onto a glass baking sheet.\nShot 21: The video features a person cutting a red tomato in a plastic cutter.\nShot 22: The scene includes a tomato slicer being used to slice a tomato.\nShot 23: The final shot shows tomatoes being placed on a green vegetable peeler."
    },
    {
        "tiny_desc": "70's hair styling",
        "description": "Barber cutting woman's hair to a 70's hairstyle",
        "user": "hairbyamela",
        "caption": "70s Hairstyle 🤩 #foryoupage #fyp #hairvideos #hairgoals #fypシ゚viral #explore #70s #80s #hair",
        "likes": "10.6K",
        "comments": "125",
        "bookmarks": "1545",
        "shares": "3016",
        "originalSound": "Mgm Hair Studio - Disco Lines",
        "url": "videos/43.mp4",
        "video_description": "The video is a stylistic montage featuring demonstrations of 70s hairstyles for women. The video begins with the introduction of the theme, \"70s Hair @hairbyamela,\" setting the tone for the hair styling tutorial aimed at women. The subsequent scenes demonstrate a woman cutting her hair slickly with scissors, an act indicative of a transformation about to take place. This is followed by scenes of a woman with long black hair undergoing a hairstyle change. The setting is established as a hair salon in Ahmedabad, a city in India. Various scenes showcase the hairstyling process carried out by experienced hairstylists. The later part of the video also indicates the emergence of this 70s hairstyle as a trend among Indian women. The video concludes by offering a peek at the final result of the styled hair with a fringe, highlighting the influence of the 70s era on modern hairstyles. Despite no spoken dialogue, the text on screen and shot descriptions convey complete information regarding the hair-styling process.",
        "summary_10": "The video highlights a 70s hairstyle tutorial emphasizing its Indian revival.",
        "summary_25": "The video features a tutorial on 70s hairstyles for women, including a self-cut and salon styling, showcasing the trend's revival in India.",
        "summary_50": "The video demonstrates women's 70s hairstyles, starting with a self-cut, progressing to styling in an Ahmedabad salon. Various hairstyling scenes highlight the revival of this trend among Indian women. The video concludes with a stylish fringe look, reflecting the 70s influence on modern hairstyles.\n",
        "ocr": "0s HAIR M Had GM r Studi Hair Su Hair Stu tudio MG Hair Stuc M G",
        "shot_descriptions": "Shot 1: The opening shot presents us with the text '70s Hair @hairbyamela', suggesting this is taking place in a 70's hair salon in Delhi.\nShot 2: This scene shows the use of black hair color on a person's hair, in what could be a display or tutorial of a hair styling process.\nShot 3: A woman is seen getting her hair dyed black in this scene.\nShot 4: In this short five-second shot, we’re presented with a scene that appears to have a 70's hairstyle for women being displayed or worked on by someone potentially named Raja Raju.\nShot 5: This 10-second shot features something related to a salon called '70', possibly a promotional offer of free hair treatment.\nShot 6: This brief cut displays a scene set in the '70s hair style' concept, located at a Bollywood salon in Delhi.\nShot 7: Here we move to Chennai, with a focus on MG salon, one of the best hair salons there.\nShot 8: This 2-second shot gives a glimpse of a black and white image of a woman standing in front of her hair dryer.\nShot 9: This scene brings forward some long hairstyle ideas for women inspired by the 70's.\nShot 10: The last shot reveals the back of a woman's head, showing off her gray hair, possibly another hairstyle being showcased."
    },
    {
        "tiny_desc": "dancing to sped up uptown funk",
        "description": "Two girls doing short dance to sped up version of Uptown Funk",
        "user": "www.02mrn",
        "caption": "🤭✌🏻",
        "likes": "3.6 Million",
        "comments": "28.6K",
        "bookmarks": "544.9K",
        "shares": "54K",
        "originalSound": "original sound - Phoebe",
        "url": "videos/44.mp4",
        "video_description": "The video opens with a 15-second shot that features two women who are standing in a parking garage. They are dancing around, predominantly using their hands as part of their movements. During this scene, the handle \"@www.02mrn @\" appears on the screen. The audio segment includes a voice, most likely from one of the women, uttering the phrase \"I told myself.\"",
        "summary_10": "Video shows two dancing women, on-screen tag, voice says phrase.",
        "summary_25": "The 15-second video features two women hand-dancing in a garage, an on-screen handle \"@www.02mrn @\", and an audio saying \"I told myself\".",
        "summary_50": "In a 15-second video, two women are seen dancing in a parking garage, mainly using hand movements. The handle \"@www.02mrn @\" is displayed on-screen while a voice says, \"I told myself\".",
        "ocr": "None",
        "shot_descriptions": "Shot 1 is a 15-second scene showcasing two women dancing in a parking lot. Audio reveals a voice uttering 'I told myself.'"
    },
    {
        "tiny_desc": "blindfolded couple dancing",
        "description": "Pregnant wife and husband blindfold dance to see if they dance the same",
        "user": "joshandsav",
        "caption": "not him thinking i was gonna twerk lol",
        "likes": "457.3K",
        "comments": "340",
        "bookmarks": "12.3K",
        "shares": "379",
        "originalSound": "original sound - DJ Discretion",
        "url": "videos/45.mp4",
        "video_description": "The video is centered on two individuals dancing, presumably for a TikTok video as indicated by the text that appears on the screen in the first shot. Over the course of several shots, they perform a unique routine with one of the dancers being blindfolded. Their dancing ranges from solo performances to a mirror dance performed together. The short video captures the fun and intriguing antics of internet dance trends, closing with a dance scene involving a woman in a hat and another individual. The video, however, doesn't contain much dialogue, with the only audible speech being in the initial shot. The words spoken are somewhat mystifying and potentially lyrics to the song they're dancing to, stating, 'Like it's the waterfall in love again on so my cycling shiny. I can never think of us. Reminiscence definition. Can you tell me what you want?'. The unique mixture of dance and minimal dialogue provides an entertaining and captivating viewing experience.",
        "summary_10": "The video features two individuals executing a blindfolded TikTok dance.",
        "summary_25": "The video showcases a captivating TikTok dance routine, featuring two individuals, with one blindfolded, performing a range of solo and duo moves.",
        "summary_50": "The video features two individuals performing a TikTok dance routine with one blindfolded, spanning solo and duo performances. The dance evolves across several shots, lacks dialogues, but captivates viewers with its intriguing moves and the perplexing spoken words in the initial shot.",
        "ocr": "blindfolding ourselves to see if we dance the same",
        "shot_descriptions": "Shot 1: This 12-second shot shows two people wearing blindfolds in a room. They discuss various topics while being blindfolded which includes love, cycling, and reminiscing.\nShot 2: In this brief, one-second shot, a woman is observed smiling into a mirror while wearing a visor. There is no accompanying audio or text.\nShot 3: The third shot, lasting for 5 seconds, features a TV show video. The characters in the show are blindfolding themselves one at a time. No on-screen text or audio is present throughout the duration of this shot.\nShot 4: This one-second shot captures a moment where two people are observing each other in a mirror. The shot omits any audio or text.\nShot 5: The 3-second fifth shot focuses on a man and a woman who are part of the new Hawaiian Terek campaign. No on-screen text or audio accompanies this visual."
    },
    {
        "tiny_desc": "OnePlus Phone Review",
        "description": "A quick in-depth reaction to the unboxing of a new OnePlus phone",
        "user": "akerzypcs",
        "caption": "#stitch with @OnePlus USA I heard jf you use c0de “DanThaBACKPACK” you get a free backpack with your order 👀 #oneplus #oneplusnord #onepluspartner #smartphone #android #akerzys",
        "likes": "14.7K",
        "comments": "326",
        "bookmarks": "1884",
        "shares": "64",
        "originalSound": "original sound - Danny",
        "url": "videos/46.mp4",
        "video_description": "The video is a review and description of N30, a new smartphone model by OnePlus that costs $300, and it might be the best smartphone for this price in 2023 according to the review. The video features the reviewer talking about the impressive specifications of the phone, including its 108-megapixel camera, 120 Hertz 6.72 inch screen, 8GB RAM and 128GB storage. The reviewer also mentions its fast 5,000 milliamp battery and how the phone offers good value for the price. As a bonus, it comes with free noise-canceling Nord earbuds. Towards the end, the man, who seems to try different features of the phone, encourages viewers to share their thoughts about the OnePlus gadget.",
        "summary_10": "Video reviews OnePlus N30's top specs and free Nord earbuds.",
        "summary_25": "The video reviews the $300 OnePlus N30 launching in 2023, emphasizing its impressive specs and includes noise-canceling Nord earbuds.",
        "summary_50": "The video is a review of the OnePlus N30: a $300 smartphone launching in 2023. It highlights its top-notch specs like a 108-megapixel camera, 120Hz 6.72-inch display, 8GB RAM, 128GB storage, and a 5,000 milliamp battery. Additionally, it comes with complimentary noise-canceling Nord earbuds.",
        "ocr": "This might be the best smartphone N30 that 300 dollars can buy in 2023. So OnePlus just released their new and I. But let's see for. Irving the N30 has a 11:34 Demo Phone 120hz OnePlus Nord N30 6.72 inch with 8gb of ram 128gb. Pretty good you're getting. Battery for the price give you as well. To test you think.",
        "shot_descriptions": "SHOT 1: A smartphone is showcased, possibly the best within a $300 range for the year 2023, as stipulated through on-screen text and audio.\nSHOT 2: There's a query about when a new phone will be launched, it's unclear as it cuts off abruptly.\nSHOT 3: The new OnePlus smartphone, costing $300, is introduced, with the text and transcript both noting that the specs are supposed to be immaculate.\nSHOT 4: The introduction builds suspense as the man on screen suggests they will check out the features of the new OnePlus phone, the N30.\nSHOT 5: The high-end specs of the new OnePlus N30 are enumerated, including a camera with 108 megapixels, 120Hz screen, 8 gigabytes of RAM, and 128 gigabytes of storage.\nSHOT 6: The speaker lauds the phone's features, including a large, high-quality screen and ample RAM, considering the $300 price point.\nSHOT 7: An impressive 5000 milliamp battery is mentioned. In addition, it's revealed that the purchase includes free noise-canceling Nord buds.\nSHOT 8: The speaker expresses enthusiasm to test out this phone, also inviting viewer opinions on the new OnePlus N30."
    },
    {
        "tiny_desc": "1 = 0.999...",
        "description": "Person explaining why 0.999... = 1 while showing work ",
        "user": "pinkpencilmath",
        "caption": "Another video with proof that 1 = 0.999…! 🤔 #math #fractions #mathtricks #algebra #ratios",
        "likes": "265.1K",
        "comments": "7809",
        "bookmarks": "23,6K",
        "shares": "2449",
        "originalSound": "Still D.R.E - Instrumental - Dr. Dre",
        "url": "videos/47.mp4",
        "video_description": "The video is a mathematical explanation shared by an account named @pinkpencilmath on TikTok. The video runs for 25 seconds where a person with a pink pencil draws mathematical equations to present a thought-provoking mathematical equation. The equation is about fractional and decimal equivalences. The question raised is that if 1/3 equals 0.333 repeating and 2/3 equals 0.666 repeating, then logically, adding them should result in 1. The question proposes that however, adding the decimal equivalents leads to 0.999 repeating which also equals 3/3 or 1. With this, the video challenges the viewer to consider if 1 could possibly equal 0.999 repeating. Interesting sound theory and visuals in the video make it engaging and thought-provoking.",
        "summary_10": "@pinkpencilmath's TikTok video questions decimal equivalency, using fractions.\n",
        "summary_25": "The TikTok video by @pinkpencilmath challenges viewers by showing 1/3 and 2/3 summing to 0.999 repeating, not 1, provoking thought on decimal equivalency.",
        "summary_50": "The 25-second TikTok video by @pinkpencilmath presents a mathematical paradox. Using a pink pencil, the speaker illustrates how 1/3 and 2/3 equate to 0.999 repeating instead of 1, challenging conventional thinking about decimal and fractional equivalents. The creative explanation makes the video intriguing and engaging.\n",
        "ocr": "tell me if this makes sense to you if 1/3 equals to 0.333 repeating 0.33 and 2/3 equals 0.666... repeating and 0.3 repeating 0.666... plus 0.6 repeating + 0.99 pretty straightforward right? but if 3/3 equals to 1 then does 1 equal to which equals to 3/3? what do you think?",
        "shot_descriptions": "Shot 1: The 25-second shot features a person drawing a number with a pink pencil, while discussing a math concept via an audio transcript. The math concept involves fractions and their decimal equivalents, questioning the notion that 1 equals 0.9 repeating."
    },
    {
        "tiny_desc": "job interview tips",
        "description": "Person giving advice for what to say during job interview and then acting out scenario",
        "user": "erinmcgoff",
        "caption": "😩 This question is sooo tricky to answer without coming off arrogant or cocky.\n\n🔥 But here’s my pro tip: attribute the strength to feedback or a compliment.\n\nInstead of:\n❌ “I’m extremely good at communication, it’s a gift.”\nTry:\n✅ “My previous managers have always noted how proactive I am when it comes to communication. While I’m an independent worker, I love to proactively give my managers updates before they feel the need to ask!”\n\n✨ You want the interviewer to think “Wow! That’s a really important strength to have in this role. And they said it so modestly!!”\n\n🫶🏼 Typically, you want to hit on a soft, interpersonal skill. Sure — you can say your greatest strength is photoshop, but it just ends up sounding flat.\n\nTry picking something that’s appropriate for you industry. For example:\n\nVideo editor ➡️ collaboration\nEarly childhood educator ➡️ playfulness\nProject manager ➡️ organization\nClient lead ➡️ tine management\nNurse ➡️ compassion\nMarketing coordinator ➡️ communication\n911 operator ➡️ composure\n#career #careeradvice #careertiktok #careertok #resume #coverletter #college #internship #jobinterview",
        "likes": "139.8K",
        "comments": "256",
        "bookmarks": "74.4K",
        "shares": "8217",
        "originalSound": "original sound - AdviceWithErin ✨",
        "url": "videos/48.mp4",
        "video_description": "The video is a guide on how to answer the common job interview question, \"What is your greatest strength?\" In the opening scene, the question is introduced (@erinmcgoff). Next, we watch an interview scenario where the interviewee gives improper responses, such as stating she is a good worker because she shows up on time, expressing she is highly intelligent but being unable to provide an instant answer, and citing internet advice to say her strength is time management. The video then shifts to model the appropriate way to respond to the question. It suggests that appropriate responses include indicating qualities validated by previous employers, like dependability, and narrating tangible personal attributes such as tenacity, resourcefulness, and scrappiness. It also promotes the idea of relating the positive feedback one received in the past, such as being told one's optimistic attitude is a valuable addition to the team. The video concludes with a nod towards a topic of discussion for another video - dealing with anxiety.",
        "summary_10": "The video instructs on articulating strengths in job interviews, pointing at handling anxiety next.\n",
        "summary_25": "The video demonstrates how to proficiently answer \"What is your greatest strength?\" contrasting poor responses with effective ones and hints at a topic on anxiety handling.",
        "summary_50": "The video guides viewers on effectively answering the job interview question, \"What is your greatest strength?\" It illustrates poor responses, then models effective answers showcasing qualities like dependability, tenacity and a positive attitude. The video ends by indicating the next topic will be dealing with anxiety.",
        "ocr": "How to answer: What is your greatest in a job interview strength? What would you say is your greatest strength? Wrong Um, well I'm like a good employee..? I mean I show up on time? Not me blanking on answer lol Time management! is that right? that's what the internet told me to say. Correct, I've had previous managers tell me that I'm really dependable. They can always count on me to get the work done right and on time, and that always means a lot to me when I hear that. One of my greatest strengths is tenacity! I'll do whatever it takes if I have a goal, I will find a solution. I'm resourceful, I'm scrappy without a fight. Something that I've been complimented on in the past is my attitude. Attributing the strength to a compliment from others signals modesty. No matter what's going on, I always try to bring positive energy to the team, and I've been told this is something that people really appreciate.",
        "shot_descriptions": "Shot 1: The video opens with a 4-second clip discussing how to address the question about one's greatest strength during a job interview.\nShot 2: Titles on the screen read 'LEGGO.' The audio plays a short thank you, while the visual info suggests the video focuses on job interview tips and answering the strength question.\nShot 3: Over the span of 3 seconds, an interviewer asks, What would you say is your greatest strength? This is shown visually and also heard in the audio.\nShot 4: For 4 seconds, a person stumbles to answer the question about their greatest strength, claiming to be a good and punctual employee.\nShot 5: A woman with blonde hair and glasses suggests that she is very intelligent in a 2-second clip without any on-screen text.\nShot 6: Another woman jokes about struggling to find an answer to the strength question in a brief, undecorated 2-second shot.\nShot 7: Over 4 seconds, a woman with glasses posits that her time management skills, instilled by the internet, are her greatest strength.\nShot 8: The same question about the interviewee's greatest strength is repeated in the audio, although there's no new text on-screen in this 4-second clip.\nShot 9: A woman talks at length (16 seconds) about being told she is reliable and tenacious by previous managers, claiming it's one of her greatest strengths and believing in the importance of resourcefulness and not giving up easily.\nShot 10: In an 8-second shot, a woman points out how her positive attitude, something that she's often praised for, contributes towards a team's dynamic. The text on-screen suggests that attributing personal strength to others' compliments can signal modesty.\nShot 11: A 0-second shot ends the video with an image of a woman taking a selfie, neither text on-screen nor audio transcript is provided."
    },
    {
        "tiny_desc": "woman hiding pimple",
        "description": "Girl showing how she uses Tiktok filter to hide acne",
        "user": "lianaparmezana",
        "caption": "😳",
        "likes": "777.4K",
        "comments": "7010",
        "bookmarks": "40K",
        "shares": "950",
        "originalSound": "оригинальный звук - snezha:D",
        "url": "videos/49.mp4",
        "video_description": "The video starts off with a young girl in a green shirt and face makeup discussing her recent confusion. This shot lasts for 5 seconds and features a text overlay promoting a TikTok account by the name of \"@lianaparmezana\". In the following 9-second shot, text on the screen appears, reading \"real skin\", likely referencing a tutorial or informational content about skincare. However, there isn't any narrative audio in this shot to provide further information. Overall, the video raises curiosity about skincare or makeup application techniques, essentially directing the audience to explore this account further on TikTok.",
        "summary_10": "Video on TikTok '@lianaparmezana' hints at a skincare tutorial.",
        "summary_25": "A video promotes \"@lianaparmezana\" on TikTok, featuring a girl discussing confusion and alluding to a skincare tutorial with \"real skin\" text.",
        "summary_50": "The video features a girl discussing confusion, and promotes TikTok handle \"@lianaparmezana\". It suggests a skincare tutorial with text reading \"real skin\", enhancing curiosity about skincare techniques.",
        "ocr": "fake skin real skin",
        "shot_descriptions": "SHOT 1: In this 5-second shot, Kartika Sahdev discusses her confusion lately. This is alongside the visual of her discussing the issue related to her fake skin and skin cancer. \nSHOT 2: The second shot lasts 9 seconds, displaying a younger woman with red skin and acne. The shot is captioned 'real skin'."
    },
    {
        "tiny_desc": "toddler choosing foods",
        "description": "Toddler choosing between randomly generated foods to make tourney of his favorite foods",
        "user": "bmilly32",
        "caption": "Favorite food: two year old edition. #food #toddler #funny #chocolate #icecrea million",
        "likes": "1.6 Million",
        "comments": "6713",
        "bookmarks": "102.7K",
        "shares": "15.6K",
        "originalSound": "original sound - Brian Miller",
        "url": "videos/50.mp4",
        "video_description": "The video is 83 seconds long and features a man and a child with screens displaying their faces. Throughout the video, various text snippets are displayed on the screen, mostly food-related, which seems to be a fun game comparing different types of food. Some examples include 'hamburger vs ice cream' and 'pizza vs french fries'. The man on screen engages the child participant in questions regarding his preferred choices such as 'barbecue or cookies', 'chips or waffles', and 'cheese or wings'. The video concludes with the statement 'you are what you eat'. The playful, interactive nature of this video could possibly be an engaging and entertaining way to discuss food preferences.",
        "summary_10": "Video shows a man and child playfully discussing food choices.",
        "summary_25": "This 83-second video features a man and a child playfully discussing food preferences through an on-screen game, ending with the message \"You are what you eat\".\n",
        "summary_50": "The 83-second video involves a man and a child participating in a playful food-related game. The screens showing their faces display various snack choices, prompting an interactive discussion on their preferences. The video concludes with the fun message, \"You are what you eat.\" It's an entertaining way to explore food likes.\n",
        "ocr": "BARBECUE OR COOKIES WAFFLE CHIPS (OR HAMBURGER ICE CREAM 32 CHEESE Wings HOT DOG CHOCOLATE VO Seafood Sushi FRENCH FRIES PIZZA LASAGNA CHILI OR) JO CHO WAFFL YOU ARE WHAT YOU EAT! CE CREA Million",
        "shot_descriptions": "SHOT 1: For 83 seconds, a man interacts with a child while playing a video game, verbally deliberating over different food items like barbecue, cookies, chips, waffles, ice cream, and many others. Meanwhile, the screen displays the message 'YOU ARE WHAT YOU EAT!' alongside numerous food names."
    },
    {
        "tiny_desc": "child swiftie challenge",
        "description": "Mom and small daughter trying to match the lyrics of All Too Well (10 minutes)",
        "user": "sheeguin",
        "caption": "joinin’ the trend 🤭 #atw #atw10minuteversion #bridge #quiz #quiztime #quizchallenge #taylornation #taylorswiftedit #taylorsversion #taylorswifttok #taylorswiftchallenge #taylor #swift #swiftok #swifttok #swiftie #swifties #trend #viral #trending #fyp #foryou #foryoupage #trendingsong #acting #taylorswiftedit",
        "likes": "638.7K",
        "comments": "1377",
        "bookmarks": "24.1K",
        "shares": "2841",
        "originalSound": "all too well - marie⸆⸉",
        "url": "videos/51.mp4",
        "video_description": "The video is a short-format clip of 44 seconds, primarily featuring a melancholic narrative derived from various textual inputs scattered throughout the background. It visually portrays a toddler who seems to be in some emotional distress, providing a somber atmosphere to the video. Accompanied by the silence in the audio, this distress is further emphasized with the on-screen text which reads \"well maybe we got lost in...well maybe we got relations translation @sheeguin TikTok maybe this thing was a...masterpiece beauty piece till you tore it all up. running scared I was...there dared TikTok I remember it all to well. and you call me up...one day again just to break me like a promise. so casually...cruel cold 100\". This somewhat tragic statement heavily indicates that the video is a narrative of a failed relationship and its subsequent impact on the individuals involved. The mother of the toddler, towards the end of the video, encourages the child to call her in an attempt to console her.",
        "summary_10": "Video presents distressed toddler, on-screen broken relationship text, mother consoles.",
        "summary_25": "The video shows a silent, upset toddler and on-screen text suggesting a broken relationship, while her mother attempts consolation.",
        "summary_50": "This 44-second video depicts a distressed toddler with no audible speech, emphasizing her sadness through on-screen text narration suggestive of a failed relationship. The child's mother tries to console her, emphasizing the somber atmosphere.",
        "ocr": "Well maybe we got lost in... Well maybe we got relations translation, maybe this thing was a... masterpiece beauty piece till you tore it all up. Running scared I was... there dared, I remember it all too well. And you call me up... one day again just to break me like a promise. So casually... cruel cold 100.",
        "shot_descriptions": "Shot 1 lasts for 44 seconds, displaying the text 'well maybe we got lost... so casually cruel cold 100'. The scene features a child in emotional distress being comforted by their mother."
    },
    {
        "tiny_desc": "dropping buckets",
        "description": "Guy stacking buckets of sand followed by stitch ",
        "user": "khaby.lame",
        "caption": "My mother came to see me and she did not applaud either. #learnfromkhaby #comic #comedy",
        "likes": "444.2K",
        "comments": "7823",
        "bookmarks": "10.7K",
        "shares": "1328",
        "originalSound": "My mother came to see me and she did not applaud either. #learnfromkhaby #comic #comedy",
        "url": "videos/52.mp4",
        "video_description": "The short-form video opens with a display of a TikTok handle, @khaby.lame. In the first shot, an elderly man can be seen interacting with a set of red buckets, perhaps in a playful manner. The scene then transitions to an interior setting where a group of individuals is examining a sculpture. The central figure in the next shot is a man clad in a red shirt, who stands prominently amongst a crowd. The username @khaby.lame appears on the screen once again, suggesting that he may be the individual in the red shirt. The video concludes with a strangely engaging scene of a man situated amidst trash cans in what appears to be a residential living room space. No audible dialogue or notable text features throughout the video.",
        "summary_10": "TikTok video features @khaby.lame, an elderly man, sculpture onlookers, and cluttered living room.",
        "summary_25": "The video featuring TikTok user @khaby.lame, showcases an elderly man with buckets, onlookers at a sculpture, a prominent man in red, and ends with a man amidst trash cans.",
        "summary_50": "The video displays TikTok user @khaby.lame and progresses through scenes featuring an elderly man with red buckets, people examining a sculpture, a central male figure in red, and concludes with a man among trash cans in a living room. No audible dialogues or notable texts are present.",
        "ocr": "None",
        "shot_descriptions": "Shot 1: An elderly man is seen balancing buckets in an art gallery for a brief span of four seconds.\nShot 2: The next shot lasting for a second features a man observing an exhibition surrounded by other people.\nShot 3: Following this, a lasting scene of ten seconds depicts an old man handling a rolled up red carpet in front of an audience.\nShot 4: Finally, a much longer scene, stretching over thirty-one seconds, presents a man amusing himself with a blue bucket."
    },
    {
        "tiny_desc": "Dog holding toy",
        "description": "Dog cherishing his toy by holding it up in the air",
        "user": "aguyandagolden",
        "caption": "Teddy either chews up his toys or cherishes them. #dog #goldenretriever",
        "likes": "593.8K",
        "comments": "2950",
        "bookmarks": "28.8K",
        "shares": "12.6K",
        "originalSound": "original sound - AGuyAndAGolden",
        "url": "videos/53.mp4",
        "video_description": "The short-form video is themed around a golden retriever and its interaction with a toy. There are two shots in total, each lasting 6 seconds. The first shot focuses on a video shot through a pet camera, referred to as a \"petcube q\", that captures a golden retriever dog having a delightful time with its toy. There is no speech in the shot, but the text on the screen refers to a TikTok handle @aguyandagolden and a caption that articulates the dog was spotted having a \"special moment\" with its toy. The second clip in the video depicts a more clear and visually engaging scenario of the golden retriever earnestly playing with a stuffed dog toy in front of a cozy fireplace. This shot also contains no audio transcript but simply enforces the earlier text displayed on screen mentioning a \"special moment with his toy\". This video is a lighthearted and fun representation of a pet having a joyful moment with its favorite toy.",
        "summary_10": "Video shows a golden retriever's 'special moment' with a toy.",
        "summary_25": "The video features a golden retriever delightfully playing with a toy across two shots, highlighting a 'special moment' captured via a pet camera.\n",
        "summary_50": "The video captures a golden retriever's playful interaction with its toy across two 6-second shots. The first shot, taken through a pet camera, is further elaborated in the second as the dog joyfully plays with a stuffed toy in front of a fireplace. Their 'special moment' is highlighted throughout.\n",
        "ocr": "caught my dog having a special moment with his toy...",
        "shot_descriptions": "Shot 1 displays a dog amusing itself with a toy while laying on the floor. The scene lasts for 6 seconds.\nShot 2, also of 6 seconds, showcases a golden retriever as it joyfully plays on the floor, located just in front of a fireplace."
    },
    {
        "tiny_desc": "photographer captures cat",
        "description": "Photographer showing silly picture he took of his cat",
        "user": "stickyboy69",
        "caption": "I hope this photo inspires you",
        "likes": "440.8K",
        "comments": "4950",
        "bookmarks": "32.2K",
        "shares": "1875",
        "originalSound": "Hi - Angel Foresca",
        "url": "videos/54.mp4",
        "video_description": "The short video consists of two shots and lasts for a total of seven seconds. The first shot, lasting for four seconds, focuses on a young boy who is taking a selfie while holding a camera. In this shot, the boy identifies himself as a photographer. This is also emphasized by the text displayed on the screen which is an on-screen version of his spoken words, indicating his social media handle as well. The second shot, which runs for three seconds, features a cat sitting on the ground, stretching its front legs. During this shot, the boy comments, \"that's a thing,\" but there isn't any text displayed on the screen during this moment. This video captures the boy's photography activities, possibly shared via social media.",
        "summary_10": "Seven-second video: boy's selfie, self-identification as photographer, comments on cat.",
        "summary_25": "In this seven-second video, a boy self-identifies as a photographer while taking a selfie, then comments on a stretching cat.",
        "summary_50": "This seven-second video features two shots; the first presents a boy taking a selfie with a camera, identifying himself as a photographer and sharing his social media handle. The second shot shows a cat stretching, with the boy commenting, \"that's a thing.\"\n",
        "ocr": "im a photographer and i took this photo...",
        "shot_descriptions": "Shot 1: A man, who claims to be a photographer, is shown holding a camera and taking a selfie for a duration of 4 seconds.\nShot 2: A tabby cat is seen sitting with his hind legs up and paws open while someone off-screen comments 'That's a thing' during a 3 second duration."
    },
    {
        "tiny_desc": "how to manicure",
        "description": "how to create a 2-toned blue French tip manicure",
        "user": "lightslacquer",
        "caption": "how to create a two toned french tip manicure💙products used: St Clair and Porter💅#nails #nailpolish #nailinspo #nailsoftiktok #nailart #nailtutorial #diynails #diymanicure #nailsathome #diynailsathome #easynails #easynailsathome #almondnails #frenchtipnails #bluenails",
        "likes": "137.6K",
        "comments": "187",
        "bookmarks": "17.9K",
        "shares": "3312",
        "originalSound": "original sound - vibey music 🎶 🕺 🪩",
        "url": "videos/55.mp4",
        "video_description": "The video is a tutorial on how to create a two-toned blue French tip manicure. The tutorial consists of quick one-second shots that, when put together, form a step-by-step guide for designing a two-tone blue French tip manicure. At the start, on-screen text explains the video's purpose: \"how to create a two-toned blue French tip manicure @lightslacquer\". As the shots progress, viewers are shown different stages of the manicure process, each step contributing to the creation of the final two-tone blue nails. The process involves a person's hand with the finished manicure displayed, and nail polish being applied. Towards the end, the video features a close-up of someone's hand revealing the finished two-tone blue and white nails. The video concludes with a shot bearing the Tik Tok logo, suggesting the tutorial's publication on the popular social media platform. The video does not contain background commentary, leaving it mainly driven by its visuals.",
        "summary_10": "It's a tutorial video for a two-toned blue French manicure.",
        "summary_25": "This video is a visual tutorial showing how to create a two-toned blue French tip manicure, from starting point to finish, ending with a Tik Tok logo.",
        "summary_50": "The video is a step-by-step visual tutorial on creating a two-toned blue French tip manicure. It consists of quick shots showcasing the manicure process, starting with a base of blue nails and concluding with a close-up of the finished blue and white nails. It’s largely visually driven with a Tik Tok logo conclusion.",
        "ocr": "how to create a two toned blue French tip manicure",
        "shot_descriptions": "Shot 1: Presents an introduction to a tutorial on creating a two-toned blue French tip manicure with text on the screen and audio.\nShot 2: In shot 2, 'How to create a two-tone' is heard, accompanied by the visual of creating a blue French tip manicure.\nShot 3: Shot 3 continues the instructional voice-over, adding the colored references 'blue? French tip,' while visualizing the manicure process.\nShot 4: The fourth shot repeats the information of creating a two-toned blue French manicure, with the added query in the audio transcript, 'manicures?'\nShot 5: In the fifth shot, you watch as nails are painted blue, without any supplemental text or audio.\nShot 6: Shot 6 is a silent clip showing a blue nail being placed on a finger.\nShot 7: During shot 7, the frame is filled with two blue and white nail polishes in someone's hand. The text 'Tik Tok' is displayed although there's no dialogue.\nShot 8: The final shot, shot 8, shows a hand with beautifully painted nails in blue and white, with no accompanying text or audio."
    },
    {
        "tiny_desc": "sneaker eraser meme",
        "description": "Mom & Dad gifts son sneaker cleaners to clean their shoes",
        "user": "theclassiiics",
        "caption": "When your Mom & Dad buy you something 😂 #comedy #comedyvideos #funnyvideos #classiiic @Summer Wallace #TikTokShopSummerSale #sneakerasers #mom #dad #moms #dads #kids #parents",
        "likes": "738.9K",
        "comments": "1922",
        "bookmarks": "59.4K",
        "shares": "1843",
        "originalSound": "original sound - 𝕋𝕙𝕖ℂ𝕝𝕒𝕤𝕤𝕚𝕚𝕚𝕔𝕤",
        "url": "videos/56.mp4",
        "video_description": "The video revolves around a young man receiving a gift from his parents, who are seen in their home. The parents surprise their son with Sneaker Erasers as a gift, an item he has desired for some time. Initially, he is excited, but there's a catch. His mom instructs him on how to use the erasers correctly to clean the sneakers. She explains the process of wetting the eraser, scrubbing gently with the white side, and then flipping it over to the orange side to wipe away the residue. The son is thankful for the gift and finds using the Sneaker Erasers to be very easy. However, towards the end of the video, the son realizes that his parents also have a pile of their own shoes for him to clean. They hint that the Sneaker Erasers are not exclusively for him, and he should also look after their shoes, leaving him slightly taken aback.",
        "summary_10": "Boy gets Sneaker Erasers as gift, ends up cleaning parents' shoes.",
        "summary_25": "A young man receives Sneaker Erasers as a gift from his parents, learns to use them, but unknowingly, also to clean their shoes.",
        "summary_50": "A young man in the video receives Sneaker Erasers from his parents as a desired gift. His mom instructs him on proper usage, and he's enthusiastic about the easiness. But he later discovers it's also for cleaning his parents' shoes, leading to a surprising twist.",
        "ocr": "When your Mom & Dad buy you something, why is it so quiet here? what you doing? just playing my game yeah okay that's what I thought anyway We got you SneakERASERS oh man about time what you mean about time? no I'm saying dad you know I wanted them thank you, I appreciate it wait no no no before you use the eraser you have to go wet it first oh okay please go wet it first alright yeah (No text on screen) all right, so how do I use it? so you gotta make sure you scrub gently because you're gonna waste it use the white side and gently scrub and then flip it over to the orange side so you can wipe away the residue okay I will thank you guys I've been wanting these for a while you're welcome sweetie yeah you better not waste them I won't dad oh man this is so cool isn't that so easy? right, you see how it's working? yeah super easy set these right here what are those for? just need to take care of those for us, cool? but those are y'all shoes I thought you bought this for me? right tootles actually you know if you want come on oh",
        "shot_descriptions": "Shot 1 Summary: For 32 seconds, the scene is focused on a man and a woman in a living room. The on-screen text captures a conversation about a gift, namely 'SneakERASERS,' that the parents have bought for their child. The child expresses gratitude and is instructed to wet the erasers before use.\nShot 2 Summary: The second shot, which has no duration, shows a person tying his shoes, symbolizing the gift mentioned in the previous shot, with the text when mom & dad buy you something appearing on screen, hinting at the narrative.\nShot 3 Summary: Over the span of 25 seconds, a man is seen tying his colorful sneakers while the on-screen text and audio transcript detail how to use 'SneakERASERS.' The man thanks his parents and promises not to waste the gift, expressing excitement.\nShot 4 Summary: The concluding shot, of 29 seconds, presents a woman and a man in an apartment. The audio transcript and on-screen text carry on the narrative, indicating that the man finds the 'SneakERASERS' easy to use. However, he is asked to also take care of his parents' shoes, sparking a bit of confusion and banter."
    },
    {
        "tiny_desc": "train next to coffee",
        "description": "Showcase of coffee shop that is right next to a train track",
        "user": "visit",
        "caption": "Would you have your coffee next to this train in 📍#Vietnam ?😲 🎥IG: @cynthiabalogh #visitvietnam #vietnamtravel #traveltiktok #traveltok",
        "likes": "99.8K",
        "comments": "642",
        "bookmarks": "5359",
        "shares": "1433",
        "originalSound": "original sound - Ian Asher",
        "url": "videos/57.mp4",
        "video_description": "The short video focuses on the \"Tiko's The Train Restaurant\" located in Chiang Mai. The video begins with a display text '@visit,' suggesting that the footage is promotional or travel-oriented. A speech is heard with a soothing voice remarking 'Beautiful.' in admiration, and the shot's length is around ten seconds. From this brief video, viewers can acquire a sense of the visual aesthetics and overall appeal of Tiko's The Train Restaurant.",
        "summary_10": "Video promotes \"Tiko's The Train Restaurant\", highlighting its beauty.",
        "summary_25": "The video showcases \"Tiko's The Train Restaurant\" in Chiang Mai, promoting its aesthetic appeal in a ten-second clip with a voiceover praising its beauty.",
        "summary_50": "The brief video focuses on \"Tiko's The Train Restaurant\" in Chiang Mai, featuring '@visit' on-screen text indicating promotion. With a voice remarking 'Beautiful,' it offers a ten-second glimpse into the locale's aesthetic appeal.",
        "ocr": "None",
        "shot_descriptions": "During the first 10-second shot of the video, a train ride is depicted leading to a beautiful girl. The subject expresses her awe verbally, stating 'Beautiful'. The screen also displays the text '@visit'."
    },
    {
        "tiny_desc": "egyptian blue lotus",
        "description": "Description of Egyptian river lily/blue lotus flower",
        "user": "affirmation.love",
        "caption": "Organic Egyptian",
        "likes": "184.8K",
        "comments": "0",
        "bookmarks": "39.4K",
        "shares": "7253",
        "originalSound": "original sound - Affirmation.love",
        "url": "videos/58.mp4",
        "video_description": "The video is an informational feature about the Egyptian Water Lily, also known as the Blue Lotus flower. Responding to a TikTok query about the \"flower of choice\" for ancient Egyptian Pharaohs, the narrator reveals that it is the Blue Lotus. The flower, known for its mildly psychoactive properties, can be consumed as a tea or smoked alone, occasionally blended with other flowers like mugwort and lavender. Historically, the Blue Lotus has been used to induce relaxation, enhance mood, ignite feelings of passion. Some individuals also report an enhanced sense of awareness, and the flower is used to facilitate vivid and lucid dreaming. The video ends highlighting the plant's potential as a significant alternative for people dealing with insomnia or anxiety, as well as anyone seeking an alternative to their usual flowers during periods of tolerance break. The video contains multiple shots of the plant, its preparation, and consumption methods.",
        "summary_10": "The video covers Blue Lotus flower's uses and therapeutic benefits.\n",
        "summary_25": "The video depicts the Blue Lotus flower's historical importance, psychoactive properties, consumption methods, and its usage as a therapy for insomnia and anxiety.\n",
        "summary_50": "The video explains the Egyptian Water Lily or Blue Lotus flower's significance, favored by ancient Egyptian Pharaohs. It outlines the flower's mildly psychoactive properties, consumption methods, and its application in inducing relaxation, enhancing mood, facilitating vivid dreaming. It also suggests its use as an alternative therapy for insomnia or anxiety.",
        "ocr": "Reply to mosheree's comment What about blue lotus Do you know what the flower of choice was? Did you know it was highly favored by the pharaohs of ancient Egypt? this is the Egyptian Water Lily It was none Egyptian water lily, other than the also known as the Blue Lotus Flower. Commonly referred to as it's a mildly psychoactive flower that's often consumed as a tea the blue lotus here I'm just using mugwort and lavender for reference Blue Lotus has been used for thousands of years In this instance, I'll mention to promote a deep state of relaxation to promote a deep state of and lavender for comparison and it is also known to have mood-lifting and aphrodisiac effects effects For thousands of years, the blue lotus For many people also experience a subtle increase employed to induce a profound state of alone, occasionally blended with It is renowned for its mood-enhancing qualities this is a really unique alternative plant and its ability to ignite feelings of for people who have insomnia or anxiety tolerance break some individuals Moreover, report an augmented sense of awareness, while others utilize it to facilitate vivid and lucid dreaming. to promote remarkable This plant serves as an alternative for disiac mood-lifting as anyone seeking an alternative to their usual flower during a period of tolerance break. and others take it to promote",
        "shot_descriptions": "Shot 1 summary: There is text on screen revealing a trivia about the favored flower of the pharaohs while the screen shows a box of weed with related captions.\nShot 2 summary: The audio continues the dialog from previous shot about ancient Egypt and the screen displays a box of purple powder indicating that it's a pharaohs' favor.\nShot 3 summary: It is clarified that the favorite flower was the Egyptian Water Lily, also known as the Blue Lotus Flower which is shown on a cardboard box.\nShot 4 summary: The screen shows that the blue lotus, also referred to as the Egyptian water lily, is mildly psychoactive and could be consumed as a tea.\nShot 5 summary: The shot showcases a bowl of blue lotus flowers hinting at their use.\nShot 6 summary: The focus is on the blue lotus flower extract.\nShot 7 summary: A wooden board displays words revealing that the extraordinary Blue Lotus blossom possesses mild psychoactive properties.\nShot 8 summary: The screen reinforces the description of the blue lotus blossom with its mild psychoactive properties.\nShot 9 summary: The shot presents people cutting out tea on a cutting board indicating its consumption methods.\nShot 10 summary: The video shifts to a kitchen setup where someone is preparing herbal tea or cigarettes, possibly of Blue Lotus.\nShot 11 summary: A person is shown cutting an apple into slices while mentioning of these flowers being smoked alone.\nShot 12 summary: An explanation is given about these flowers occasionally being blended with others.\nShot 13 summary: Blue Lotus' benefits such as promoting deep relaxation and having mood-lifting and aphrodisiac effects are properly detailed on screen.\nShot 14 summary: The text on screen and audio both explain how the blue lotus has been used for thousands of years to induce a profound state of relaxation.\nShot 15 summary: The narration completes the sentence started in the previous shot, talking about a state of relaxation induced by blue lotus.\nShot 16 summary: The shot showcases a jar holding text about promoting relaxation using Blue Lotus.\nShot 17 summary: Tumeric is shown on screen with a caption mentioning its mood enhancing qualities.\nShot 18 summary: The shot describes the plant's mood-enhancing qualities and its ability to spark feelings of passion.\nShot 19 summary: Some individuals reportedly experience an augmented sense of awareness, likely after consuming the plant.\nShot 20 summary: The report of heightened sense of awareness is continued in this shot.\nShot 21 summary: A quick reference is made to individuals who report an augmented sense of awareness.\nShot 22 summary: This shot swiftly transitions to a new topic.\nShot 23 summary: The narration on the soundtrack appears to be making a point about others' experiences.\nShot 24 summary: In this frame, a woman is seen holding a jar with a quote about awareness possibly related to the plant's effects.\nShot 25 summary: The shot shows a jar of what appears to be blue borax, with the text underscoring its role in facilitating vivid and lucid dreaming.\nShot 26 summary: A tray of seeds are shown as an exceptional alternative for those dealing with certain difficulties.\nShot 27 summary: The shot concentrates on anxiety and insomnia, introducing the plant as an alternative for people dealing with these conditions.\nShot 28 summary: The insomnia or anxiety topics continue, with mention of people seeking alternative options to their usual flower.\nShot 29 summary: The shot shows a person cutting flowers on a cutting board, possibly involving an alternative utilization.\nShot 30 summary: A mason jar on screen holds a quote regarding a period of tolerance.\nShot 31 summary: The shot continues to discuss a period of a tolerance break.\nShot 32 summary: In the final shot, viewers are guided to make their own lavender and sage incense with text overlay promoting the plant."
    },
    {
        "tiny_desc": "skincare grease remover",
        "description": "Woman explaining her greasy skin situation and showing how she removes excess grease",
        "user": "stellarosalife",
        "caption": "Replying to @ajajajajaj734 i have been using this magic rock for years. Grease face game changer! #nurselife",
        "likes": "39.7K",
        "comments": "354",
        "bookmarks": "7322",
        "shares": "667",
        "originalSound": "original sound - Stella",
        "url": "videos/59.mp4",
        "video_description": "The video is a skincare and makeup tutorial by a TikToker who goes by the username @stellarosalife, where she shares her unique skincare and mid-shift touch-up routine. She reveals that the secret to her fresh skin look, even after a long hospital shift, is not just skincare but also a 'volcanic rock thing' she sells on her TikTok shop. She adds that people often mistake her glowy skin for greasiness, which she considers unappealing. To combat that, she touches up her makeup mid-shift to keep her look fresh. Later, she demonstrates how the volcanic rock effectively removes excess grease from the skin without rubbing off makeup. This is followed by her applying powder to freshen up her makeup without making it appear overdone or 'nasty'. She firmly vouches for the volcanic rock, calling it a crucial tool for midday makeup touch-ups. The video ends with her wishing the viewers a goodnight. Throughout the video, she records herself inside a car, at times in the backseat and sometimes in the front, applying and explaining her skincare and makeup routine.",
        "summary_10": "@stellarosalife reveals her car skincare routine featuring volcanic rock.\n",
        "summary_25": "TikToker @stellarosalife shares her skincare routine in a car, highlighting a volcanic rock product from her shop for mid-shift makeup touch-ups that control greasiness.\n",
        "summary_50": "The video features TikToker @stellarosalife sharing her skincare, makeup routine, and mid-shift touch-ups. She reveals her secret: a volcanic rock product from her shop that removes skin grease without smudging makeup. Her routine helps maintain a fresh, non-greasy appearance. She records these tips inside a car.",
        "ocr": "so there is a little bit of a secret to this Reply to ajajajajaj734's comment I need your skin routine asap because I'm not looking that fresh after a long hospital shift. and it's not just necessarily my skincare I do take care of my skin skin I'm not lying about that but there's one key thing that I feel like a lot of people don't know about like literally they don't know about and it's this this little volcanic rock thing okay I put it in my shop I never advertise off there. but this is something that I feel like is importante to people um this is just greasy it might appear glowy but it's not it's like thick grease okay I also tell you touch up my makeup mid shift okay I do okay I also tellyou 2013 you look good you feel good you know when I look like a grease pit and no l don't feel good like a grease pit and nol so l go ahead and fix myself up just a little smidger I feel like no one even has one of these let me show you how she works okay look at this okay so it like takes off the grease without do you see the difference see this it's like that's pretty and this is a shine ball and then it takes off the grease the grease without removing your makeup okay so then when we put powder on to freshen up she doesn't look all nasty hey I swear by this stupid thing key for midday touch up makeup so that is all good night",
        "shot_descriptions": "Shot 1: In the first shot of the video, a woman in a car reveals a skincare secret while answering a user's comment about her post-hospital shift appearance. She emphasizes the importance of skincare.\nShot 2: In the second shot, the woman continues her previous point, introducing a little volcanic rock product that she finds crucial, although it's not widely known. She advertises this product in her TikTok shop and addresses the misconception of greasiness being mistaken as glowiness.\nShot 3: The third shot is brief, with the woman filming herself in the car's mirror and starting to discuss touching up makeup while working.\nShot 4: In the fourth shot, the woman elaborates on her makeup routine during her shift, reinforcing the idea that looking good corresponds to feeling good.\nShot 5: The fifth shot has the woman continuing her point on looking and feeling good, mentioning that she rectifies her appearance when she feels greasy to boost her morale.\nShot 6: In the sixth shot, she introduces a new product, presumably a hair-dryer, indicating its rarity among users.\nShot 7: The seventh shot shows the woman demonstrating the use of the previously mentioned product in the car.\nShot 8: In the eighth shot, she talks about the effects of the product on her skin while using a makeup brush in her car. She points out the noticeable difference it makes to her oily skin without affecting her makeup.\nShot 9: In the ninth shot, she continues by showing that the product removes greasiness without removing makeup.\nShot 10: In the tenth video shot, she notes that applying powder to freshen up doesn't look bad due to the previously introduced product, swearing by its effectiveness.\nShot 11: In the final eleventh shot, she wraps up her points on midday make-up touch-ups and wishes her viewers a good night, ending in the car with text on screen."
    },
    {
        "tiny_desc": "Me vs alarm animation",
        "description": "Meme of animated person setting multiple alarms and spouse getting annoyed",
        "user": "dark_tales0",
        "caption": "Me verses alarm⏰😂 #viralvideos #funny #foryoupage #alarm #work #memes #animationmeme #animation #usa #uk",
        "likes": "1.1 Million",
        "comments": "6031",
        "bookmarks": "101.6K",
        "shares": "74.3K",
        "originalSound": "original sound - 🌑Tales🕶️",
        "url": "videos/60.mp4",
        "video_description": "The video, titled \"POV: Me verses Alarm TikTok,\" humorously illustrates the perennial struggle of waking up to an alarm in the morning through cartoon imagery. The short video creatively uses images of two cartoon characters lying in bed, intercut with shots of an alarm clock, effectively metaphorizing the juxtaposition. The cartoon figures, encapsulating the human tendency for succumbing to sleep, are frequently seen on the bed, alternated with visual displays of the alarm set for various intervals starting from 5:00 AM. In one shot, there is being a display of multiple alarms set within a progressively short window of 5 minutes each. This comedic take on the universal struggle of battling the alarm clock continues through various shots, ultimately leaving viewers with a nuanced portrayal of 'me vs alarm,' through cartoon imagery.",
        "summary_10": "The video humorous cartoon depicts struggles with morning alarms.",
        "summary_25": "The video \"POV: Me verses Alarm TikTok\" humorously showcases the universal struggle of waking up to alarms through cartoons.",
        "summary_50": "The \"POV: Me verses Alarm TikTok\" video humorously depicts the struggle of waking up to an alarm using cartoons. It alternates between characters lying in bed and shots of an alarm clock. It comically illustrates the universal struggle of humans versus alarm clocks, through animated visuals.",
        "ocr": "POV: Me verses Alarm TikTok.",
        "shot_descriptions": "Shot 1: A couple of cartoons sleep in bed under the text 'POV: Me verses Alarm TikTok.'\nShot 2: Two men lay in bed while a cartoon man looks at a phone under the text 'J TikTok'.\nShot 3: There's a cartoon character visual representing 'pcv me versus alarm'.\nShot 4: An on-screen text displays alarm time intervals from 5:00 am to 5:35 am under the title 'PCV me versus alarm screenshot'.\nShot 5: The text 'POV: Me verses Alarm' is shown on the video screen.\nShot 6: A cartoon illustration is shown with the phrase 'pc me versus alarm.'\nShot 7: A table with an alarm on it is depicted in a drawing.\nShot 8: A scene features two cartoon characters in bed, with one sleeping.\nShot 9: An illustration depicts 'pcv me versus alarm.'\nShot 10: A cartoon shows a man lying down in bed.\nShot 11: The scene is a drawing of a person standing next to a door."
    },
    {
        "tiny_desc": "you deserve waffles",
        "description": "Joke situation where guy says \"you deserves waffles Steve\"",
        "user": "therealsamalkhatib",
        "caption": "You deserve waffles pal 🧇 #foodtiktok #breakfast #fyp",
        "likes": "1.1 Million",
        "comments": "6804",
        "bookmarks": "96.9K",
        "shares": "10.2K",
        "originalSound": "Dolce Nonna - Wayne Jones & Amy Hayashi-Jones",
        "url": "videos/61.mp4",
        "video_description": "The video is a humor-laden conversation between two men, presumably named Steve and Terry, who are both seen having breakfast, primarily consisting of waffles and pancakes. In the initial shots, a man named Steve in a suit is seen enjoying waffles, followed by another man, Terry, devouring a stack of pancakes. Terry questions Steve's choice of pancakes since Steve had earlier expressed his liking for waffles. Steve casually responds that while he likes waffles, he also enjoys pancakes. This exchange gives way to a humorous mockery of a profound life lesson. Terry continues to persist that if Steve likes waffles, he should get waffles and that he shouldn't settle for his second-best option. The conversation takes a humorous turn towards the concept of settling for less in life symbolized by the choice between waffles and pancakes. The video concludes with the significant message, \"In a world where everyone's settling for pancakes, you deserve waffles.\" Throughout the video, both characters are seen at the breakfast table wearing suits, eating, and engaging in this amusing yet insightful waffle-pancake banter.",
        "summary_10": "The video humorously contrasts waffles and pancakes to discuss settling for less.\n",
        "summary_25": "The video humorously depicts a breakfast debate between Steve and Terry on not settling for less, symbolized by their preference for waffles or pancakes.",
        "summary_50": "The video features a comedic dialogue between Steve and Terry over breakfast. While both enjoy pancakes, Terry humorously argues that Steve, who prefers waffles, shouldn't settle for pancakes - his second option. This quirky conversation alludes to a life lesson about not settling for less.\n",
        "ocr": "Do you like waffles Steve? I like waffles Terry. Then why'd ya get pancakes? 'cause I also like pancakes. That's weird. It's not that weird Terry. If ya like waffles you should get waffles. Maybel will next time. What if there is no next time. Amlin danger or somethin? I'm just sayin. There will most likely be a next time Terry. You can't like the rest of your life settling for your second option. What is this a therapy session? You deserve waffles Steve. In a world where everyone's settling for pancakes..",
        "shot_descriptions": "Shot 1: A man in a suit is sitting at a table and eating waffles as he responds affirmatively to the text on screen asking if he likes waffles.\nShot 2: Despite expressing his love for waffles, a man is seen in a suit eating pancakes instead during the shot of 2 seconds.\nShot 3: The man in his suit and tie continues to eat pancakes, with a text on screen questioning his choice of pancakes over waffles.\nShot 4: A man is seen holding a plate of pancakes, justifying his choice by stating that he likes pancakes as well.\nShot 5: A man in a suit is seen eating breakfast, with a text on screen labeling his food choices as weird.\nShot 6: The man in a suit with pancakes in front of him defends his choice, stating it's not weird.\nShot 7: A suited man is seen having breakfast with a plate of waffles, with the text on screen suggesting he should have gotten waffles if he likes them.\nShot 8: The man in the suit considers getting waffles next time as he sits at a table in front of pancakes.\nShot 9: While eating breakfast, the man in a suit contemplates the uncertainty of a next time to get waffles according to the text on screen.\nShot 10: A man is eating breakfast at a table in silence, without any speech or text on screen.\nShot 11: A man in a suit is seen eating breakfast at a table without any text or audio transcript.\nShot 12: A man is seen eating pancakes, wondering aloud if he is in danger which is echoed by the text on screen.\nShot 13: A man sits silently at a breakfast table, only briefly remarking that he's just saying, according to the text on screen.\nShot 14: A man eating pancakes on a table reassures that there will most likely be a next chance, according to the audio transcript and text on screen.\nShot 15: As the man in a suit continues to eat his breakfast, the text on screen warns against settling for second options in life.\nShot 16: The man in a suit, while eating pancakes, questions whether this is a therapy session according to the audio transcript.\nShot 17: Still eating breakfast, the man is told via text on screen and audio transcript that he deserves waffles in a world where everyone's settling for pancakes.\nShot 18: A silent shot of a man eating a pancake on a table, with the audio transcript echoing the previous sentiment that he deserves waffles."
    },
    {
        "tiny_desc": "fruit slicer",
        "description": "Showcase of new cool slicer by cubing watermelon",
        "user": "monicas.cutting.b",
        "caption": "#tiktokmademebuyit #fypシ #slicer #vegetablechopper",
        "likes": "6708",
        "comments": "445",
        "bookmarks": "326",
        "shares": "27",
        "originalSound": "original sound - Monica's cutting board",
        "url": "videos/62.mp4",
        "video_description": "The video is a tutorial about efficient watermelon cutting techniques, presented by a user with the handle @monicas.cutting. The video begins with a woman slicing a watermelon and chopping it into pieces. She continues to demonstrate a method of quickly and efficiently slicing the watermelon using a specialized tool described as a steel needle slicer - she suggests this method for being both fun and labor-saving. The footage then transitions to a person using a grater for creating watermelon dices or strips, emphasizing ease of use. A person is then shown cutting the fruit into finer pieces using scissors, highlighting the visual appeal of the final product. The next shots illustrate the finished watermelon slices, a demonstration of the various techniques explained. Somewhat confusingly, the video ends with a shot of sliced meat on a tray next to a knife and scissors, not connected to the watermelon cutting tutorial. This video seems geared towards viewers, perhaps culinary enthusiasts, interested in learning new kitchen techniques and tips.",
        "summary_10": "Video teaches quick watermelon slicing for culinary enthusiasts; ends with meat.",
        "summary_25": "The video by @monicas.cutting teaches quick watermelon slicing techniques, concluding unexpectedly with sliced meat. Aimed at culinary enthusiasts learning new skills.\n",
        "summary_50": "This video tutorial, by @monicas.cutting, demonstrates efficient methods for slicing and dicing watermelon using various tools. Showcasing different techniques from standard slicing, use of a steel needle slicer to grating, it ends unexpectedly with a shot of sliced meat. It's tailored for culinary enthusiasts eager to learn new skills.\n",
        "ocr": "None",
        "shot_descriptions": "Shot 1: A one-second scene where someone is cutting a slice of watermelon, and the on-screen text denotes a username, and audio guides about a route to cut fast.\nShot 2: A 10-second scene that shows a person slicing watermelon on a white grater, with on-screen text that appears to be repetitive, and audio instructions about using a slicer and steel needle.\nShot 3: The four-second shot shows a person dicing watermelon using a grater, the text on the screen is 'SE AND STAR', and the audio conveys that the tool is easy to use.\nShot 4: The one-second scene presents a woman slicing a watermelon, and the audio comments on the appealing outcome of fruit cuts.\nShot 5: In a three-second shot, there is no audio or on-screen text, just watermelon slices being cut on a cutting board.\nShot 6: A three-second scene is demonstrating cutting watermelon preparation for salad, with repetitive text on screen, but no accompanying audio.\nShot 7: A two-second shot which is without audio or text, only shows a steak and watermelon being cut on a cutting board."
    },
    {
        "tiny_desc": "Houston map meme",
        "description": "Meme of Google maps saying it takes 1 hour to go from Houston to Houston",
        "user": "thehuxfam",
        "caption": "Houston we have a problem #Houston #HoustonTexas #HoustonTX #Funny #Humor #TexasHumor #Lol #Texas ##CapCut",
        "likes": "28.7K",
        "comments": "610",
        "bookmarks": "606",
        "shares": "1035",
        "originalSound": "original sound - The Hux Family",
        "url": "videos/63.mp4",
        "video_description": "The video opens with a screenshot of a map pointing out where Houston is located, along with text overlay referring to different areas and time durations like Conroe, The Woodlands, Cypress, and Katy among others. The audio transcript accompanying this shot has a person saying, \"You mean, we didn't meet?\" The video then abruptly shifts to show a blonde woman crying, against a black background. This second shot doesn't have any audio or on-screen text. Despite this stark visual shift, the video appears to tell a story of someone who seems to be dealing with a missed connection, in the context of Texas travel.",
        "summary_10": "Video: Houston map, missed meet-up audio, crying woman suggest disconnect.",
        "summary_25": "The video depicts a Houston map, an audio hinting at a missed meet-up, and a weeping woman, implying a failed connection.",
        "summary_50": "The video showcases a map of Houston with location tags, accompanied by the audio, \"You mean, we didn't meet?\", subsequently displaying a crying blonde woman. It hints at a missed connection during Texas travel.",
        "ocr": "None",
        "shot_descriptions": "SHOT 1: A 6-second shot features a girl using her phone to display a map. The map is detailed with various Houston-related locations and travel durations. She questions audibly, 'You mean, we didn't meet?'\nSHOT 2: The second shot, of no specified duration, presents a look at her mother, who is visibly upset and crying."
    }
]