[
    {
        "video_description": "The video begins with a shot lasting 6 seconds, featuring the text \"Tik Tok @miss_noodles23 If you're not real @miss_noodles23 Then how come I feel this way? Then how come feel this little babies? Little babies.\" There is also a shot audio transcript saying \"If you are not real, then how come I feel this way? Little.\" In terms of visuals, the shot shows a dog playing with some stuffed animals.\n\nThe second shot in the video lasts 4 seconds and displays the text \"TikTok\" on screen. There is no shot audio transcript in this shot. The shot features the TikTok logo on a black background.",

        "summary_10": "A 6s shot shows TikTok text, dog with stuffed animals. 4s shot has TikTok logo.",
        "summary_25": "A 6-second shot shows a text about TikTok and a dog playing with stuffed animals. A 4-second shot displays the TikTok logo on a black background.",
        "summary_50": "The video begins with a 6-second shot featuring a text about TikTok and a dog playing with stuffed animals. The second 4-second shot shows the TikTok logo on a black background."
    },

    {
        "video_description": "The video is a cooking tutorial posted on TikTok by a user named @mealsandmunchies. The video is a quick and easy recipe for a pasta dish that requires only five ingredients.\n\nIn the first shot, which lasts 6 seconds, a large pan containing pasta and cheese is shown dripping down. The text on screen displays the TikTok handle of the user. The shot audio transcript mentions that the dish being prepared is quick, delicious, and requires only five ingredients. It also instructs to start by heating up ground beef or ground turkey in a skillet and boiling a pot of water.\n\nThe second shot, lasting 2 seconds, shows a person frying a hamburger on a frying pan. No text or audio is present in this shot.\n\nThe third shot, lasting 3 seconds, features a woman making beef patties in a pan. No text or audio is present in this shot either.\n\nIn the fourth shot, which lasts 4 seconds, a person is shown stirring some food into a bowl. No text is displayed on screen, but the shot audio transcript instructs to cook the pasta according to the package and shred up some mozzarella cheese.\n\nThe fifth shot, lasting 1 second, shows a hand putting a bowl full of food on a mixer. No text or audio is present in this shot.\n\nThe sixth shot, lasting 4 seconds, displays the TikTok handle of the user \"@mealsandmunchies\". The shot audio transcript mentions visiting mealsandmunchies.com for more recipes and instructs to season the ground meat with salt, pepper, Italian seasoning, and crushed red chili flakes. It also mentions adding a jar of marinara sauce and a block of cream cheese.\n\nIn the seventh shot, which lasts 7 seconds, a woman is shown frying some meat and vegetables in a frying pan. No text is displayed on screen, but the shot audio transcript instructs to combine the ingredients well and add cooked pasta.\n\nThe eighth shot, lasting 3 seconds, shows a person making an easy dish in a skillet with meat on it. No text is displayed on screen, but the shot audio transcript instructs to add mozzarella cheese on top.\n\nIn the ninth shot, lasting 4 seconds, a person is seen adding cheese to a skillet with cheese on it. No text is displayed on screen, but the shot audio transcript instructs to bake the dish for 10 minutes at 350 degrees.\n\nThe tenth shot, lasting 1 second, shows a pan with cheese on it placed on top of an electric stove. No text or audio is present in this shot.\n\nThe eleventh shot, lasting 1 second, displays an induction cooktop with some cooking pots on it. No text or audio is present in this shot.\n\nThe twelfth shot, lasting 3 seconds, shows a woman holding a plate of food with zucchini and shrimp. No text or audio is present in this shot.\n\nThe thirteenth and final shot, lasting 3 seconds, displays the logo for TikTok on a black background. No text or audio is present in this shot either.",

        "summary_10": "Cooking tutorial on TikTok with pasta, meat, and toppings shots.",
        "summary_25": "@mealsandmunchies shares a quick pasta dish recipe on TikTok with five ingredients. Shots show dripping pasta, frying meat, stirring pasta, adding toppings, and the final dish.",
        "summary_50": "This TikTok cooking tutorial by @mealsandmunchies shows a quick pasta dish with five ingredients. Shots include pan dripping pasta, frying meat, making patties, stirring pasta, adding toppings, frying meat and vegetables, and placing the dish on the stove. It ends with the TikTok logo."
    },

    {
        "video_description": "The video begins with a shot lasting 6 seconds, showing a text on screen that says \"Tik Tok my cat after sleeping for @ichysmom 18 hours, stomping on my head at 4:00am until I fed him, and beating up his little brother for no reason TikTok.\" The shot audio transcript says \"Oh Lord, how mercy today drained me.\" The shot description is a cat with its mouth open in a bed.\n\nThe second shot lasts 4 seconds and shows a text on screen. The shot description is the TikTok logo on a black background."
        ,
        "summary_10": "Cat in bed. TikTok logo.",
        "summary_25": "Cat in bed with mouth open. TikTok logo on black background.",
        "summary_50": "A cat with its mouth open in a bed. TikTok logo on a black background."
    },

    {
        "video_description": "The video starts with a shot of a woman in a green top sitting on a table. The shot lasts for 78 seconds and features the text \"Tik Tok @elysebelll\" on screen. The audio in the shot includes the woman singing and saying phrases like \"My head is sing\" and \"Hold on to the end.\" The shot ends with the woman saying \"Oh, ly to woo.\" The second shot is only 4 seconds long and shows the TikTok logo on a black background, with the text \"TikTok\" on screen."
        ,
        "summary_10": "A woman sings on a table with text, and TikTok logo.",
        "summary_25": "A woman sings on a table for 78 seconds with the text \"Tik Tok @elysebelll.\" A 4-second shot shows the TikTok logo on a black background.",
        "summary_50": "A woman sings and talks while sitting on a table in a green top for 78 seconds. The shot includes the text \"Tik Tok @elysebelll\". A 4-second shot shows the TikTok logo on a black background."

    },

    {
        "video_description": "In this video, shot 1 lasts for 5 seconds and shows a dog playing with its owner in a pool. The text on the screen says \"TikTok Tik Tok\" and the shot audio transcript includes the phrases \"Wait, wait\" and \"Lee Lee\". Shot 2 lasts for 4 seconds and depicts a woman swimming in a pool in a backyard. There is no text on the screen and no audio in this shot.",
        "summary_10": "9-second video: dog and owner play in a pool, woman swims in backyard pool. On-screen text: \"TikTok Tik Tok\".",
        "summary_25": "A 9-second video shows a dog playing in a pool with its owner, and a woman swimming in a backyard pool. Text on screen says \"TikTok Tik Tok\" and there's audio of phrases like \"Wait, wait\" and \"Lee Lee\".",
        "summary_50": "In this 9-second video, shot 1 shows a dog playing with its owner in a pool, while shot 2 depicts a woman swimming in a backyard pool. Shot 1 includes the text \"TikTok Tik Tok\" and audio of phrases like \"Wait, wait\" and \"Lee Lee\"."

    },

    {
        "video_description": "The video is a tutorial on how to make the salad that Jennifer Aniston ate everyday on the set of Friends. The video starts with a shot of the text on screen, introducing the topic of making the salad. The shot audio transcript mentions a rainy day. The shot duration is 3 seconds. The next shot shows the text on screen, indicating that 3 cups of cooked quinoa are needed for the salad. The shot audio transcript references the contrast. The shot duration is 3 seconds. Next, the text on screen mentions 1 cup of cucumber. The shot audio transcript mentions something about finding cucumbers. The shot duration is 3 seconds. The following shot is the longest, lasting 23 seconds. The text on screen lists the ingredients for the salad, including red onion, roasted salted pistachios, mint, parsley, feta cheese, canned chickpeas, lemons, olive oil, salt, and pepper. The shot audio transcript includes phrases like 'way, way, way' and 'change.' The shot description mentions a chickpea salad with chickpeas and kale seasoned with salt. The next shot is 2 seconds long and shows a person drizzling feta cheese on a bowl of kale salad. There is no text or audio transcript in this shot. The following shot lasts 4 seconds and shows a white plate of couscous salad on a counter. There is no text, but the shot audio transcript mentions being there. The last shot is also 4 seconds long and shows the TikTok logo with a dark background. The text on screen seems to be cut off, but mentions 'nourished.by.ma...' implying the TikTok handle of the creator. Overall, the video provides a step-by-step guide on how to make Jennifer Aniston's everyday salad, showcasing the ingredients and demonstrating the preparation process.",

        "summary_10": "Tutorial on making Jennifer Aniston's salad from Friends with ingredients showcased.",

        "summary_25": "The video is a tutorial on making Jennifer Aniston's everyday salad from Friends, showcasing the ingredients and preparation process.", 

        "summary_50": "The video is a tutorial on making Jennifer Aniston's everyday salad from Friends. It includes shots of text and audio, showcasing the ingredients and preparation process."
    }
]